Understanding-CPP.org
#+INCLUDE: theme/style.org
#+TITLE: CPP / C++ Review
#+DESCRIPTION: cpp c++ code examples, demonstrations, design pattern and integration.
#+STARTUP: content 

 - [[wiki:index][Index]]

* Understanding C++ 
** C++ Benefits and Costs 

Some C++ compelling features which sets it apart from most
programming languages are: 

 + Compilation to native code.
 + High Performance and zero-cost abstractions.
 + Hardware portability and compiler availability for many processor
   and hardware architechtures. C++ has the widest range of processor
   support, so it can run on mainstream x86, desktop processors;
   mobile phone ARM-based CPUs; GPUs; embedded processors and
   microcontrollers.
 + Direct access to the operating system C-API and system calls.
 + Interoperability with C libraries.
 + Direct Access to Memory which is important on embedded systems for
   accessing memory-mapped IO devices.

 Disadvantages: 

 + Language complexity

 + Lack of a comprehensive standard library. 

 + Compiler's cryptic error messages. 

 + Lack of agreed package manager.

 + ABI - Application Binary Interface Issues - due the
   non-standardized ABI, it is almost impossible to link object-code
   (aka compiled code) compiled with different compilers. This is why,
   unlike Java and C#,  there is almost no pre-compiled libraries for
   C++ what makes the binary reuse hard.

** C++ New Features and Standards

 + *C++11*
   + C++11 Working Draft  http://wg21.link/n3242
   + See:
     + [[https://isocpp.org/wiki/faq/cpp11-language#auto][C++11 Language Extensions — General Features, C++ FAQ]]
     + http://www.windowscpp.com/CPP11FAQ.htm
   + Features which supports Functional Programming 
     + auto keyworkd for type deduction (aka type inference)
       + Which relieves the developer from writing all types and
         simplifies the code.
     + Lambda functions and std::function
       - Introduces the functional programming paradigm in C++ allowing
         users to write higher-order functions and reusable algorithms.
     + Tuples
       + allows returning multiple values 
     + Move Semantics:
       - Transfer resource ownership from temporary objects. This
         feature removes the runtime overhead of temporary objects and
         also allows to return containers such as vectors, string and
         etc from functions without runtime overhed or deep copy.
   + Library Support 
     + Smart Pointers => ~unique_ptr~ and ~shared_ptr~
       - Provides memory and resource management making the programs
         less prone to memory or resource leaks. Those pointers
         implments the RAII (Resource Acquisition is Initialization)
         idiom which takes advantage of C++ deterministic destructor for
         releasing resources no longer needed.
     + Regex
     + Cross-platform concurrency features.
       + Example: threads, monitors and locks which works on all
         supported platforms and operating systems.
   + Misc
     + nullpr - type-safe null pointer 
     + Ranged-based loop
   + Compile-time metaprogramming features 
     + Variadic Templates
     + Contexpr
       - Allows compile-time computations such as computing
         random numbers, encrypting string at runtime or generating
         look-up tables.
     + Static assert
     + String literals
     + User-defined literals 
 + *C++14*
   + C++14 Working Draft - http://wg21.link/n4296
   + See: [[https://isocpp.org/wiki/faq/cpp14-language][C++14 Language Extensions, C++ FAQ]]
   + _Binary Literals_: int x = 0b1001001 -> This feature is useful for
     embedded systems and dealing with bitmasks and hardware
     registers.
   + _Digit Separators_ - allows to write the number pi = 3.1415927 as pi = 3.141'592'7
   + _Generalized return type deduction_.
   + decltype(auto)
   + Genric Lambda - Now it is possible to use the keyword auto for
     deducing or infering the type of lambda arguments.
   + Variable Templates
   + _Extended Constexpr_ - contexpr functions can have loops, mutating
     variables and don't need to be recursive as it was before,
     consequently constexpr is able to peform more complex
     compile-time computations. 
   + [ [ deprecated ] ] attribute -> enables annotating an entity as
     deprecated and prints a compilation warn if a deprecated entity
     is used.
 + *C++17*
   + C++17 Working Draft - http://wg21.link/n4659
   + See:
     + http://www.cppstd17.com/
     + https://isocpp.org/wiki/faq/cpp17-language
     + [[https://www.infoworld.com/article/3044727/application-development/qa-bjarne-stroustrup-previews-c-17.html][Q&A: Bjarne Stroustrup previews C++ 17 | InfoWorld]]
   + std::any
   + std::variant
   + std::optional
   + key, value decomposition
   + Parallel algorithms
   + structured bindings
   + nested namespaces
   + File system libraries 
   + ... and much more ...!!
 + *C++20* - Coming soon.

Compiler Support: 

 + [[https://en.cppreference.com/w/cpp/compiler_support][C++ compiler support - cppreference.com]]
 + [[https://www.gnu.org/software/gcc/projects/cxx-status.html][C++ Standards Support in GCC - GNU Project - Free Software Foundation (FSF)]]
 + [[https://software.intel.com/en-us/articles/c17-features-supported-by-intel-c-compiler][C++17 Features Supported by Intel® C++ Compiler | Intel® Software]]
 + [[https://docs.microsoft.com/en-us/cpp/visual-cpp-language-conformance?view=vs-2017][Visual C++ Language Conformance | Microsoft Docs]]
