Understanding-CPP.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-12 Fri 18:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CPP / C++ Review</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="cpp c++ code examples, demonstrations, design pattern and integration."
 />
<meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0" />
<link href="theme/org-nav-theme.css" rel="stylesheet">
<link rel="icon" href="favicon.ico" type="image/vnd.microsoft.icon" />
</head>
<body>
<div id="content">
<h1 class="title">CPP / C++ Review</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org809e2bd">1. Understanding C++</a>
<ul>
<li><a href="#org4410daf">1.1. C++ Benefits and Costs</a></li>
<li><a href="#org6b32aa1">1.2. C++ New Features and Standards</a></li>
<li><a href="#org543dcb8">1.3. C++ Comparison with C, Java and C#</a></li>
<li><a href="#org357c735">1.4. Comparison C X C++(CPP)</a></li>
<li><a href="#org946af93">1.5. Value Semantics X Reference Semantics</a></li>
<li><a href="#org39f7054">1.6. C++11 - Uniform Initialization</a></li>
<li><a href="#org0441b68">1.7. Iterator based loops and for-range based loops</a>
<ul>
<li><a href="#orgb1851b5">1.7.1. Iterator based loop</a></li>
<li><a href="#org2750414">1.7.2. For-ranged based loops</a></li>
</ul>
</li>
<li><a href="#orgb989fbf">1.8. C++11 - Scoped Enum</a></li>
<li><a href="#org26845ae">1.9. Functor Function-Object and higher order functions</a></li>
<li><a href="#org3087219">1.10. Lambda Functions</a>
<ul>
<li><a href="#org1e0a6a8">1.10.1. Overview</a></li>
<li><a href="#orgfb90088">1.10.2. Basic Example</a></li>
<li><a href="#org1d4ea75">1.10.3. std::bind</a></li>
</ul>
</li>
<li><a href="#org15cc8ef">1.11. OOP Polymorphism</a>
<ul>
<li><a href="#orgaf15b97">1.11.1. Overview</a></li>
<li><a href="#org988da5d">1.11.2. Dynamic Polymorphism example</a></li>
<li><a href="#org85110a8">1.11.3. STL containers and polymorphism</a></li>
</ul>
</li>
<li><a href="#org3d0e997">1.12. Pointer to Member Function</a></li>
<li><a href="#org3703f5a">1.13. Template Metaprogramming or Generic Programming</a>
<ul>
<li><a href="#org0591170">1.13.1. Overview</a></li>
<li><a href="#orgd8f2a43">1.13.2. Template type-safe duck-typing or structural typing</a></li>
<li><a href="#org5fa9e80">1.13.3. Templates and C++ iterators</a></li>
<li><a href="#orgec6cc0b">1.13.4. Basic Template Specialization</a></li>
<li><a href="#org80e2271">1.13.5. Implementing Higher Order Functions with templates</a></li>
<li><a href="#orgf9a88f2">1.13.6. Metafunctions or type traits</a></li>
<li><a href="#org903563f">1.13.7. Variadic Templates</a></li>
<li><a href="#org63b0b1d">1.13.8. References and Bookmarks</a></li>
</ul>
</li>
<li><a href="#orgc693a28">1.14. Books</a></li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><a href='index.html'>Index</a></li>
</ul>

<div id="outline-container-org809e2bd" class="outline-2">
<h2 id="org809e2bd"><span class="section-number-2">1</span> Understanding C++</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4410daf" class="outline-3">
<h3 id="org4410daf"><span class="section-number-3">1.1</span> C++ Benefits and Costs</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Some C++ compelling features which sets it apart from most
programming languages are: 
</p>

<ul class="org-ul">
<li>Compilation to native code.</li>
<li>High Performance and zero-cost abstractions.</li>
<li>Hardware portability and compiler availability for many processor
and hardware architechtures. C++ has the widest range of processor
support, so it can run on mainstream x86, desktop processors;
mobile phone ARM-based CPUs; GPUs; embedded processors and
microcontrollers.</li>
<li>Direct access to the operating system C-API and system calls.</li>
<li>Interoperability with C libraries.</li>
<li>Direct Access to Memory which is important on embedded systems for
accessing memory-mapped IO devices.</li>
</ul>

<p>
Disadvantages: 
</p>

<ul class="org-ul">
<li>Language complexity</li>

<li>Lack of a comprehensive standard library.</li>

<li>Compiler's cryptic error messages.</li>

<li>Lack of agreed package manager.</li>

<li>ABI - Application Binary Interface Issues - due the
non-standardized ABI, it is almost impossible to link object-code
(aka compiled code) compiled with different compilers. This is why,
unlike Java and C#,  there is almost no pre-compiled libraries for
C++ what makes the binary reuse hard.</li>
</ul>
</div>
</div>

<div id="outline-container-org6b32aa1" class="outline-3">
<h3 id="org6b32aa1"><span class="section-number-3">1.2</span> C++ New Features and Standards</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><b>C++11</b>
<ul class="org-ul">
<li>C++11 Working Draft  <a href="http://wg21.link/n3242">http://wg21.link/n3242</a></li>
<li>See:
<ul class="org-ul">
<li><a href="https://isocpp.org/wiki/faq/cpp11-language#auto">C++11 Language Extensions — General Features, C++ FAQ</a></li>
<li><a href="http://www.windowscpp.com/CPP11FAQ.htm">http://www.windowscpp.com/CPP11FAQ.htm</a></li>
</ul></li>
<li>Features which supports Functional Programming 
<ul class="org-ul">
<li>auto keyworkd for type deduction (aka type inference)
<ul class="org-ul">
<li>Which relieves the developer from writing all types and
simplifies the code.</li>
</ul></li>
<li>Lambda functions and std::function
<ul class="org-ul">
<li>Introduces the functional programming paradigm in C++ allowing
users to write higher-order functions and reusable algorithms.</li>
</ul></li>
<li>Tuples
<ul class="org-ul">
<li>allows returning multiple values</li>
</ul></li>
<li>Move Semantics:
<ul class="org-ul">
<li>Transfer resource ownership from temporary objects. This
feature removes the runtime overhead of temporary objects and
also allows to return containers such as vectors, string and
etc from functions without runtime overhed or deep copy.</li>
</ul></li>
</ul></li>
<li>Library Support 
<ul class="org-ul">
<li>Smart Pointers =&gt; <code>unique_ptr</code> and <code>shared_ptr</code>
<ul class="org-ul">
<li>Provides memory and resource management making the programs
less prone to memory or resource leaks. Those pointers
implments the RAII (Resource Acquisition is Initialization)
idiom which takes advantage of C++ deterministic destructor for
releasing resources no longer needed.</li>
</ul></li>
<li>Regex</li>
<li>Cross-platform concurrency features.
<ul class="org-ul">
<li>Example: threads, monitors and locks which works on all
supported platforms and operating systems.</li>
</ul></li>
</ul></li>
<li>Misc
<ul class="org-ul">
<li>nullpr - type-safe null pointer</li>
<li>Ranged-based loop</li>
</ul></li>
<li>Compile-time metaprogramming features 
<ul class="org-ul">
<li>Variadic Templates</li>
<li>Contexpr
<ul class="org-ul">
<li>Allows compile-time computations such as computing
random numbers, encrypting string at runtime or generating
look-up tables.</li>
</ul></li>
<li>Static assert</li>
<li>String literals</li>
<li>User-defined literals</li>
</ul></li>
</ul></li>
<li><b>C++14</b>
<ul class="org-ul">
<li>C++14 Working Draft - <a href="http://wg21.link/n4296">http://wg21.link/n4296</a></li>
<li>See: <a href="https://isocpp.org/wiki/faq/cpp14-language">C++14 Language Extensions, C++ FAQ</a></li>
<li><span class="underline">Binary Literals</span>: int x = 0b1001001 -&gt; This feature is useful for
embedded systems and dealing with bitmasks and hardware
registers.</li>
<li><span class="underline">Digit Separators</span> - allows to write the number pi = 3.1415927 as pi = 3.141'592'7</li>
<li><span class="underline">Generalized return type deduction</span>.</li>
<li>decltype(auto)</li>
<li>Genric Lambda - Now it is possible to use the keyword auto for
deducing or infering the type of lambda arguments.</li>
<li>Variable Templates</li>
<li><span class="underline">Extended Constexpr</span> - contexpr functions can have loops, mutating
variables and don't need to be recursive as it was before,
consequently constexpr is able to peform more complex
compile-time computations.</li>
<li>[ [ deprecated ] ] attribute -&gt; enables annotating an entity as
deprecated and prints a compilation warn if a deprecated entity
is used.</li>
</ul></li>
<li><b>C++17</b>
<ul class="org-ul">
<li>C++17 Working Draft - <a href="http://wg21.link/n4659">http://wg21.link/n4659</a></li>
<li>See:
<ul class="org-ul">
<li><a href="http://www.cppstd17.com/">http://www.cppstd17.com/</a></li>
<li><a href="https://isocpp.org/wiki/faq/cpp17-language">https://isocpp.org/wiki/faq/cpp17-language</a></li>
<li><a href="https://www.infoworld.com/article/3044727/application-development/qa-bjarne-stroustrup-previews-c-17.html">Q&amp;A: Bjarne Stroustrup previews C++ 17 | InfoWorld</a></li>
</ul></li>
<li>std::any</li>
<li>std::variant</li>
<li>std::optional</li>
<li>key, value decomposition</li>
<li>Parallel algorithms</li>
<li>structured bindings</li>
<li>nested namespaces</li>
<li>File system libraries</li>
<li>&#x2026; and much more &#x2026;!!</li>
</ul></li>
<li><b>C++20</b> - Coming soon.</li>
</ul>

<p>
Compiler Support: 
</p>

<ul class="org-ul">
<li><a href="https://en.cppreference.com/w/cpp/compiler_support">C++ compiler support - cppreference.com</a></li>
<li><a href="https://www.gnu.org/software/gcc/projects/cxx-status.html">C++ Standards Support in GCC - GNU Project - Free Software Foundation (FSF)</a></li>
<li><a href="https://software.intel.com/en-us/articles/c17-features-supported-by-intel-c-compiler">C++17 Features Supported by Intel® C++ Compiler | Intel® Software</a></li>
<li><a href="https://docs.microsoft.com/en-us/cpp/visual-cpp-language-conformance?view=vs-2017">Visual C++ Language Conformance | Microsoft Docs</a></li>
</ul>
</div>
</div>
