Understanding-CPP.org
** Comparison C X C++(CPP)

|                         | C                                                 | C++                                                            |
|-------------------------+---------------------------------------------------+----------------------------------------------------------------|
| Creator                 | Dennis Ritchie                                    | Bjarne Stroustrup                                              |
| Paradigms               | Procedural / Imperative                           | Imperative, Object Orientated, Meta programming and Functional |
| Standard and Stable ABI | Yes                                               | No                                                             |
| Garbage Collector       | No                                                | No                                                             |
| Memory Management       | Manual                                            | Manual and Automatic                                           |
| Exceptions              | No                                                | Yes                                                            |
| Namespaces              | No                                                | Yes                                                            |
| Some use cases          | Low level system programming and embedded systems | High Performance Computing, Games, ...                         |
| Extensions              | .c (C-source code) and .h (header file)           | .cpp (c++ source code) and .hpp (c++ header file).             |
|                         |                                                   |                                                                |
|                         |                                                   |                                                                |

*File Extensions*

   + Source Files
     + *.cpp - C++ source files.
     + *.hpp - C++ header files.
     + *.o   - Object Code

   + Windows
     - *.exe - PE32 - Windows Executable
     - *.dll - Windows Shared Library

   + Unix (Linux, BSD ...)
     - (No extension or *.bin) - ELF - Unix Executable
     - *.so - Unix Shared Library

*Primitive Data Types*

| Type           | stdint.h type | Size (Bytes) | Size (Bits) | Range       | Description                                          |
|----------------+---------------+--------------+-------------+-------------+------------------------------------------------------|
| bool           |               |            1 |           8 |             | Boolean 0 (false) or 1 (true)                        |
| char           |               |            1 |           8 |             | Ascii character                                      |
| unsigned char  | uint8_t       |            1 |           8 | 0 to 255    | 1 byte integer                                       |
| signed char    | int8_t        |            1 |           8 | -128 to 127 |                                                      |
|                |               |              |             |             |                                                      |
| short          | int16_t       |            2 |          16 |             | 16 bits signed integer                               |
| unsigned short | uint16_t      |            2 |          16 |             |                                                      |
|                |               |              |             |             |                                                      |
| int            | int32_t       |            4 |          32 |             | 32 bits signed integer                               |
| unsigned int   | uint32_t      |            4 |          32 |             | 32 bits unsigned integer                             |
|                |               |              |             |             |                                                      |
|                |               |              |             |             |                                                      |
| float          |               |            4 |          32 |             | 32 bits IEEE 754 single-precision float point number |
| double         |               |            8 |          64 |             | 64 bits IEEE 754 double-precision float point Number |
| long double    |               |           10 |          80 |             | Extended precision non-IEEE float point number       |
|                |               |              |             |             |                                                      |


 - Note: The type char can be understood as an 8-bits integer. 
