Understanding-CPP.html

<div id="outline-container-org357c735" class="outline-3">
<h3 id="org357c735"><span class="section-number-3">1.4</span> Comparison C X C++(CPP)</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">C++</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Creator</td>
<td class="org-left">Dennis Ritchie</td>
<td class="org-left">Bjarne Stroustrup</td>
</tr>

<tr>
<td class="org-left">Paradigms</td>
<td class="org-left">Procedural / Imperative</td>
<td class="org-left">Imperative, Object Orientated, Meta programming and Functional</td>
</tr>

<tr>
<td class="org-left">Standard and Stable ABI</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left">Garbage Collector</td>
<td class="org-left">No</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left">Memory Management</td>
<td class="org-left">Manual</td>
<td class="org-left">Manual and Automatic</td>
</tr>

<tr>
<td class="org-left">Exceptions</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Namespaces</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Some use cases</td>
<td class="org-left">Low level system programming and embedded systems</td>
<td class="org-left">High Performance Computing, Games, &#x2026;</td>
</tr>

<tr>
<td class="org-left">Extensions</td>
<td class="org-left">.c (C-source code) and .h (header file)</td>
<td class="org-left">.cpp (c++ source code) and .hpp (c++ header file).</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
<b>File Extensions</b>
</p>

<ul class="org-ul">
<li>Source Files
<ul class="org-ul">
<li>*.cpp - C++ source files.</li>
<li>*.hpp - C++ header files.</li>
<li>*.o   - Object Code</li>
</ul></li>

<li>Windows
<ul class="org-ul">
<li>*.exe - PE32 - Windows Executable</li>
<li>*.dll - Windows Shared Library</li>
</ul></li>

<li>Unix (Linux, BSD &#x2026;)
<ul class="org-ul">
<li>(No extension or *.bin) - ELF - Unix Executable</li>
<li>*.so - Unix Shared Library</li>
</ul></li>
</ul>

<p>
<b>Primitive Data Types</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">stdint.h type</th>
<th scope="col" class="org-right">Size (Bytes)</th>
<th scope="col" class="org-right">Size (Bits)</th>
<th scope="col" class="org-left">Range</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">bool</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">8</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Boolean 0 (false) or 1 (true)</td>
</tr>

<tr>
<td class="org-left">char</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1</td>
<td class="org-right">8</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Ascii character</td>
</tr>

<tr>
<td class="org-left">unsigned char</td>
<td class="org-left">uint8_t</td>
<td class="org-right">1</td>
<td class="org-right">8</td>
<td class="org-left">0 to 255</td>
<td class="org-left">1 byte integer</td>
</tr>

<tr>
<td class="org-left">signed char</td>
<td class="org-left">int8_t</td>
<td class="org-right">1</td>
<td class="org-right">8</td>
<td class="org-left">-128 to 127</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">short</td>
<td class="org-left">int16_t</td>
<td class="org-right">2</td>
<td class="org-right">16</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">16 bits signed integer</td>
</tr>

<tr>
<td class="org-left">unsigned short</td>
<td class="org-left">uint16_t</td>
<td class="org-right">2</td>
<td class="org-right">16</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">int</td>
<td class="org-left">int32_t</td>
<td class="org-right">4</td>
<td class="org-right">32</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">32 bits signed integer</td>
</tr>

<tr>
<td class="org-left">unsigned int</td>
<td class="org-left">uint32_t</td>
<td class="org-right">4</td>
<td class="org-right">32</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">32 bits unsigned integer</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">float</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
<td class="org-right">32</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">32 bits IEEE 754 single-precision float point number</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">8</td>
<td class="org-right">64</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">64 bits IEEE 754 double-precision float point Number</td>
</tr>

<tr>
<td class="org-left">long double</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">10</td>
<td class="org-right">80</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Extended precision non-IEEE float point number</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<ul class="org-ul">
<li>Note: The type char can be understood as an 8-bits integer.</li>
</ul>
</div>
</div>
