Understanding-CPP.html
<div id="outline-container-org946af93" class="outline-3">
<h3 id="org946af93"><span class="section-number-3">1.5</span> Value Semantics X Reference Semantics</h3>
<div class="outline-text-3" id="text-1-5">
<p>
According to the - <a href="https://isocpp.org/wiki/faq/value-vs-ref-semantics">ISO C++</a>, value and reference semantics are defined
as: 
</p>

<blockquote>
<p>
With reference semantics, assignment is a pointer-copy (i.e., a
reference). Value (or “copy”) semantics mean assignment copies the
value, not just the pointer. C++ gives you the choice: use the
assignment operator to copy the value (copy/value semantics), or use
a pointer-copy to copy a pointer (reference semantics). C++ allows
you to override the assignment operator to do anything your heart
desires, however the default (and most common) choice is to copy the
value.
</p>
</blockquote>

<p>
<b>Definitions:</b>
</p>

<p>
<span class="underline">Reference Semantics</span>: Behavior where composite types are passed by
reference when assigned; passed as function or method parameters or
returned from functions. This is the default behavior of most object
oriented programming languages, except C++.
</p>

<p>
In Java, C#, Scala, Python and etc. Objects have reference semantics
by default. This example in Scala programming language shows how
<span class="underline">reference semantics</span> works in most languages.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span class="org-keyword">class</span> <span class="org-type">Foo</span><span class="org-rainbow-delimiters-depth-1">(</span>name<span class="org-keyword">:</span> <span class="org-type">String</span><span class="org-rainbow-delimiters-depth-1">){</span>
  <span class="org-scala-font-lockXprivate">private</span> <span class="org-keyword">var</span> <span class="org-scala-font-lockXvar">_name</span> <span class="org-keyword">=</span> name
  <span class="org-keyword">def</span> <span class="org-function-name">setName</span><span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-keyword">:</span> <span class="org-type">String</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-keyword">=</span>
    _name <span class="org-keyword">=</span> name
  <span class="org-keyword">def</span> <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">=</span>
    name
  <span class="org-scala-font-lockXoverride">override</span> <span class="org-keyword">def</span> <span class="org-function-name">toString</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">=</span>
    s<span class="org-string">"Foo { name = </span><span class="org-variable-name">$name</span><span class="org-string"> }"</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

scala&gt; <span class="org-keyword">var</span> <span class="org-scala-font-lockXvar">x</span> <span class="org-keyword">=</span> <span class="org-constant">10</span>
<span class="org-function-name">x</span><span class="org-keyword">:</span> <span class="org-type">Int</span> <span class="org-keyword">=</span> <span class="org-constant">10</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Primitive types have value semantics: assignment of variables of</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">primitive types, creates a copy, so both variables can be modified</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">without changing each other.</span>
scala&gt; <span class="org-keyword">var</span> <span class="org-scala-font-lockXvar">y</span> <span class="org-keyword">=</span> x
<span class="org-function-name">y</span><span class="org-keyword">:</span> <span class="org-type">Int</span> <span class="org-keyword">=</span> <span class="org-constant">10</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">By modifying x, the value of y remains the same.</span>
scala&gt; x <span class="org-keyword">=</span> <span class="org-constant">25</span>
<span class="org-function-name">x</span><span class="org-keyword">:</span> <span class="org-type">Int</span> <span class="org-keyword">=</span> <span class="org-constant">25</span>

scala&gt; y
<span class="org-function-name">res5</span><span class="org-keyword">:</span> <span class="org-type">Int</span> <span class="org-keyword">=</span> <span class="org-constant">10</span>

scala&gt; 

<span class="org-comment-delimiter">//</span><span class="org-comment">===&gt; Composite and complexity types have reference semantics by default </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">in languages other than C++.</span>

scala&gt; <span class="org-keyword">val</span> <span class="org-variable-name">foo</span> <span class="org-keyword">=</span> <span class="org-keyword">new</span> <span class="org-type">Foo</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"bar"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-function-name">foo</span><span class="org-keyword">:</span> <span class="org-type">Foo</span> <span class="org-keyword">=</span> <span class="org-constant">Foo</span> <span class="org-rainbow-delimiters-depth-1">{</span> name <span class="org-keyword">=</span> bar <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Assignment doesn't create a copy like assignment </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">of primitive type, actually the assignment creates </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">a reference to the object foo. As result, modifying </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">one of the objects, modifies the other.</span>
scala&gt; <span class="org-keyword">val</span> <span class="org-variable-name">bar</span> <span class="org-keyword">=</span> foo
<span class="org-function-name">bar</span><span class="org-keyword">:</span> <span class="org-type">Foo</span> <span class="org-keyword">=</span> <span class="org-constant">Foo</span> <span class="org-rainbow-delimiters-depth-1">{</span> name <span class="org-keyword">=</span> bar <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Modifying bar modifes foo. </span>
scala&gt; bar.setName<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"something"</span><span class="org-rainbow-delimiters-depth-1">)</span>

scala&gt; bar
<span class="org-function-name">res3</span><span class="org-keyword">:</span> <span class="org-type">Foo</span> <span class="org-keyword">=</span> <span class="org-constant">Foo</span> <span class="org-rainbow-delimiters-depth-1">{</span> name <span class="org-keyword">=</span> something <span class="org-rainbow-delimiters-depth-1">}</span>

scala&gt; foo
<span class="org-function-name">res4</span><span class="org-keyword">:</span> <span class="org-type">Foo</span> <span class="org-keyword">=</span> <span class="org-constant">Foo</span> <span class="org-rainbow-delimiters-depth-1">{</span> name <span class="org-keyword">=</span> something <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Passing as function parameter doesn't create a copy like in C++, </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">it passes the object by reference, so if the parameter is modified inside</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">the function, the original object will be modified too. </span>
 <span class="org-keyword">def</span> <span class="org-function-name">setFooPrint</span><span class="org-rainbow-delimiters-depth-1">(</span>param<span class="org-keyword">:</span> <span class="org-type">Foo</span><span class="org-rainbow-delimiters-depth-1">){</span>
   param.setName<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"dummy name"</span><span class="org-rainbow-delimiters-depth-2">)</span>
   println<span class="org-rainbow-delimiters-depth-2">(</span>foo<span class="org-rainbow-delimiters-depth-2">)</span>
 <span class="org-rainbow-delimiters-depth-1">}</span>

 scala&gt; setFooPrint<span class="org-rainbow-delimiters-depth-1">(</span>foo<span class="org-rainbow-delimiters-depth-1">)</span>
 <span class="org-constant">Foo</span> <span class="org-rainbow-delimiters-depth-1">{</span> name <span class="org-keyword">=</span> dummy name <span class="org-rainbow-delimiters-depth-1">}</span>

 scala&gt; foo
 res8<span class="org-keyword">:</span> <span class="org-type">Foo</span> <span class="org-keyword">=</span> <span class="org-constant">Foo</span> <span class="org-rainbow-delimiters-depth-1">{</span> name <span class="org-keyword">=</span> dummy name <span class="org-rainbow-delimiters-depth-1">}</span>

 <span class="org-comment-delimiter">// </span><span class="org-comment">Returning an object from a function doesn't create a copy as would happen </span>
 <span class="org-comment-delimiter">// </span><span class="org-comment">with primitive types.</span>
 <span class="org-keyword">def</span> <span class="org-function-name">modifyReturn</span><span class="org-rainbow-delimiters-depth-1">(</span>param<span class="org-keyword">:</span> <span class="org-type">Foo</span>, newName<span class="org-keyword">:</span> <span class="org-type">String</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-keyword">=</span> <span class="org-rainbow-delimiters-depth-1">{</span>
   param.setName<span class="org-rainbow-delimiters-depth-2">(</span>newName<span class="org-rainbow-delimiters-depth-2">)</span>
   param
 <span class="org-rainbow-delimiters-depth-1">}</span>
 scala&gt; <span class="org-keyword">val</span> <span class="org-variable-name">foob</span> <span class="org-keyword">=</span> modifyReturn<span class="org-rainbow-delimiters-depth-1">(</span>foo, <span class="org-string">"Scala + C++ + JNI == HPC"</span><span class="org-rainbow-delimiters-depth-1">)</span>
 foob<span class="org-keyword">:</span> <span class="org-type">Foo</span> <span class="org-keyword">=</span> <span class="org-constant">Foo</span> <span class="org-rainbow-delimiters-depth-1">{</span> name <span class="org-keyword">=</span> <span class="org-constant">Scala</span> + <span class="org-constant">C</span>++ + <span class="org-constant">JNI</span> == <span class="org-constant">HPC</span> <span class="org-rainbow-delimiters-depth-1">}</span>

 scala&gt; foo
 res9<span class="org-keyword">:</span> <span class="org-type">Foo</span> <span class="org-keyword">=</span> <span class="org-constant">Foo</span> <span class="org-rainbow-delimiters-depth-1">{</span> name <span class="org-keyword">=</span> <span class="org-constant">Scala</span> + <span class="org-constant">C</span>++ + <span class="org-constant">JNI</span> == <span class="org-constant">HPC</span> <span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
<span class="underline">Value Semantics</span>: Behavior where composite types such as instances of
classes are treated as primitive type such as booleans, integers or
float point numbers. In the value semantics, a copy is created when
variables are assigned; passed as parameters to functions or methods
and returned from functions. So modifying one of the variables doesn't
change the other. 
</p>

<p>
Unlike other languages, C++ uses value semantics by default, it means
that in operations such as assignment; returning objects from
functions and passing objects as parameters create a full copy of the
object, instead of creating a reference to the object as would happen
in most object oriented programming languages such as Java, C#,
Python, Ruby and etc. C++ also supports reference semantics, however
it is not the default behavior and unlike in the majority of
programming languages, requires explicit annotation to pass objects by
reference or create a reference to the object.
</p>

<p>
<b>Value Semantics in C++</b>
</p>

<p>
Example: demonstration of value semantics in C++ tested in the CERN's
C++ ROOT REPL:
</p>

<ul class="org-ul">
<li>Note: this code can be copied and pasted in the CERN's ROOT REPL.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">string</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-keyword">class</span> <span class="org-type">Foo</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">_name</span>;
<span class="org-function-name">public</span>:
  <span class="org-comment-delimiter">// </span><span class="org-comment">Constructor </span>
  <span class="org-function-name">Foo</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">)</span>:<span class="org-function-name">_name</span><span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">){}</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">Copy constructor</span>
  <span class="org-comment-delimiter">//</span><span class="org-comment">--------------------------</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">Note: If it is not defined, the compiler, defines </span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">a default copy constructor. It was created to demonstrate</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">when the copy constructor is invoked.</span>
  <span class="org-function-name">Foo</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">Foo</span>&amp; <span class="org-variable-name">rhs</span><span class="org-rainbow-delimiters-depth-2">){</span>
    _name = rhs._name;    
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [INFO] Copy constructor invoked."</span> &lt;&lt; <span class="org-constant">std</span>::endl;    
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">Copy assignment-operator</span>
  <span class="org-comment-delimiter">//</span><span class="org-comment">--------------------------</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">Note: It is similar to the copy constructor and</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">default assignment copy-assignment-operator is created</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">by the compiler if the user doesn't define it.</span>
  <span class="org-type">Foo</span> <span class="org-keyword">operator</span><span class="org-function-name">=</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">Foo</span>&amp; <span class="org-variable-name">rhs</span><span class="org-rainbow-delimiters-depth-2">){</span>    
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [INFO] Copy-assignment operator invoked."</span> &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-keyword">return</span> Foo<span class="org-rainbow-delimiters-depth-3">(</span>rhs._name<span class="org-rainbow-delimiters-depth-3">)</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-type">void</span> <span class="org-function-name">setName</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">){</span>
    _name = name;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> _name;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-type">void</span> <span class="org-function-name">show</span><span class="org-rainbow-delimiters-depth-2">(){</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Foo { name = "</span> &lt;&lt; _name &lt;&lt; <span class="org-string">" } "</span> &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-type">void</span> <span class="org-function-name">show2</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Foo { name = "</span> &lt;&lt; _name &lt;&lt; <span class="org-string">" } "</span> &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

</pre>
</div>

<p>
Assignment creates a copy, unlike in most OOP languages like Java, C#,
Python and so on. 
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; Foo foo<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"foo"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = foo <span class="org-rainbow-delimiters-depth-1">}</span> 

<span class="org-comment-delimiter">// </span><span class="org-comment">Assingment creates a copy, unlike in most OO languages</span>
&gt;&gt; Foo bar = foo; 
 <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">INFO</span><span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.

<span class="org-comment-delimiter">// </span><span class="org-comment">Modifying one of the objects, doens't change the other. </span>
&gt;&gt; bar.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = foo <span class="org-rainbow-delimiters-depth-1">}</span> 

&gt;&gt; bar.setName<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"I am object bar"</span><span class="org-rainbow-delimiters-depth-1">)</span>

&gt;&gt; bar.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = I am object bar <span class="org-rainbow-delimiters-depth-1">}</span> 

&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = foo <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 

<span class="org-comment-delimiter">// </span><span class="org-comment">foo and bar objects aren't the same as they have </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">different memory locations. </span>
&gt;&gt; &amp;foo == &amp;bar
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">bool</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-constant">false</span>
&gt;&gt;
</pre>
</div>

<p>
Primitive and composite types are passed by value in C++, unlike in
most OOP languages. So, it means that a copy of the object is created.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">void</span> <span class="org-function-name">setFooPrint</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">Foo</span> <span class="org-variable-name">param</span>, <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-1">){</span>
  param.setName<span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">)</span>;
  param.show<span class="org-rainbow-delimiters-depth-2">()</span>;
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" name = "</span> &lt;&lt; param.getName<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Modifying the function paramenter, doesn't modify the passed object.</span>
&gt;&gt; setFooPrint<span class="org-rainbow-delimiters-depth-1">(</span>foo, <span class="org-string">"dummy name"</span><span class="org-rainbow-delimiters-depth-1">)</span>
 <span class="org-rainbow-delimiters-depth-1">[</span>INFO<span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = dummy name <span class="org-rainbow-delimiters-depth-1">}</span> 
 name = dummy name

&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = foo <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 
</pre>
</div>

<p>
Returning an object from function, creates a copy of the object
instead of returning a reference to it like in Java, Scala, Python and
most languages.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">Foo</span> <span class="org-function-name">modifyReturn</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">Foo</span> <span class="org-variable-name">param</span>, <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">newName</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  param.setName<span class="org-rainbow-delimiters-depth-2">(</span>newName<span class="org-rainbow-delimiters-depth-2">)</span>;
  <span class="org-keyword">return</span> param;
<span class="org-rainbow-delimiters-depth-1">}</span>

&gt;&gt; <span class="org-keyword">auto</span> ret = modifyReturn<span class="org-rainbow-delimiters-depth-1">(</span>foo, <span class="org-string">"New name"</span><span class="org-rainbow-delimiters-depth-1">)</span>
 <span class="org-rainbow-delimiters-depth-1">[</span>INFO<span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.
 <span class="org-rainbow-delimiters-depth-1">[</span>INFO<span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">Foo</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7f54f0288050

&gt;&gt; &amp;ret == &amp;foo
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">bool</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-constant">false</span>

&gt;&gt; ret.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = New name <span class="org-rainbow-delimiters-depth-1">}</span> 

&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = foo <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 

</pre>
</div>

<p>
Value semantics and STL 
</p>

<ul class="org-ul">
<li>Objects can be stored in STL containers by value, reference or by
pointers.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">deque</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span> <span class="org-comment-delimiter">// </span><span class="org-comment">Double ended queue collection </span>

&gt;&gt; <span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-1">&lt;</span>Foo<span class="org-rainbow-delimiters-depth-1">&gt;</span> xs;

<span class="org-comment-delimiter">// </span><span class="org-comment">Temporary objects are created on the stack, </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">copied to the deque data structure and then </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">put on the collection. </span>
<span class="org-comment-delimiter">// </span>
&gt;&gt; xs.push_back<span class="org-rainbow-delimiters-depth-1">(</span>Foo<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"hello"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>;
 <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">INFO</span><span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.
&gt;&gt; xs.push_back<span class="org-rainbow-delimiters-depth-1">(</span>Foo<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"world"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>;
 <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">INFO</span><span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.
&gt;&gt; xs.push_back<span class="org-rainbow-delimiters-depth-1">(</span>Foo<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"value"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>;
 <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">INFO</span><span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.
&gt;&gt; xs.push_back<span class="org-rainbow-delimiters-depth-1">(</span>Foo<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"semantics"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>;
 <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">INFO</span><span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.
&gt;&gt; 

&gt;&gt; xs
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-2">&lt;</span>Foo<span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> @0x1393820, @0x1393840, @0x1393860, @0x1393880 <span class="org-rainbow-delimiters-depth-1">}</span>
&gt;&gt; 

&gt;&gt; xs.size<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">long</span><span class="org-rainbow-delimiters-depth-1">)</span> 4
&gt;&gt; 

&gt;&gt; xs.at<span class="org-rainbow-delimiters-depth-1">(</span>0<span class="org-rainbow-delimiters-depth-1">)</span>.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = hello <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; xs.at<span class="org-rainbow-delimiters-depth-1">(</span>0<span class="org-rainbow-delimiters-depth-1">)</span>.show2<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = hello <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 
&gt;&gt; xs.at<span class="org-rainbow-delimiters-depth-1">(</span>2<span class="org-rainbow-delimiters-depth-1">)</span>.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = value <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 

<span class="org-comment-delimiter">// </span><span class="org-comment">Error: invoke const reference method which is not annotated with 'const'</span>
&gt;&gt; <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: xs<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> x.show<span class="org-rainbow-delimiters-depth-2">()</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-function-name">ROOT_prompt_56</span>:1:26: error: member function <span class="org-warning">'</span>show<span class="org-warning">'</span> <span class="org-keyword">not</span> viable: 
<span class="org-warning">'</span><span class="org-keyword">this</span><span class="org-warning">'</span> argument has type <span class="org-warning">'</span><span class="org-keyword">const</span> Foo<span class="org-warning">'</span>, but <span class="org-type">function</span> <span class="org-function-name">is</span> <span class="org-keyword">not</span> marked <span class="org-keyword">const</span>
<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: xs<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> x.show<span class="org-rainbow-delimiters-depth-2">()</span>; <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Works as show2() is annotated with 'const'</span>
&gt;&gt; <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: xs<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> x.show2<span class="org-rainbow-delimiters-depth-2">()</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = hello <span class="org-rainbow-delimiters-depth-1">}</span> 
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = world <span class="org-rainbow-delimiters-depth-1">}</span> 
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = value <span class="org-rainbow-delimiters-depth-1">}</span> 
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = semantics <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 

<span class="org-comment-delimiter">// </span><span class="org-comment">Watesful for-loop: performs uncessary copies which could slow down and inccur </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">on a significant performance overhead in case of a large object.</span>
&gt;&gt; <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">auto</span> <span class="org-variable-name">x</span>: xs<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> x.show<span class="org-rainbow-delimiters-depth-2">()</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
 <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">INFO</span><span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = hello <span class="org-rainbow-delimiters-depth-1">}</span> 
 <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">INFO</span><span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = world <span class="org-rainbow-delimiters-depth-1">}</span> 
 <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">INFO</span><span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = value <span class="org-rainbow-delimiters-depth-1">}</span> 
 <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">INFO</span><span class="org-rainbow-delimiters-depth-1">]</span> Copy constructor invoked.
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = semantics <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 

<span class="org-comment-delimiter">// </span><span class="org-comment">By using emplace_back - a copy is not created.</span>
&gt;&gt; <span class="org-keyword">auto</span> xs2 = deque<span class="org-rainbow-delimiters-depth-1">&lt;</span>Foo<span class="org-rainbow-delimiters-depth-1">&gt;()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-2">&lt;</span>Foo, <span class="org-constant">std</span>::<span class="org-type">allocator</span><span class="org-rainbow-delimiters-depth-3">&lt;</span>Foo<span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{}</span>
&gt;&gt; 
&gt;&gt; xs2.emplace_back<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"hello"</span><span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; xs2.emplace_back<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"world"</span><span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; xs2.emplace_back<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"value"</span><span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; xs2.emplace_back<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"semantics"</span><span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; xs2
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-2">&lt;</span>Foo, <span class="org-constant">std</span>::<span class="org-type">allocator</span><span class="org-rainbow-delimiters-depth-3">&lt;</span>Foo<span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> @0x411ff30, @0x411ff50, @0x411ff70, @0x411ff90 <span class="org-rainbow-delimiters-depth-1">}</span>
&gt;&gt; 

&gt;&gt; <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: xs2<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> x.show2<span class="org-rainbow-delimiters-depth-2">()</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = hello <span class="org-rainbow-delimiters-depth-1">}</span> 
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = world <span class="org-rainbow-delimiters-depth-1">}</span> 
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = value <span class="org-rainbow-delimiters-depth-1">}</span> 
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = semantics <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 
</pre>
</div>

<p>
<b>Reference Semantics in C++</b>
</p>

<p>
Unlike in most programming languages where reference semantics for
complex types such as object is the default behavior, in C++ reference
semantics requires explicit annotation with reference operator (&amp;) or
passing objects by pointer. 
</p>

<p>
The default behavior of passing by value cause significant memory and
performance overhead. In order to avoid unnecessary copies, it is
preferable to pass objects by reference with operator (&amp;) or by const
reference when the object is not supposed to be modified by the
function the objects are passed to.
</p>

<ul class="org-ul">
<li>Create a reference in assignment operation instead of a copy.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = foo <span class="org-rainbow-delimiters-depth-1">}</span> 

&gt;&gt; Foo&amp; ref1 = foo;

&gt;&gt; ref1.setName<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"I am foo reference"</span><span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = I am foo reference <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 

<span class="org-comment-delimiter">// </span><span class="org-comment">The reference has the same memory location of foo.</span>
&gt;&gt; &amp;foo == &amp;ref1
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">bool</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-constant">true</span>
&gt;&gt; 
</pre>
</div>

<ul class="org-ul">
<li>Passing a parameter by reference instead of passing it by
value. Note: that the copy constructor is not invoked when passing
by reference.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">void</span> <span class="org-function-name">setFooPrintRef</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">Foo</span>&amp; <span class="org-variable-name">param</span>, <span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-1">){</span>
  param.setName<span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">)</span>;
  param.show<span class="org-rainbow-delimiters-depth-2">()</span>;
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" name = "</span> &lt;&lt; param.getName<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">}</span>

&gt;&gt; setFooPrintRef<span class="org-rainbow-delimiters-depth-1">(</span>foo, <span class="org-string">"dummy name"</span><span class="org-rainbow-delimiters-depth-1">)</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = dummy name <span class="org-rainbow-delimiters-depth-1">}</span> 
 name = dummy name

&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = dummy name <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 
</pre>
</div>

<ul class="org-ul">
<li>Returning objects from functions as references.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">Foo</span>&amp; <span class="org-function-name">modifyReturnRef</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">Foo</span>&amp; <span class="org-variable-name">param</span>, <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">newName</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  param.setName<span class="org-rainbow-delimiters-depth-2">(</span>newName<span class="org-rainbow-delimiters-depth-2">)</span>;
  <span class="org-keyword">return</span> param;
<span class="org-rainbow-delimiters-depth-1">}</span>

&gt;&gt; foo.setName<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"unnamed"</span><span class="org-rainbow-delimiters-depth-1">)</span>

&gt;&gt; fooRefx.setName<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"I am foo reference"</span><span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = I am foo reference <span class="org-rainbow-delimiters-depth-1">}</span> 

&gt;&gt; &amp;foo == &amp;fooRefx
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">bool</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-constant">true</span>
&gt;&gt; 

&gt;&gt; <span class="org-keyword">auto</span>&amp; fooRefAuto = modifyReturnRef<span class="org-rainbow-delimiters-depth-1">(</span>foo, <span class="org-string">"C++ type inference auto!"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">Foo</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7f54f0288010

&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = C++ type inference <span class="org-keyword">auto</span><span class="org-negation-char">!</span> <span class="org-rainbow-delimiters-depth-1">}</span> 

&gt;&gt; fooRefAuto.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = C++ type inference <span class="org-keyword">auto</span><span class="org-negation-char">!</span> <span class="org-rainbow-delimiters-depth-1">}</span> 

&gt;&gt; fooRefAuto.setName<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"C++17"</span><span class="org-rainbow-delimiters-depth-1">)</span>

&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = C++17 <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 

&gt;&gt; &amp;foo == &amp;fooRefAuto
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">bool</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-constant">true</span>
&gt;&gt; 
</pre>
</div>

<ul class="org-ul">
<li>Const references cannot be modified as any attempt to change it
will result in a compile-time error.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; Foo foo<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"foo"</span><span class="org-rainbow-delimiters-depth-1">)</span>;

&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = foo <span class="org-rainbow-delimiters-depth-1">}</span> 

&gt;&gt; foo.getName<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"foo"</span>

&gt;&gt; <span class="org-keyword">const</span> Foo&amp; fooRefConst = modifyReturnRef<span class="org-rainbow-delimiters-depth-1">(</span>foo, <span class="org-string">"C++ constant ref."</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">Foo</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7fbf2003c010

&gt;&gt; foo.show<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = C++ constant ref. <span class="org-rainbow-delimiters-depth-1">}</span> 

&gt;&gt; foo.getName<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"C++ constant ref."</span>
&gt;&gt; 

&gt;&gt; fooRefConst.show2<span class="org-rainbow-delimiters-depth-1">()</span>
Foo <span class="org-rainbow-delimiters-depth-1">{</span> name = C++ constant ref. <span class="org-rainbow-delimiters-depth-1">}</span> 
&gt;&gt; 

<span class="org-comment-delimiter">// </span><span class="org-comment">Any attempt to call a method not annotated with const will result </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">in a compile-time error. </span>
&gt;&gt; fooRefConst.show<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-function-name">ROOT_prompt_52</span>:1:1: error: member function <span class="org-warning">'</span>show<span class="org-warning">'</span> <span class="org-keyword">not</span> viable: <span class="org-warning">'</span><span class="org-keyword">this</span><span class="org-warning">'</span> 
argument has type <span class="org-warning">'</span><span class="org-keyword">const</span> Foo<span class="org-warning">'</span>, but <span class="org-type">function</span> <span class="org-function-name">is</span> <span class="org-keyword">not</span> marked <span class="org-keyword">const</span>
fooRefConst.show<span class="org-rainbow-delimiters-depth-1">()</span>
^~~~~~~~~~~
<span class="org-function-name">ROOT_prompt_30</span>:1:6: note: <span class="org-warning">'</span>show<span class="org-warning">'</span> declared here
<span class="org-type">void</span> show<span class="org-rainbow-delimiters-depth-1">(){</span> 
</pre>
</div>

<p>
<b>Summary</b> 
</p>

<ul class="org-ul">
<li>Value Semantics X Reference Semantics
<ul class="org-ul">
<li><span class="underline">Value Semantics</span> -&gt; Objects are assigned, passed to functions and
return from functions as primitive types without being modified
as what is modified is a copy of the object. This is default
behavior of C++.

<ul class="org-ul">
<li>Object A = B; =&gt; (C++ Only) Creates object A as a copy of the object B.</li>

<li>Object A = B.copy() (C#, Java, Python &#x2026;) Creates object A as
copy of object B. As value-semantics is not the default
behavior in thoses languages, it is necessary to invoke some
deep copy method explicity.</li>
</ul></li>

<li><span class="underline">Reference Semantics</span> -&gt; Objects are passed by reference or
pointer; assigned by pointer and so on. Objects passed to
functions using reference semantics can modified. This is the
default behavior of Java, Python, C# and other programming
languages.

<ul class="org-ul">
<li>Object A = B; (C#, Java, Python &#x2026;) =&gt; The object A is
reference to object B. Any modification to A or B will modify
both as the refer to the same memory location.</li>

<li>Object&amp; A = B; (C++ only) =&gt; Creating a reference in C++
requires an explicit annotation with operator (&amp;) as it is
non-default behavior.</li>
</ul></li>
</ul></li>

<li>Most programming languages, except C++, uses value-semantics for
primitive types and reference semantics for complex or composite
types such as objects due to performance reasons.</li>

<li>C++ Uses <span class="underline">values-semantics</span> by default for all types, unlike most
programming languages, when any primitive type or composite type such
as class when assigned, passed to functions or returned from 
functions, copy is created and the original object is not
changed.</li>

<li><span class="underline">C++ supports both value and reference semantics</span> which is not
default for objects linke in Java, Python and other languages. The
reference semantics requires explicit annotation.</li>

<li>In order to avoid unncessary copies what would bring memory
peformance overhead, it is preferable to use reference semantics,
in other words, pass large objects by reference or const reference
to functions or methods.</li>

<li>Move semantics optmizes return-by value avoiding copy. The copy
overhead can avoided when returning an object from functions by
defining a <span class="underline">move constructor</span> (see C++11's move semantics) which
transfer resource ownership from the object defined locally within
the function body to the returned object.</li>
</ul>

<p>
<b>Further Reading:</b>
</p>

<ul class="org-ul">
<li>ISO C++ - Reference and Value Semantics -
<a href="https://isocpp.org/wiki/faq/value-vs-ref-semantics">https://isocpp.org/wiki/faq/value-vs-ref-semantics</a>
<ul class="org-ul">
<li>Note: Provides a good and clear definition about what really is
value and reference semantics.</li>
</ul></li>

<li>Andrezj's C++ blog - Value Semantics -
<a href="https://akrzemi1.wordpress.com/2012/02/03/value-semantics/">https://akrzemi1.wordpress.com/2012/02/03/value-semantics/</a></li>

<li>Value Semantics - Code of the danmed -
<a href="http://codeofthedamned.com/index.php/value-semantics">http://codeofthedamned.com/index.php/value-semantics</a></li>

<li>What do ‘value semantics’ and ‘pointer semantics’ mean? -
<a href="https://stackoverflow.com/questions/166033/what-do-value-semantics-and-pointer-semantics-mean">https://stackoverflow.com/questions/166033/what-do-value-semantics-and-pointer-semantics-mean</a></li>

<li>MSDN - Value Types (Modern C++) -
<a href="https://msdn.microsoft.com/en-us/library/hh438479.aspx">https://msdn.microsoft.com/en-us/library/hh438479.aspx</a>
<ul class="org-ul">
<li>Note:</li>
</ul></li>

<li>My Precious Compile Time Bool (long introduction to Move
Semantics) - <a href="https://medium.com/@gaussnoise/my-precious-compile-time-bool-long-introduction-to-move-semantics-c9ee73c370c7">https://medium.com/@gaussnoise/my-precious-compile-time-bool-long-introduction-to-move-semantics-c9ee73c370c7</a></li>

<li></li>
</ul>
</div>
</div>
