Understanding-CPP.html

<div id="outline-container-org39f7054" class="outline-3">
<h3 id="org39f7054"><span class="section-number-3">1.6</span> C++11 - Uniform Initialization</h3>
<div class="outline-text-3" id="text-1-6">
<p>
The C++11 uniform initialization feature allows classes, STL
containers (collections) and primitives values to be initialized in a
uniform way similar to vectors and C-arrays. 
</p>

<ul class="org-ul">
<li>Uniform initialization of primitive types:</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">int</span>    <span class="org-variable-name">x</span> <span class="org-rainbow-delimiters-depth-1">{}</span>;   <span class="org-comment-delimiter">// </span><span class="org-comment">x = 0</span>
<span class="org-type">double</span> <span class="org-variable-name">fd</span> <span class="org-rainbow-delimiters-depth-1">{}</span>;  <span class="org-comment-delimiter">// </span><span class="org-comment">fd = 0.0</span>
<span class="org-type">float</span>  <span class="org-variable-name">ff</span> <span class="org-rainbow-delimiters-depth-1">{}</span>;  <span class="org-comment-delimiter">// </span><span class="org-comment">ff = 0.0f</span>
<span class="org-type">bool</span>   <span class="org-variable-name">flag</span><span class="org-rainbow-delimiters-depth-1">{}</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">flag = false = 0 </span>
</pre>
</div>

<ul class="org-ul">
<li>Uniform initialization of C-arrays</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">int</span> <span class="org-variable-name">xs</span><span class="org-rainbow-delimiters-depth-1">[]</span> <span class="org-rainbow-delimiters-depth-1">{</span>10, 20, 30<span class="org-rainbow-delimiters-depth-1">}</span>;  <span class="org-comment-delimiter">//  </span><span class="org-comment">int xs[] =  {10, 20, 30};</span>
<span class="org-type">double</span> <span class="org-variable-name">ys</span><span class="org-rainbow-delimiters-depth-1">[</span>3<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-rainbow-delimiters-depth-1">{</span>1.0<span class="org-rainbow-delimiters-depth-1">}</span>;     <span class="org-comment-delimiter">//  </span><span class="org-comment">double ys[] = {1.0};</span>
</pre>
</div>

<ul class="org-ul">
<li>Uniform initialization of pointers</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">double</span>* <span class="org-variable-name">fdptr</span><span class="org-rainbow-delimiters-depth-1">{}</span> ; <span class="org-comment-delimiter">// </span><span class="org-comment">fdptr = nullptr </span>
</pre>
</div>

<ul class="org-ul">
<li>Uniform initialization of STL containers:</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::string s <span class="org-rainbow-delimiters-depth-1">{}</span>;                <span class="org-comment-delimiter">// </span><span class="org-comment">s = ""</span>
<span class="org-function-name">std</span>::string s <span class="org-rainbow-delimiters-depth-1">{</span><span class="org-string">"Hello world"</span><span class="org-rainbow-delimiters-depth-1">}</span>;   <span class="org-comment-delimiter">// </span><span class="org-comment">s = "Hello World"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Vectors </span>
<span class="org-function-name">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> xs <span class="org-rainbow-delimiters-depth-1">{}</span>;                      
<span class="org-function-name">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> ys <span class="org-rainbow-delimiters-depth-1">{</span>2.0, 3.0, 4.0, 5.0<span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-function-name">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">string</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> zs <span class="org-rainbow-delimiters-depth-1">{</span><span class="org-string">"apple"</span>, <span class="org-string">"orange"</span>, <span class="org-string">"grape"</span>, <span class="org-string">"banana"</span><span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Lists</span>
<span class="org-function-name">std</span>::<span class="org-type">list</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>   xs <span class="org-rainbow-delimiters-depth-1">{}</span>;
<span class="org-function-name">std</span>::<span class="org-type">list</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>   ys<span class="org-rainbow-delimiters-depth-1">{</span>2.0, 3.0, 4.0, 5.0<span class="org-rainbow-delimiters-depth-1">}</span>;   
<span class="org-comment-delimiter">// </span><span class="org-comment">Sets </span>
<span class="org-function-name">std</span>::<span class="org-type">set</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>    xs<span class="org-rainbow-delimiters-depth-1">{}</span>;
<span class="org-function-name">std</span>::<span class="org-type">set</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>    ys <span class="org-rainbow-delimiters-depth-1">{</span>3.0, 4.0, 3.0, 10.0<span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Unordered set </span>
<span class="org-function-name">std</span>::<span class="org-type">unordered_set</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>    xs<span class="org-rainbow-delimiters-depth-1">{}</span>;
<span class="org-function-name">std</span>::<span class="org-type">unordered_set</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">string</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> zs <span class="org-rainbow-delimiters-depth-1">{</span><span class="org-string">"apple"</span>, <span class="org-string">"orange"</span>, <span class="org-string">"grape"</span>, <span class="org-string">"banana"</span><span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Maps, aka hash map, aka dictionary, aka hash table </span>
<span class="org-function-name">std</span>::<span class="org-type">map</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::string,<span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> prices <span class="org-rainbow-delimiters-depth-1">{</span><span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"orange"</span>, 10.0<span class="org-rainbow-delimiters-depth-2">}</span>, <span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"grapes"</span>, 25.12<span class="org-rainbow-delimiters-depth-2">}</span>, <span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"apple"</span>, 4.12<span class="org-rainbow-delimiters-depth-2">}</span><span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<ul class="org-ul">
<li>Initialization of C-structus POD - Plain Old Data</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">struct</span> <span class="org-type">Point3D</span><span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-type">double</span> <span class="org-variable-name">x</span>;
    <span class="org-type">double</span> <span class="org-variable-name">y</span>;
    <span class="org-type">double</span> <span class="org-variable-name">z</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Before C++11</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">---------------------------</span>
<span class="org-type">Point3D</span> <span class="org-variable-name">pa</span>;
pa.x = 10.0;
pa.y = 20.0;
pa.z = 35.0;

<span class="org-comment-delimiter">// </span><span class="org-comment">After C++11</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">---------------------------</span>
<span class="org-type">Point3D</span> <span class="org-variable-name">pb</span> <span class="org-rainbow-delimiters-depth-1">{</span>10.0, 20.0, 35.0<span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-type">Point3D</span> <span class="org-variable-name">pc</span> = <span class="org-rainbow-delimiters-depth-1">{</span>10.0, 20.0, 35.0<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">C++ Vector - way 1</span>
<span class="org-function-name">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">Point3D</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span><span class="org-rainbow-delimiters-depth-2">{</span> 20.0, 15.0, 5.0<span class="org-rainbow-delimiters-depth-2">}</span>, <span class="org-rainbow-delimiters-depth-2">{</span> 10.0, 25.0, 12.4<span class="org-rainbow-delimiters-depth-2">}</span>, <span class="org-rainbow-delimiters-depth-2">{</span>-14.0, 0.32, 51.43<span class="org-rainbow-delimiters-depth-2">}</span><span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">C++ Vector - way 2 </span>
<span class="org-function-name">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">Point3D</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span>
      Point3D<span class="org-rainbow-delimiters-depth-2">{</span> 20.0, 15.0, 5.0<span class="org-rainbow-delimiters-depth-2">}</span>
     ,Point3D<span class="org-rainbow-delimiters-depth-2">{</span> 10.0, 25.0, 12.4<span class="org-rainbow-delimiters-depth-2">}</span>
     ,Point3D<span class="org-rainbow-delimiters-depth-2">{</span>-14.0, 0.32, 51.43<span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">C++ Map Containers </span>
<span class="org-function-name">std</span>::<span class="org-type">map</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::string, <span class="org-type">Point3D</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> locations = <span class="org-rainbow-delimiters-depth-1">{</span>
     <span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"City 1"</span>,    <span class="org-rainbow-delimiters-depth-3">{</span> 20.0, 15.0, 5.0<span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">}</span>
    ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"Somewhere"</span>, <span class="org-rainbow-delimiters-depth-3">{</span> 10.0, 25.0, 12.4<span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">}</span>
    ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"Nowhere"</span>,   <span class="org-rainbow-delimiters-depth-3">{</span>-14.0, 0.32, 51.43<span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">}</span>     
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">or in more pleasant notation </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">C++ Map Containers </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">locations2</span> = <span class="org-constant">std</span>::<span class="org-type">map</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::string, <span class="org-type">Point3D</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span>
     <span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"City 1"</span>,    <span class="org-rainbow-delimiters-depth-3">{</span> 20.0, 15.0, 5.0<span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">}</span>
    ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"Somewhere"</span>, <span class="org-rainbow-delimiters-depth-3">{</span> 10.0, 25.0, 12.4<span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">}</span>
    ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"Nowhere"</span>,   <span class="org-rainbow-delimiters-depth-3">{</span>-14.0, 0.32, 51.43<span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">}</span>     
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">//</span><span class="org-comment">--- Functions -------//</span>

<span class="org-type">Point3D</span> <span class="org-function-name">makeOriginPoint</span><span class="org-rainbow-delimiters-depth-1">(){</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">return Point3D{0.0, 0.0, 0.0};</span>
    <span class="org-keyword">return</span> <span class="org-rainbow-delimiters-depth-2">{</span>0.0, 0.0, 0.0<span class="org-rainbow-delimiters-depth-2">}</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Classes: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">class</span> <span class="org-type">A</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">public</span>: 
    <span class="org-function-name">A</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span>, <span class="org-type">double</span> <span class="org-variable-name">y</span>, <span class="org-type">double</span> <span class="org-variable-name">z</span>, <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">)</span>:
        m_x<span class="org-rainbow-delimiters-depth-2">(</span>x<span class="org-rainbow-delimiters-depth-2">)</span>,
        m_y<span class="org-rainbow-delimiters-depth-2">(</span>y<span class="org-rainbow-delimiters-depth-2">)</span>,
        m_z<span class="org-rainbow-delimiters-depth-2">(</span>z<span class="org-rainbow-delimiters-depth-2">)</span>,
        m_name<span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>      
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-keyword">auto</span> <span class="org-function-name">getX</span><span class="org-rainbow-delimiters-depth-2">()</span> -&gt; <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-keyword">return</span> m_x;<span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-keyword">auto</span> <span class="org-function-name">getY</span><span class="org-rainbow-delimiters-depth-2">()</span> -&gt; <span class="org-type">double</span> <span class="org-rainbow-delimiters-depth-2">{</span><span class="org-keyword">return</span> m_y;<span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-keyword">auto</span> <span class="org-function-name">getZ</span><span class="org-rainbow-delimiters-depth-2">()</span> -&gt; <span class="org-type">double</span> <span class="org-rainbow-delimiters-depth-2">{</span><span class="org-keyword">return</span> m_z;<span class="org-rainbow-delimiters-depth-2">}</span> 
<span class="org-function-name">private</span>:
    <span class="org-type">double</span> <span class="org-variable-name">m_x</span>;
    <span class="org-type">double</span> <span class="org-variable-name">m_y</span>;
    <span class="org-type">double</span> <span class="org-variable-name">m_z</span>; 
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-type">void</span> <span class="org-function-name">display</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">A</span>&amp; <span class="org-variable-name">a</span><span class="org-rainbow-delimiters-depth-1">){</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"A ("</span> &lt;&lt; a.getX<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-string">" "</span> &lt;&lt; a.getY<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; a.getZ<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-string">")"</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-type">int</span> <span class="org-function-name">main</span><span class="org-rainbow-delimiters-depth-1">(){</span>
    <span class="org-type">A</span> <span class="org-variable-name">instance1</span> <span class="org-rainbow-delimiters-depth-2">{</span>10.0, 20.0, 15.0, <span class="org-string">"unknown binary blob"</span><span class="org-rainbow-delimiters-depth-2">}</span>;  
    display<span class="org-rainbow-delimiters-depth-2">(</span>instance1<span class="org-rainbow-delimiters-depth-2">)</span>;
    display<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">{</span>10.0, 20.0, 15.0, <span class="org-string">"unknown binary blob"</span><span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    <span class="org-keyword">return</span> 0;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
References: 
</p>

<ul class="org-ul">
<li><a href="http://scottmeyers.blogspot.com/2015/09/thoughts-on-vagaries-of-c-initialization.html">The View from Aristeia: Thoughts on the Vagaries of C++ Initialization</a></li>
<li><a href="https://www.codeguru.com/cpp/cpp/article.php/c19081/C-2011-Uniform-Initialization.htm">C++ 2011: Uniform Initialization</a></li>
<li><a href="https://mbevin.wordpress.com/2012/11/16/uniform-initialization/">Lesson #3: Uniform Initialization | Mike's C++11 Blog</a></li>
<li><a href="https://softwareengineering.stackexchange.com/questions/133688/is-c11-uniform-initialization-a-replacement-for-the-old-style-syntax">c++ - Is C++11 Uniform Initialization a replacement for the old style syntax? - Software Engineering Stack Exchange</a></li>
<li></li>

<li></li>
</ul>
</div>
</div>
