Understanding-CPP.html

<div id="outline-container-org0441b68" class="outline-3">
<h3 id="org0441b68"><span class="section-number-3">1.7</span> Iterator based loops and for-range based loops</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orgb1851b5" class="outline-4">
<h4 id="orgb1851b5"><span class="section-number-4">1.7.1</span> Iterator based loop</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
Loop over a vector: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">&gt;</span> xs <span class="org-rainbow-delimiters-depth-1">{</span><span class="org-string">"Hello"</span>, <span class="org-string">"world"</span>, <span class="org-string">"C++"</span>, <span class="org-string">"HPC"</span>, <span class="org-string">"awesome"</span><span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-constant">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-2">&gt;</span>::<span class="org-type">iterator</span> <span class="org-variable-name">it</span> = xs.begin<span class="org-rainbow-delimiters-depth-2">()</span>; it != xs.end<span class="org-rainbow-delimiters-depth-2">()</span>; ++it<span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"word = '"</span> &lt;&lt; *it &lt;&lt; <span class="org-string">"' size = "</span> &lt;&lt; it-&gt;size<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Output: </span>
<span class="org-comment">   word = 'Hello' size = 5</span>
<span class="org-comment">   word = 'world' size = 5</span>
<span class="org-comment">   word = 'C++' size = 3</span>
<span class="org-comment">   word = 'HPC' size = 3</span>
<span class="org-comment">   word = 'awesome' size = 7</span>
<span class="org-comment">   &gt;&gt; </span>
<span class="org-comment"> */</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">=== OR =====//</span>

<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">auto</span> <span class="org-variable-name">it</span> = xs.begin<span class="org-rainbow-delimiters-depth-2">()</span>; it != xs.end<span class="org-rainbow-delimiters-depth-2">()</span>; ++it<span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"word = '"</span> &lt;&lt; *it &lt;&lt; <span class="org-string">"' size = "</span> &lt;&lt; it-&gt;size<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Output: </span>
<span class="org-comment">        word = 'Hello' size = 5</span>
<span class="org-comment">        word = 'world' size = 5</span>
<span class="org-comment">        word = 'C++' size = 3</span>
<span class="org-comment">        word = 'HPC' size = 3</span>
<span class="org-comment">        word = 'awesome' size = 7</span>
<span class="org-comment"> */</span>
</pre>
</div>

<p>
Loop over a deque: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">auto</span> <span class="org-variable-name">ds</span> = <span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span><span class="org-string">"Physics"</span>, <span class="org-string">"C++"</span>, <span class="org-string">"STL"</span>, <span class="org-string">"Math"</span>, <span class="org-string">"Algebra"</span>, <span class="org-string">"Electronics"</span><span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-constant">deque</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-2">&gt;</span>::<span class="org-type">iterator</span> <span class="org-variable-name">it</span> = ds.begin<span class="org-rainbow-delimiters-depth-2">()</span>; it != ds.end<span class="org-rainbow-delimiters-depth-2">()</span>; ++it<span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"word = '"</span> &lt;&lt; *it &lt;&lt; <span class="org-string">"' size = "</span> &lt;&lt; it-&gt;size<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Or: </span>
<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">auto</span> <span class="org-variable-name">it</span> = ds.begin<span class="org-rainbow-delimiters-depth-2">()</span>; it != ds.end<span class="org-rainbow-delimiters-depth-2">()</span>; ++it<span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"word = '"</span> &lt;&lt; *it &lt;&lt; <span class="org-string">"' size = "</span> &lt;&lt; it-&gt;size<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Output: </span>
<span class="org-comment">   word = 'Physics' size = 7</span>
<span class="org-comment">   word = 'C++' size = 3</span>
<span class="org-comment">   word = 'STL' size = 3</span>
<span class="org-comment">   word = 'Math' size = 4</span>
<span class="org-comment">   word = 'Algebra' size = 7</span>
<span class="org-comment">   word = 'Electronics' size = 11</span>
<span class="org-comment"> */</span>

</pre>
</div>

<p>
Loop over a list: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Struct is a class with everything public </span>
<span class="org-keyword">struct</span> <span class="org-type">Waypoint</span><span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">name</span>;
        <span class="org-type">double</span>      <span class="org-variable-name">lat</span>;
        <span class="org-type">double</span>      <span class="org-variable-name">lon</span>;
        <span class="org-comment-delimiter">// </span><span class="org-comment">This constructor is necessary for storing this object</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">in STL collections/containers </span>
        <span class="org-function-name">Waypoint</span><span class="org-rainbow-delimiters-depth-2">(){}</span>
        <span class="org-function-name">Waypoint</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">name</span>, <span class="org-type">double</span> <span class="org-variable-name">lat</span>, <span class="org-type">double</span> <span class="org-variable-name">lon</span><span class="org-rainbow-delimiters-depth-2">)</span>:
                name<span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">)</span>, lat<span class="org-rainbow-delimiters-depth-2">(</span>lat<span class="org-rainbow-delimiters-depth-2">)</span>, lon<span class="org-rainbow-delimiters-depth-2">(</span>lon<span class="org-rainbow-delimiters-depth-2">){}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

&gt;&gt; <span class="org-keyword">auto</span> wp = Waypoint<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Paris"</span>, 48.23, 22.12<span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; wp.name
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">string</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"Paris"</span>
&gt;&gt; wp.lat
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 48.230000
&gt;&gt; wp.lon
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 22.120000
&gt;&gt; 
&gt;&gt; 

<span class="org-keyword">auto</span> waypoints = <span class="org-constant">std</span>::<span class="org-type">list</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">Waypoint</span><span class="org-rainbow-delimiters-depth-1">&gt;{}</span>;
waypoints.emplace_back<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Paris"</span>, 48.8566, 2.3522<span class="org-rainbow-delimiters-depth-1">)</span>;
waypoints.emplace_back<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Tokyo"</span>, 35.6895, 139.6917<span class="org-rainbow-delimiters-depth-1">)</span>;
waypoints.emplace_back<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Beijing"</span>, 39.9042, 116.4074<span class="org-rainbow-delimiters-depth-1">)</span>;
waypoints.emplace_back<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Cape Town"</span>, -33.9249, 18.4241<span class="org-rainbow-delimiters-depth-1">)</span>;
waypoints.emplace_back<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Buenos Aires"</span>, -34.6037, -58.3816<span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::fixed &lt;&lt; <span class="org-constant">std</span>::setprecision<span class="org-rainbow-delimiters-depth-1">(</span>2<span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">auto</span> <span class="org-variable-name">it</span> = waypoints.begin<span class="org-rainbow-delimiters-depth-2">()</span>; it != waypoints.end<span class="org-rainbow-delimiters-depth-2">()</span>; ++it<span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>15<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::left  &lt;&lt; it-&gt;name
                          &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>15<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::right &lt;&lt; it-&gt;lat
                          &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>15<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; it-&gt;lon
                          &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Output: 
</p>

<div class="org-src-container">
<pre class="src src-text">Paris                    48.86           2.35
Tokyo                    35.69         139.69
Beijing                  39.90         116.41
Cape Town               -33.92          18.42
Buenos Aires            -34.60         -58.38
</pre>
</div>

<p>
Loop over a map:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">auto</span> <span class="org-variable-name">values</span> = <span class="org-constant">std</span>::<span class="org-type">map</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::string, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;{</span>
      <span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"x"</span>,  2.1023<span class="org-rainbow-delimiters-depth-2">}</span>
     ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"y"</span>,  sqrt<span class="org-rainbow-delimiters-depth-3">(</span>2<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">}</span>
     ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"e"</span>,  exp<span class="org-rainbow-delimiters-depth-3">(</span>1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">}</span>
     ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"pi"</span>, 3.1415<span class="org-rainbow-delimiters-depth-2">}</span>
     ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"3/4"</span>, 3.0 / 4.0<span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::fixed &lt;&lt; <span class="org-constant">std</span>::setprecision<span class="org-rainbow-delimiters-depth-1">(</span>2<span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-constant">map</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">std</span>::string, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>::<span class="org-type">iterator</span> <span class="org-variable-name">it</span> = values.begin<span class="org-rainbow-delimiters-depth-2">()</span>; it != values.end<span class="org-rainbow-delimiters-depth-2">()</span>; it++<span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>5<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::left  &lt;&lt; it-&gt;first
                          &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>5<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::right &lt;&lt; it-&gt;second
                          &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">OR:</span>
<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">auto</span> <span class="org-variable-name">it</span> = values.begin<span class="org-rainbow-delimiters-depth-2">()</span>; it != values.end<span class="org-rainbow-delimiters-depth-2">()</span>; it++<span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>5<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::left  &lt;&lt; it-&gt;first
                          &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>5<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::right &lt;&lt; it-&gt;second
                          &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Output: </span>
<span class="org-comment">   3/4   0.75</span>
<span class="org-comment">   e     2.72</span>
<span class="org-comment">   pi    3.14</span>
<span class="org-comment">   x     2.10</span>
<span class="org-comment">   y     1.41</span>
<span class="org-comment"> */</span>
</pre>
</div>
</div>
</div>
