Understanding-CPP.org
*** For-ranged based loops 

C++11 and new standards allow to iterate over any STL container or
class with methods (member functions) .begin() or .end() using a
simpler syntax than the old iterator loop syntax.

 *Loop over a vector:*

#+BEGIN_SRC cpp 
  std::vector<std::string> xs {"Hello", "world", "C++", "HPC", "awesome"};

  // Use: const auto&  to avoid uncessary copies, use auto& if there is modification of x.
  // The const keyword will generate a compiler error if there is 
  // any attempt to modify the value of x. 
  for(const auto& x: xs){
          std::cout << "word = '" << x << "' size = " << x.size() << "\n";
  }

  /** Output: 
     word = 'Hello' size = 5
     word = 'world' size = 5
     word = 'C++' size = 3
     word = 'HPC' size = 3
     word = 'awesome' size = 7
   ,*---------------*/

#+END_SRC

 *Loop over a list:*

#+BEGIN_SRC cpp 
  // Struct is a class with everything public 
  struct Waypoint{
          std::string name;
          double      lat;
          double      lon;
          // This constructor is necessary for storing this object
          // in STL collections/containers 
          Waypoint(){}
          Waypoint(const std::string& name, double lat, double lon):
                  name(name), lat(lat), lon(lon){}
  };

  auto waypoints = std::list<Waypoint>{
         {"Paris", 48.8566, 2.3522}
        ,{"Tokyo", 35.6895, 139.6917}
        ,{"Beijing", 39.9042, 116.4074}
        ,{"Cape Town", -33.9249, 18.4241}
        ,{"Buenos Aires", -34.6037, -58.3816}};


  std::cout << std::fixed << std::setprecision(2);

  for(const auto& wp: waypoints){
          std::cout << std::setw(15) << std::left  << wp.name
                            << std::setw(15) << std::right << wp.lat
                            << std::setw(15) << wp.lon 
                            << "\n";
  }

#+END_SRC

Ouput: 

#+BEGIN_SRC text 
  Paris                    48.86           2.35
  Tokyo                    35.69         139.69
  Beijing                  39.90         116.41
  Cape Town               -33.92          18.42
  Buenos Aires            -34.60         -58.38
#+END_SRC

 *Loop over a map*

#+BEGIN_SRC cpp 
  auto values = std::map<std::string, double>{
        {"x",  2.1023}
       ,{"y",  sqrt(2)}
       ,{"e",  exp(1)}
       ,{"pi", 3.1415}
       ,{"3/4", 3.0 / 4.0}
  };

  std::cout << std::fixed << std::setprecision(3);

  for(const auto& p: values){
          std::cout << std::setw(5) << std::left  << p.first
                                    << std::setw(5) << std::right << p.second
                                    << "\n";
  }

  /** Output: 
     3/4  0.750
     e    2.718
     pi   3.142
     x    2.102
     y    1.414
   ,*==============*/
#+END_SRC

