Understanding-CPP.html

<div id="outline-container-org2750414" class="outline-4">
<h4 id="org2750414"><span class="section-number-4">1.7.2</span> For-ranged based loops</h4>
<div class="outline-text-4" id="text-1-7-2">
<p>
C++11 and new standards allow to iterate over any STL container or
class with methods (member functions) .begin() or .end() using a
simpler syntax than the old iterator loop syntax.
</p>

<p>
<b>Loop over a vector:</b>
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">&gt;</span> xs <span class="org-rainbow-delimiters-depth-1">{</span><span class="org-string">"Hello"</span>, <span class="org-string">"world"</span>, <span class="org-string">"C++"</span>, <span class="org-string">"HPC"</span>, <span class="org-string">"awesome"</span><span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Use: const auto&amp;  to avoid uncessary copies, use auto&amp; if there is modification of x.</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">The const keyword will generate a compiler error if there is </span>
<span class="org-comment-delimiter">// </span><span class="org-comment">any attempt to modify the value of x. </span>
<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: xs<span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"word = '"</span> &lt;&lt; x &lt;&lt; <span class="org-string">"' size = "</span> &lt;&lt; x.size<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Output: </span>
<span class="org-comment">   word = 'Hello' size = 5</span>
<span class="org-comment">   word = 'world' size = 5</span>
<span class="org-comment">   word = 'C++' size = 3</span>
<span class="org-comment">   word = 'HPC' size = 3</span>
<span class="org-comment">   word = 'awesome' size = 7</span>
<span class="org-comment"> *---------------*/</span>

</pre>
</div>

<p>
<b>Loop over a list:</b>
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Struct is a class with everything public </span>
<span class="org-keyword">struct</span> <span class="org-type">Waypoint</span><span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">name</span>;
        <span class="org-type">double</span>      <span class="org-variable-name">lat</span>;
        <span class="org-type">double</span>      <span class="org-variable-name">lon</span>;
        <span class="org-comment-delimiter">// </span><span class="org-comment">This constructor is necessary for storing this object</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">in STL collections/containers </span>
        <span class="org-function-name">Waypoint</span><span class="org-rainbow-delimiters-depth-2">(){}</span>
        <span class="org-function-name">Waypoint</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">name</span>, <span class="org-type">double</span> <span class="org-variable-name">lat</span>, <span class="org-type">double</span> <span class="org-variable-name">lon</span><span class="org-rainbow-delimiters-depth-2">)</span>:
                name<span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">)</span>, lat<span class="org-rainbow-delimiters-depth-2">(</span>lat<span class="org-rainbow-delimiters-depth-2">)</span>, lon<span class="org-rainbow-delimiters-depth-2">(</span>lon<span class="org-rainbow-delimiters-depth-2">){}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-keyword">auto</span> <span class="org-variable-name">waypoints</span> = <span class="org-constant">std</span>::<span class="org-type">list</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">Waypoint</span><span class="org-rainbow-delimiters-depth-1">&gt;{</span>
       <span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"Paris"</span>, 48.8566, 2.3522<span class="org-rainbow-delimiters-depth-2">}</span>
      ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"Tokyo"</span>, 35.6895, 139.6917<span class="org-rainbow-delimiters-depth-2">}</span>
      ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"Beijing"</span>, 39.9042, 116.4074<span class="org-rainbow-delimiters-depth-2">}</span>
      ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"Cape Town"</span>, -33.9249, 18.4241<span class="org-rainbow-delimiters-depth-2">}</span>
      ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"Buenos Aires"</span>, -34.6037, -58.3816<span class="org-rainbow-delimiters-depth-2">}</span><span class="org-rainbow-delimiters-depth-1">}</span>;


<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::fixed &lt;&lt; <span class="org-constant">std</span>::setprecision<span class="org-rainbow-delimiters-depth-1">(</span>2<span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">wp</span>: waypoints<span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>15<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::left  &lt;&lt; wp.name
                          &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>15<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::right &lt;&lt; wp.lat
                          &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>15<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; wp.lon 
                          &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Ouput: 
</p>

<div class="org-src-container">
<pre class="src src-text">Paris                    48.86           2.35
Tokyo                    35.69         139.69
Beijing                  39.90         116.41
Cape Town               -33.92          18.42
Buenos Aires            -34.60         -58.38
</pre>
</div>

<p>
<b>Loop over a map</b>
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">auto</span> <span class="org-variable-name">values</span> = <span class="org-constant">std</span>::<span class="org-type">map</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::string, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;{</span>
      <span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"x"</span>,  2.1023<span class="org-rainbow-delimiters-depth-2">}</span>
     ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"y"</span>,  sqrt<span class="org-rainbow-delimiters-depth-3">(</span>2<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">}</span>
     ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"e"</span>,  exp<span class="org-rainbow-delimiters-depth-3">(</span>1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">}</span>
     ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"pi"</span>, 3.1415<span class="org-rainbow-delimiters-depth-2">}</span>
     ,<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"3/4"</span>, 3.0 / 4.0<span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::fixed &lt;&lt; <span class="org-constant">std</span>::setprecision<span class="org-rainbow-delimiters-depth-1">(</span>3<span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">p</span>: values<span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>5<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::left  &lt;&lt; p.first
                                  &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>5<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::right &lt;&lt; p.second
                                  &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Output: </span>
<span class="org-comment">   3/4  0.750</span>
<span class="org-comment">   e    2.718</span>
<span class="org-comment">   pi   3.142</span>
<span class="org-comment">   x    2.102</span>
<span class="org-comment">   y    1.414</span>
<span class="org-comment"> *==============*/</span>
</pre>
</div>
</div>
</div>
</div>
