Understanding-CPP.html

<div id="outline-container-orgb989fbf" class="outline-3">
<h3 id="orgb989fbf"><span class="section-number-3">1.8</span> C++11 - Scoped Enum</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Scoped enumerations are a more type-safe alternative to the old
C-enums as it has several problems realated to namespace conflicts and
implicit conversions that can introduce bugs hard to catch and reason
about. 
</p>

<p>
Syntax: 
</p>

<ul class="org-ul">
<li>Simple scoped enum class</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">enum</span> <span class="org-keyword">class</span> <span class="org-type">Color</span> <span class="org-rainbow-delimiters-depth-1">{</span>
   <span class="org-variable-name">white</span>,
   <span class="org-variable-name">black</span>,
   <span class="org-variable-name">yellow</span>,
   <span class="org-variable-name">red</span>,
   <span class="org-variable-name">blue</span>,
<span class="org-rainbow-delimiters-depth-1">}</span>;

&gt;&gt; <span class="org-constant">Color</span>::white
<span class="org-rainbow-delimiters-depth-1">(</span>Color<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">Color</span>::white<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 0
&gt;&gt; <span class="org-constant">Color</span>::blue
<span class="org-rainbow-delimiters-depth-1">(</span>Color<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">Color</span>::blue<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 4
&gt;&gt; <span class="org-constant">Color</span>::yellow
<span class="org-rainbow-delimiters-depth-1">(</span>Color<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">Color</span>::yellow<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 2
&gt;&gt; <span class="org-constant">Color</span>::red
<span class="org-rainbow-delimiters-depth-1">(</span>Color<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">Color</span>::red<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 3
&gt;&gt; 

&gt;&gt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;(</span><span class="org-constant">Color</span>::blue<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 4
&gt;&gt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;(</span><span class="org-constant">Color</span>::white<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 0
&gt;&gt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;(</span><span class="org-constant">Color</span>::yellow<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 2
&gt;&gt; 
</pre>
</div>

<ul class="org-ul">
<li>Scoped enum with hexadecimal error codes.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">enum</span> <span class="org-keyword">class</span> <span class="org-type">ErrorCode</span>: <span class="org-constant">std</span>::<span class="org-type">uint32_t</span> <span class="org-rainbow-delimiters-depth-1">{</span>
   <span class="org-variable-name">tankNotFilled</span> = 0xff,
   <span class="org-variable-name">missingSupply</span> = 0x2f,
   <span class="org-variable-name">lowBattery</span>    = 0x2a,
   <span class="org-variable-name">unknown</span>       = 0x24                                         
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<ul class="org-ul">
<li>Scoped enums with chars</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">enum</span> <span class="org-keyword">class</span> <span class="org-type">ErrorCodeLetter</span>: <span class="org-type">char</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-variable-name">tankNotFilled</span> = <span class="org-string">'x'</span>,
        <span class="org-variable-name">missingSupply</span> = <span class="org-string">'y'</span>,
        <span class="org-variable-name">lowBattery</span>    = <span class="org-string">'a'</span>,
        <span class="org-variable-name">unknown</span>       = <span class="org-string">'k'</span>                                         
<span class="org-rainbow-delimiters-depth-1">}</span>;

&gt;&gt; <span class="org-constant">ErrorCodeLetter</span>::tankNotFilled
<span class="org-rainbow-delimiters-depth-1">(</span>ErrorCodeLetter<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">ErrorCodeLetter</span>::tankNotFilled<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-1">)</span> 120
&gt;&gt; <span class="org-constant">ErrorCodeLetter</span>::missingSupply
<span class="org-rainbow-delimiters-depth-1">(</span>ErrorCodeLetter<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">ErrorCodeLetter</span>::missingSupply<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-1">)</span> 121
&gt;&gt; <span class="org-constant">ErrorCodeLetter</span>::unknown
<span class="org-rainbow-delimiters-depth-1">(</span>ErrorCodeLetter<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">ErrorCodeLetter</span>::unknown<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-1">)</span> 107
&gt;&gt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-1">&gt;(</span><span class="org-constant">ErrorCodeLetter</span>::unknown<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">'k'</span>
&gt;&gt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-1">&gt;(</span><span class="org-constant">ErrorCodeLetter</span>::missingSupply<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">'y'</span>
&gt;&gt; 
</pre>
</div>


<p>
<b>More Exhaustive Example:</b>
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">enum</span> <span class="org-keyword">class</span> <span class="org-type">MachineStatus</span>: <span class="org-constant">std</span>::<span class="org-type">uint32_t</span> <span class="org-rainbow-delimiters-depth-1">{</span>
   <span class="org-variable-name">running</span> = 0xf5,
   <span class="org-variable-name">iddle</span>   = 0x2a,
   <span class="org-variable-name">waiting</span> = 0x35,
   <span class="org-variable-name">failure</span> = 0x24                                         
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<p>
Example: CERN's root shell. 
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; <span class="org-constant">MachineStatus</span>::running
<span class="org-rainbow-delimiters-depth-1">(</span>MachineStatus<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">MachineStatus</span>::running<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 245
&gt;&gt; <span class="org-constant">MachineStatus</span>::iddle
<span class="org-rainbow-delimiters-depth-1">(</span>MachineStatus<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">MachineStatus</span>::iddle<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 42
&gt;&gt; <span class="org-constant">MachineStatus</span>::waiting
<span class="org-rainbow-delimiters-depth-1">(</span>MachineStatus<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">MachineStatus</span>::waiting<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 53
&gt;&gt; <span class="org-constant">MachineStatus</span>::failure
<span class="org-rainbow-delimiters-depth-1">(</span>MachineStatus<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">MachineStatus</span>::failure<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 36
&gt;&gt; 

&gt;&gt; <span class="org-keyword">auto</span> status = <span class="org-constant">MachineStatus</span>::running
<span class="org-rainbow-delimiters-depth-1">(</span>MachineStatus<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">MachineStatus</span>::running<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 245

&gt;&gt; <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Machine status = "</span> &lt;&lt; <span class="org-constant">std</span>::hex &lt;&lt; <span class="org-string">"0x"</span> &lt;&lt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::uint32_t<span class="org-rainbow-delimiters-depth-1">&gt;(</span>status<span class="org-rainbow-delimiters-depth-1">)</span> &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-type">Machine</span> <span class="org-variable-name">status</span> = 0xf5
&gt;&gt; 
&gt;&gt; 

&gt;&gt; status = <span class="org-constant">MachineStatus</span>::iddle 
<span class="org-rainbow-delimiters-depth-1">(</span>MachineStatus<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">MachineStatus</span>::iddle<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 42
&gt;&gt; <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Machine status = "</span> &lt;&lt; <span class="org-constant">std</span>::hex &lt;&lt; <span class="org-string">"0x"</span> &lt;&lt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::uint32_t<span class="org-rainbow-delimiters-depth-1">&gt;(</span>status<span class="org-rainbow-delimiters-depth-1">)</span> &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-type">Machine</span> <span class="org-variable-name">status</span> = 0x2a
&gt;&gt; 

&gt;&gt; <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-1">(</span>status == <span class="org-constant">MachineStatus</span>::iddle<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Machine is iddle"</span> &lt;&lt; <span class="org-constant">std</span>::endl; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-type">Machine</span> <span class="org-type">is</span> <span class="org-variable-name">iddle</span>
&gt;&gt; 

&gt;&gt; status = <span class="org-constant">MachineStatus</span>::running
<span class="org-rainbow-delimiters-depth-1">(</span>MachineStatus<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">MachineStatus</span>::running<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 245
&gt;&gt; <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-1">(</span>status == <span class="org-constant">MachineStatus</span>::running<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Machine is running"</span> &lt;&lt; <span class="org-constant">std</span>::endl; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-type">Machine</span> <span class="org-type">is</span> <span class="org-variable-name">running</span>
&gt;&gt; 

&gt;&gt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::uint32_t<span class="org-rainbow-delimiters-depth-1">&gt;(</span><span class="org-constant">MachineStatus</span>::running<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 245
&gt;&gt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::uint32_t<span class="org-rainbow-delimiters-depth-1">&gt;(</span><span class="org-constant">MachineStatus</span>::iddle<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 42
&gt;&gt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::uint32_t<span class="org-rainbow-delimiters-depth-1">&gt;(</span><span class="org-constant">MachineStatus</span>::iddle<span class="org-rainbow-delimiters-depth-1">)</span> == 0x2a
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">bool</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-constant">true</span>
&gt;&gt; 
&gt;&gt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span>MachineStatus<span class="org-rainbow-delimiters-depth-1">&gt;(</span>0x2a<span class="org-rainbow-delimiters-depth-1">)</span> 
<span class="org-rainbow-delimiters-depth-1">(</span>MachineStatus<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">MachineStatus</span>::iddle<span class="org-rainbow-delimiters-depth-1">)</span> : <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 42
&gt;&gt; 
&gt;&gt; <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span>MachineStatus<span class="org-rainbow-delimiters-depth-1">&gt;(</span>0x2a<span class="org-rainbow-delimiters-depth-1">)</span> == <span class="org-constant">MachineStatus</span>::iddle
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">bool</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-constant">true</span>
&gt;&gt; 
</pre>
</div>
</div>
</div>
