Understanding-CPP.html

<div id="outline-container-org26845ae" class="outline-3">
<h3 id="org26845ae"><span class="section-number-3">1.9</span> Functor Function-Object and higher order functions</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Functor is any object which behaves like a function and callable like
a function. Unlike C++ ordinary functions, functors can have internal
state and change its internal data as well.
</p>

<p>
Functors are implementing in C++ by overloading the function
application operator. 
</p>

<p>
The code in the file: <a href="src/cpp-functor.cpp">file:src/cpp-functor.cpp</a> shows an
exhaustive example about how to implement, use functors and implement
client code using dynamic polymorphism (aka subtyping or inheritance),
static polymorphism (aka template metaprogramming) and C++11's
function type <span class="underline">std::function</span>.
</p>

<p>
Example: 
</p>
<ul class="org-ul">
<li>File:            <a href="src/cpp-functor.cpp">file:src/cpp-functor.cpp</a></li>
<li>Online Compiler: <a href="http://rextester.com/VGE78113">http://rextester.com/VGE78113</a></li>

<li>Math functor interface class representing a general math function.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">class</span> <span class="org-type">IMathFunctor</span> <span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">public</span>:
        <span class="org-comment-delimiter">// </span><span class="org-comment">Pure virtual function</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; const -&gt; Means that the function cannot change the object internal state.</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; (= 0) -&gt; Means abstract member function or abstract method.</span>
        <span class="org-keyword">virtual</span> <span class="org-type">double</span> <span class="org-keyword">operator</span><span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-keyword">const</span> = 0;
        <span class="org-keyword">virtual</span> ~<span class="org-function-name">IMathFunctor</span><span class="org-rainbow-delimiters-depth-2">()</span> = <span class="org-keyword">default</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<ul class="org-ul">
<li>Linear Function "C++ functor." - function-object</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">/** </span><span class="org-comment">Linear Function "C++ functor." - function-object </span>
<span class="org-comment"> *   LinFun(x) = A * x + B</span>
<span class="org-comment"> */</span>
<span class="org-keyword">class</span> <span class="org-type">LinFun</span>: <span class="org-keyword">public</span> <span class="org-type">IMathFunctor</span> <span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:
        <span class="org-comment-delimiter">// </span><span class="org-comment">Linear coefficient or line slope </span>
        <span class="org-type">double</span> <span class="org-variable-name">_a</span>; 
        <span class="org-type">double</span> <span class="org-variable-name">_b</span>;
<span class="org-function-name">public</span>:
        <span class="org-function-name">LinFun</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">double</span> <span class="org-variable-name">b</span><span class="org-rainbow-delimiters-depth-2">)</span>: _a<span class="org-rainbow-delimiters-depth-2">(</span>a<span class="org-rainbow-delimiters-depth-2">)</span>, _b<span class="org-rainbow-delimiters-depth-2">(</span>b<span class="org-rainbow-delimiters-depth-2">){}</span>
        <span class="org-keyword">auto</span> <span class="org-function-name">getA</span><span class="org-rainbow-delimiters-depth-2">()</span>             -&gt; <span class="org-type">double</span>   <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-keyword">return</span> _a;<span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-keyword">auto</span> <span class="org-function-name">setA</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span><span class="org-rainbow-delimiters-depth-2">)</span>         -&gt; <span class="org-type">void</span>     <span class="org-rainbow-delimiters-depth-2">{</span> _a = a; <span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-keyword">auto</span> <span class="org-function-name">getB</span><span class="org-rainbow-delimiters-depth-2">()</span>             -&gt; <span class="org-type">double</span>   <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-keyword">return</span> _b;<span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-keyword">auto</span> <span class="org-function-name">setB</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">b</span><span class="org-rainbow-delimiters-depth-2">)</span>         -&gt; <span class="org-type">void</span>     <span class="org-rainbow-delimiters-depth-2">{</span> _b = b; <span class="org-rainbow-delimiters-depth-2">}</span>

        <span class="org-comment-delimiter">// </span><span class="org-comment">Function-call operator =&gt; Makes this object callable</span>
        <span class="org-comment-delimiter">//</span><span class="org-comment">------------------------------</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">double operator()(double x)  -&gt; double   { return _a * x + _b;}  </span>
        <span class="org-type">double</span> <span class="org-keyword">operator</span><span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-keyword">return</span> _a * x + _b;<span class="org-rainbow-delimiters-depth-2">}</span>    
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<p>
Usage: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Function linear object - modelling a linear function 3 * x + 4.0 </span>
<span class="org-type">LinFun</span> <span class="org-variable-name">fun1</span><span class="org-rainbow-delimiters-depth-1">(</span>3.0, 4.0<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"a = "</span> &lt;&lt; fun1.getA<span class="org-rainbow-delimiters-depth-1">()</span> &lt;&lt; <span class="org-string">" ; b = "</span> &lt;&lt; fun1.getB<span class="org-rainbow-delimiters-depth-1">()</span> &lt;&lt; nl;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"fun1(3.0) = "</span> &lt;&lt; fun1<span class="org-rainbow-delimiters-depth-1">(</span>3.0<span class="org-rainbow-delimiters-depth-1">)</span> &lt;&lt; nl;  
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"fun1(4.0) = "</span> &lt;&lt; fun1<span class="org-rainbow-delimiters-depth-1">(</span>4.0<span class="org-rainbow-delimiters-depth-1">)</span> &lt;&lt; nl;
</pre>
</div>

<p>
Output: 
</p>

<div class="org-src-container">
<pre class="src src-text">a = 3 ; b = 4
fun1(3.0) = 13
fun1(4.0) = 16
fun1(5.0) = 19
</pre>
</div>


<p>
Higher order functions (functions that calls or return functions) can
be implemented using dynamic polymorphis or inheritance; static
polymorphism, also known as template metaprogramming and using the
type std::function from C++11.
</p>


<ul class="org-ul">
<li><b>Higher order function using dynamic polymorphism</b>
(inheritance). This function only accepts implementations of
IMathFunctor and cannot worth with an arbitrary function-object,
ordinary functions or C++11 lambda function. Another drawback is
the runtime overhead of virtual function-calls.</li>
</ul>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">void</span> <span class="org-function-name">tabulateDynamic</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">IMathFunctor</span>&amp; <span class="org-variable-name">fun</span>, <span class="org-type">double</span> <span class="org-variable-name">start</span>, <span class="org-type">double</span> <span class="org-variable-name">stop</span>, <span class="org-type">double</span> <span class="org-variable-name">step</span><span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::fixed &lt;&lt; <span class="org-constant">std</span>::setprecision<span class="org-rainbow-delimiters-depth-2">(</span>3<span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span> = start; x &lt;= stop ; x += step<span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>10<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; x &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>10<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; fun<span class="org-rainbow-delimiters-depth-2">(</span>x<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Usage:
</p>

<div class="org-src-container">
<pre class="src src-cpp">tabulatDynamic<span class="org-rainbow-delimiters-depth-1">(</span>fun1, 0.0, 5.0, 1.0<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
Sample Output: 
</p>

<div class="org-src-container">
<pre class="src src-text">-----&gt; Tabulating fun1
    0.000     4.000
    1.000     7.000
    2.000    10.000
    3.000    13.000
    4.000    16.000
    5.000    19.000
</pre>
</div>

<ul class="org-ul">
<li><b>Higher order function using static polymorphism</b> - The advantage
of this function is that it can work with any callable object like
functors (function-objects), ordinary functions and C++11 lambda
functions. Another benefit is the lower runtime overhead than the
implementation using dynamic polymorphism. For this case, the
runtime cost of dynamic polymorphism is not significant, however it
can become noticeable on large scale computation or high
performance computations.</li>

<li>Example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">Function</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-type">void</span> <span class="org-function-name">tabulateStatic</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">Function</span>&amp; <span class="org-variable-name">fun</span>, <span class="org-type">double</span> <span class="org-variable-name">start</span>, <span class="org-type">double</span> <span class="org-variable-name">stop</span>, <span class="org-type">double</span> <span class="org-variable-name">step</span><span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::fixed &lt;&lt; <span class="org-constant">std</span>::setprecision<span class="org-rainbow-delimiters-depth-2">(</span>3<span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span> = start; x &lt;= stop ; x += step<span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>10<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; x &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>10<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; fun<span class="org-rainbow-delimiters-depth-2">(</span>x<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Usage:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">" -----&gt; Tabulating fun1"</span> &lt;&lt; nl;
tabulateStatic<span class="org-rainbow-delimiters-depth-1">(</span>fun1, 0.0, 5.0, 1.0<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">" -----&gt; Tabulating fun2"</span> &lt;&lt; nl;
tabulateStatic<span class="org-rainbow-delimiters-depth-1">(</span>fun2, 0.0, 5.0, 1.0<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>


<ul class="org-ul">
<li><b>Higher order function using the C++11 type std::function</b> - The type
std::function provides type erasure and can work with any functor,
ordinary function and C++11 lambda functions, in addition it also
allows all those types of functions to be stored in STL containers.</li>
</ul>

<p>
Example: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">void</span> <span class="org-function-name">tabulateLambdaList</span><span class="org-rainbow-delimiters-depth-1">(</span>
         <span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span> <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">&gt;</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">funlist</span>
        ,<span class="org-type">double</span> <span class="org-variable-name">start</span>
        ,<span class="org-type">double</span> <span class="org-variable-name">stop</span>
        ,<span class="org-type">double</span> <span class="org-variable-name">step</span>
        <span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::fixed &lt;&lt; <span class="org-constant">std</span>::setprecision<span class="org-rainbow-delimiters-depth-2">(</span>3<span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span> = start; x &lt;= stop ; x += step<span class="org-rainbow-delimiters-depth-2">){</span>
                <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-3">(</span>10<span class="org-rainbow-delimiters-depth-3">)</span> &lt;&lt; x;
                <span class="org-comment-delimiter">// </span><span class="org-comment">const auto&amp; is used for avoid uncessary copies </span>
                <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">fun</span>: funlist<span class="org-rainbow-delimiters-depth-3">)</span>
                        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-3">(</span>10<span class="org-rainbow-delimiters-depth-3">)</span> &lt;&lt; fun<span class="org-rainbow-delimiters-depth-3">(</span>x<span class="org-rainbow-delimiters-depth-3">)</span>;
                <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\n"</span>;
        <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Usage:
</p>

<div class="org-src-container">
<pre class="src src-cpp">tabulateLambdaList<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">{</span>fun1, fun2, exp, ordinaryFunction<span class="org-rainbow-delimiters-depth-2">}</span>, 0.0, 5.0, 1.0<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Output:
</p>

<div class="org-src-container">
<pre class="src src-text">  x         fun1     fun2      exp      ordinaryFunction
0.000     4.000     4.000     1.000     0.000
1.000     7.000     9.000     2.718     3.000
2.000    10.000    18.000     7.389     6.000
3.000    13.000    31.000    20.086     9.000
4.000    16.000    48.000    54.598    12.000
5.000    19.000    69.000   148.413    15.000
</pre>
</div>

<p>
Compilation of <a href="src/cpp-functor.cpp">file:src/cpp-functor.cpp</a> 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ clang++ cpp-functor.cpp -o <span class="org-keyword">cpp-functor.bin</span> -g -std=c++11 -Wall -Wextra &amp;&amp;
</pre>
</div>

<p>
Complete program output of <a href="src/cpp-functor.cpp">file:src/cpp-functor.cpp</a> 
</p>

<div class="org-src-container">
<pre class="src src-sh">./cpp-functor.bin

a = 3 ; b = 4
<span class="org-function-name">fun1</span>(3.0) = 13
<span class="org-function-name">fun1</span>(4.0) = 16
<span class="org-function-name">fun1</span>(5.0) = 19
=======================
a = 2 ; b = 3 ; c = 4
<span class="org-function-name">fun2</span>(3.0) = 31
<span class="org-function-name">fun2</span>(4.0) = 48
<span class="org-function-name">fun2</span>(5.0) = 69
======= [1] Client Code using dynamic polymorphism  ================
 -----&gt; Tabulating fun1
     0.000     4.000
     1.000     7.000
     2.000    10.000
     3.000    13.000
     4.000    16.000
     5.000    19.000
 -----&gt; Tabulating fun2
     0.000     4.000
     1.000     9.000
     2.000    18.000
     3.000    31.000
     4.000    48.000
     5.000    69.000
======= [2] Client Code using dynamic polymorphism  ================
     0.000     4.000     4.000
     1.000     7.000     9.000
     2.000    10.000    18.000
     3.000    13.000    31.000
     4.000    16.000    48.000
     5.000    19.000    69.000
======= Client Code using static polymorphism (template)  ================
 -----&gt; Tabulating fun1
     0.000     4.000
     1.000     7.000
     2.000    10.000
     3.000    13.000
     4.000    16.000
     5.000    19.000
 -----&gt; Tabulating fun2
     0.000     4.000
     1.000     9.000
     2.000    18.000
     3.000    31.000
     4.000    48.000
     5.000    69.000
 -----&gt; Tabulating lambda <span class="org-keyword">function</span> <span class="org-function-name">f</span>(x) = x * x
     0.000     0.000
     1.000     1.000
     2.000     4.000
     3.000     9.000
     4.000    16.000
     5.000    25.000
 -----&gt; Tabulating ordinary <span class="org-keyword">function</span> <span class="org-function-name">f</span>(x) = 3 * x
     0.000     0.000
     1.000     3.000
     2.000     6.000
     3.000     9.000
     4.000    12.000
     5.000    15.000
 -----&gt; Tabulating ordinary <span class="org-keyword">function</span> <span class="org-function-name">f</span>(x) = exp(x)
     0.000     1.000
     1.000     2.718
     2.000     7.389
     3.000    20.086
     4.000    54.598
     5.000   148.413
======= Client Code using C++11 lambda std::<span class="org-keyword">function</span>  ================
     0.000     4.000     4.000     1.000     0.000
     1.000     7.000     9.000     2.718     3.000
     2.000    10.000    18.000     7.389     6.000
     3.000    13.000    31.000    20.086     9.000
     4.000    16.000    48.000    54.598    12.000
     5.000    19.000    69.000   148.413    15.000
</pre>
</div>
</div>
</div>
