Understanding-CPP.org
** Lambda Functions
   :PROPERTIES:
   :ID:       02be1a97-c100-44ce-ad76-63835818d406
   :END:
*** Overview 

Lambda expressions, also known as lambda functions or lambda
abstractions, are ubiquitous in functional programming languages such
as Haskell, OCaml, Scala and Scheme. They were by introduced in a
theoretical way by Alonzo Church in the lambda calculus. Lisp was
first programming language to use lambda functions and now this
function programming feature has made its way into mainstream and has
arrived to C# (Cshap), Java 8 and C++11.

In C++, Lambda functions are not ordinary functions, actually, they
are special function-objects or "C++ functors". Lambda abstractions
can be passed as arguments to any function; returned from functions;
can have state and also they can be defined locally at the call-site
simplifying all the boilerplate code necessary to pass a function to
callbacks, event handlers and higher order functions.

Summary:

  * Lambda functions were introduced in C++11. Before C++11 lambdas
    were available as Boost.Lambda. 

  * Lambda functions can be:
    + returned from functions.
    + be passed as function parameters.
    + Can be stored in data structures.
    + Hold state and capture variables (closure).
    + Non-capturing lambdas can be converted to function pointers what
      is useful with old C-APIs.

  * Lambda turns C++11 is a *game changer* and turns C++ into an
    quasi-functional programming language.

  * Practical Use Cases:
    + Callbacks
    + Higher order functions
    + Simplify design patterns
    + Asynchronous code
    + Create functions at runtime. 

*Main parts* 
 
 - Capture list between square brackets ~[ ]~
 - Argument list between parenthesis ~()~
 - Function body between curly braces ~{}~

Syntax: 

#+BEGIN_SRC text 
  [capture](parameters) -> return-type {body}
#+END_SRC

Some lambda functions: 

#+BEGIN_SRC cpp 
 auto fn = [](int n){ return n * 10; }

 // Test in CERN's ROOT REPL
 >> auto fn = [](int n){ return n * 10; }
 ((lambda) &) @0x7f5e578f2010
 >> 

 >> auto fn = [](int n){ return n * 10; }
 ((lambda) &) @0x7f5e578f2010
 >> 
#+END_SRC


*Parts of a C++'s lambda expression:*  - ([[https://msdn.microsoft.com/en-us/library/dd293608.aspx][Microsoft Inc. Lambda C++]])

 1. Capture clause - Specifies captured variables (closure).
    - ~[ ]~ - Empty capture clause means that no variable from escope
      is captured.
    - ~[x, y]~- The variables x and y are captured by value and the
      the lambda body will get a copy of x and y. They cannot be
      modified in the body of the lambda expression. 
    - ~[&x , y]~ - The variable x is captured by reference and y by
      value, therefore x can be modified in the body of the lambda
      expression and y cannot.
    - ~[&]~ - Capture all variables used in the lambda's body by
      reference.
    - ~[=]~- Captures all variables used in the body by value
      (copy). The variables cannot be modifed as they are passed by
      value.
    - ~[=, &blob]~- The variable blob is captured by reference and all
      other variables are captured by value (copy).
    - ~[this]~ - Captures the "this" pointer of the enclosing class.

 2. Parameter list (Optional)- Parameters, aka arguments, of the lambda expression.
 3. Mutable specification (optional)
 4. exception-specification (optional)
 5. trailing return type (optional)
 6. lambda-body - The body can access variables such as:
    - Lambda parameters passed between parenthesis:  ~(int x)~
    - Captured variables from the enclosing scope.
    - Global variables.
    - Class data members if the lambda expression is defined inside a
      class. 

#+BEGIN_SRC text 
  --
              (1)  (2)    (3)       (4)         (5)
                 |    |         |            |           |
                ...  ....  .....+....  ...+....     ......
                [ ]  ( )  mutable  throw()  -> int
                {                                                   
                  // (6)                                              
                  // Lambda body 
                  int n = x + y;
                  x = y;
                  y  = n;
                  return n;
                }
#+END_SRC

