Understanding-CPP.html

<div id="outline-container-org3087219" class="outline-3">
<h3 id="org3087219"><a id="ID-02be1a97-c100-44ce-ad76-63835818d406"></a><span class="section-number-3">1.10</span> Lambda Functions</h3>
<div class="outline-text-3" id="text-1-10">
</div>
<div id="outline-container-org1e0a6a8" class="outline-4">
<h4 id="org1e0a6a8"><span class="section-number-4">1.10.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-10-1">
<p>
Lambda expressions, also known as lambda functions or lambda
abstractions, are ubiquitous in functional programming languages such
as Haskell, OCaml, Scala and Scheme. They were by introduced in a
theoretical way by Alonzo Church in the lambda calculus. Lisp was
first programming language to use lambda functions and now this
function programming feature has made its way into mainstream and has
arrived to C# (Cshap), Java 8 and C++11.
</p>

<p>
In C++, Lambda functions are not ordinary functions, actually, they
are special function-objects or "C++ functors". Lambda abstractions
can be passed as arguments to any function; returned from functions;
can have state and also they can be defined locally at the call-site
simplifying all the boilerplate code necessary to pass a function to
callbacks, event handlers and higher order functions.
</p>

<p>
Summary:
</p>

<ul class="org-ul">
<li>Lambda functions were introduced in C++11. Before C++11 lambdas
were available as Boost.Lambda.</li>

<li>Lambda functions can be:
<ul class="org-ul">
<li>returned from functions.</li>
<li>be passed as function parameters.</li>
<li>Can be stored in data structures.</li>
<li>Hold state and capture variables (closure).</li>
<li>Non-capturing lambdas can be converted to function pointers what
is useful with old C-APIs.</li>
</ul></li>

<li>Lambda turns C++11 is a <b>game changer</b> and turns C++ into an
quasi-functional programming language.</li>

<li>Practical Use Cases:
<ul class="org-ul">
<li>Callbacks</li>
<li>Higher order functions</li>
<li>Simplify design patterns</li>
<li>Asynchronous code</li>
<li>Create functions at runtime.</li>
</ul></li>
</ul>

<p>
<b>Main parts</b> 
</p>

<ul class="org-ul">
<li>Capture list between square brackets <code>[ ]</code></li>
<li>Argument list between parenthesis <code>()</code></li>
<li>Function body between curly braces <code>{}</code></li>
</ul>

<p>
Syntax: 
</p>

<div class="org-src-container">
<pre class="src src-text">[capture](parameters) -&gt; return-type {body}
</pre>
</div>

<p>
Some lambda functions: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">auto</span> <span class="org-variable-name">fn</span> = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-keyword">return</span> n * 10; <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Test in CERN's ROOT REPL</span>
&gt;&gt; <span class="org-keyword">auto</span> fn = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-keyword">return</span> n * 10; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">(</span>lambda<span class="org-rainbow-delimiters-depth-2">)</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7f5e578f2010
&gt;&gt; 

&gt;&gt; <span class="org-keyword">auto</span> fn = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-keyword">return</span> n * 10; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">(</span>lambda<span class="org-rainbow-delimiters-depth-2">)</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7f5e578f2010
&gt;&gt; 
</pre>
</div>


<p>
<b>Parts of a C++'s lambda expression:</b>  - (<a href="https://msdn.microsoft.com/en-us/library/dd293608.aspx">Microsoft Inc. Lambda C++</a>)
</p>

<ol class="org-ol">
<li>Capture clause - Specifies captured variables (closure).
<ul class="org-ul">
<li><code>[ ]</code> - Empty capture clause means that no variable from escope
is captured.</li>
<li><code>[x, y]</code>- The variables x and y are captured by value and the
the lambda body will get a copy of x and y. They cannot be
modified in the body of the lambda expression.</li>
<li><code>[&amp;x , y]</code> - The variable x is captured by reference and y by
value, therefore x can be modified in the body of the lambda
expression and y cannot.</li>
<li><code>[&amp;]</code> - Capture all variables used in the lambda's body by
reference.</li>
<li><code>[=]</code>- Captures all variables used in the body by value
(copy). The variables cannot be modifed as they are passed by
value.</li>
<li><code>[=, &amp;blob]</code>- The variable blob is captured by reference and all
other variables are captured by value (copy).</li>
<li><code>[this]</code> - Captures the "this" pointer of the enclosing class.</li>
</ul></li>

<li>Parameter list (Optional)- Parameters, aka arguments, of the lambda expression.</li>
<li>Mutable specification (optional)</li>
<li>exception-specification (optional)</li>
<li>trailing return type (optional)</li>
<li>lambda-body - The body can access variables such as:
<ul class="org-ul">
<li>Lambda parameters passed between parenthesis:  <code>(int x)</code></li>
<li>Captured variables from the enclosing scope.</li>
<li>Global variables.</li>
<li>Class data members if the lambda expression is defined inside a
class.</li>
</ul></li>
</ol>

<div class="org-src-container">
<pre class="src src-text">--
            (1)  (2)    (3)       (4)         (5)
               |    |         |            |           |
              ...  ....  .....+....  ...+....     ......
              [ ]  ( )  mutable  throw()  -&gt; int
              {                                                   
                // (6)                                              
                // Lambda body 
                int n = x + y;
                x = y;
                y  = n;
                return n;
              }
</pre>
</div>
</div>
</div>
