Understanding-CPP.org
*** Basic Example 

*Proof-of-concept code* 

 + File: [[file:src/lambdaFun.cpp][file:src/lambdaFun.cpp]]
 + Online Compiler: http://rextester.com/SCQP30593

Code Highlights:

 - Lambda function - lambda1 

#+BEGIN_SRC cpp 
  // Example (1)
  auto lambda1 = [](const std::string& str){
     std::cout << "Lambda1: : I got the value = " << str << "\n";
  };

  // Alternative 1:
  //------------------------------
  std::function<void (const std::string&)> lambda1A = [](const std::string& str) {
    std::cout << "Lambda1: : I got the value = " << str << endl;
  };

  // Alternative 2:
  //------------------------------
  std::function<auto (const std::string&) -> void> lambda1B = [](const std::string& str) {
    std::cout << "Lambda1: : I got the value = " << str << endl;
  };

  // Alternative 3:
  //------------------------------
  // Type synonym 
  using FnAction = std::function<void (const std::string&)>;
  // Alternative type synonym: 
  using FnAction = std::function<auto (const std::string&) -> void>;

  FnAction lambda1C = [](const std::string& str) {
    std::cout << "Lambda1: : I got the value = " << str << endl;
  };

  >> lambda1("hello world")
  Lambda1: : I got the value = hello world

  >> lambda1("hola mundo")
  Lambda1: : I got the value = hola mundo

  >> lambda1A("testing C++")
  Lambda1: : I got the value = testing C++

  >> lambda1B("Running lambda1B")
  Lambda1: : I got the value = Running lambda1B

  >> lambda1C("I am lambda1C function")
  Lambda1: : I got the value = I am lambda1C function
  >> 	
#+END_SRC


 - Higher order function which returns a lambda function which takes
   two ints as parameters returning an int. This function captures the
   parameter m by value, it means that the parameter is copied in the
   function body. 

#+BEGIN_SRC cpp 
  // As it is in the code.
  //-----------------------------------------	
  std::function<int (int, int)> makeFunction1(int m){
      return [m](int x, int y){ return m * (x + y); };
  }

  >> auto fn = makeFunction1(4)
  (std::function<int (int, int)> &) @0x7fb73017f010
  >> fn(3, 5)
  (int) 32
  >> fn(4, 3)
  (int) 28
  >> 

  // Alternative 1:
  //-----------------------------------------
  auto makeFunction1A(int m) -> std::function<int (int, int)>{
      return [m](int x, int y){ return m * (x + y); };
  }

  >> fna(3, 5)
  (int) 32
  >> fna(4, 3)
  (int) 28
  >> auto fna6 = makeFunction1A(6)
  (std::function<int (int, int)> &) @0x7f696d823030
  >> fna6(3, 5)
  (int) 48
  >> fna6(4, 3)
  (int) 42
  >> 

  // Alternative 2:
  //-----------------------------------------
  auto makeFunction1B(int m) -> std::function<auto (int, int) -> int>{
      return [m](int x, int y){ return m * (x + y); };
  }

  // Alternative 3:
  //-----------------------------------------
  // C++11 Type synonym
  using BinaryIntFunctionA = std::function<int (int, int)>;
  using BinaryIntFunctionB = std::function<auto (int, int) -> int>;
  // Prior to C++11 type synonym
  typedef std::function<auto (int, int) -> int> BinaryIntFunction;

  auto makeFunction1C(int m) -> BinaryIntFunctionB {
      return [m](int x, int y){ return m * (x + y); };
  }

  >> auto fnc = makeFunction1C(8)
  (std::function<int (int, int)> &) @0x7f696d823050
  >> fnc(3, 5)
  (int) 64
  >> fnc(6, 7)
  (int) 104
  >> 8 * (6 + 7)
  (int) 104
  >> 
#+END_SRC


Complete program output ([[file:src/lambdaFun.cpp][file:src/lambdaFun.cpp]]) : 

#+BEGIN_SRC sh
  g++ lamdaFun.cpp -o bin/lamdaFun.bin && bin/lamdaFun.bin

  -----------------------------------------------------------------------------------------
  >> Example(1) - Testing function lambda1
  Lambda1: : I got the value = Hello
  Lambda1: : I got the value = World

  -----------------------------------------------------------------------------------------
  >> Example(2) Testing function lambda2
  Lambda 2 :: I got the value  = Japan
  Lambda 2 :: I got the value  = Korea

  -----------------------------------------------------------------------------------------
  >> Example(3) Testing function lambda3
     - Lambda function can be defined and executed at the call-site
  Lambda 3 :: I got the value = C++11 is awesome!

  -----------------------------------------------------------------------------------------
  >> Example(4) Testing function sumLambda
     - Lambda functions  can return values as any function.
  sumLambda(10.0, 25.34) = 35.34
  sumLambda(-10.23, 4.56) = -5.67

  -----------------------------------------------------------------------------------------
  >> Example(5) Testing function lamdaCapture
     - Lambda functions  can capture its environment (closures) and have state as "function objects"
    x  = 5  c = 3
  lamdaCapture(2, 5)  = 32
    x  = 5  c = 4
    lamdaCapture(1, 2) =  16
    x  = 5  c = 5

  -----------------------------------------------------------------------------------------
  >> Example(6) Testing function sumLambda
     - Lambda functions  can play well with STL algorithms
  Print all vector elements - Version 1
    v[0] = 1
    v[1] = 2
    v[2] = 3
    v[3] = 4
    v[4] = 5
    v[5] = 6
    v[6] = 7
    v[7] = 8
  Print all vector element Version 2  - local state with 'static' keyword
    v[0] = 1
    v[1] = 2
    v[2] = 3
    v[3] = 4
    v[4] = 5
    v[5] = 6
    v[6] = 7
    v[7] = 8

  -----------------------------------------------------------------------------------------
  >> Example(7) 
     Playing with STL transform algorithm.
    Vector transformed =  
  v  [0] = 4
  v  [1] = 7
  v  [2] = 10
  v  [3] = 13
  v  [4] = 16
  v  [5] = 19
  v  [6] = 22
  v  [7] = 25

  -----------------------------------------------------------------------------------------
  >> Example(8) 
     Lambda functions can be returned from functions and be generated at run-time.
    mulSumBy2(2, 4) = 12
    mulSumBy2(3, 1) = 8
    mulSumBy5(2, 4) = 30
    mulSumBy5(9, 2) = 55

  -----------------------------------------------------------------------------------------
  >> Example(9) 
     Lambda functions can be returned from functions and have state.
    Running dummy function
      (*) m = 2, n = 0, x = 1, y = 3, z = 8
    Running dummy function
      (*) m = 2, n = 1, x = 2, y = 5, z = 15
    Running dummy function
      (*) m = 3, n = 0, x = 1, y = 3, z = 12
    Running dummy function
      (*) m = 3, n = 1, x = 2, y = 5, z = 22

  -----------------------------------------------------------------------------------------
  >> Example(10) 
     Lambda functions can return lambda functions!!
    addTo5(4) = 9
    addTo5(3) = 8
    addTo10(4) = 14
    addTo10(3) = 13

  -----------------------------------------------------------------------------------------
  >> Example(11) 
     Lambda functions can be passed as function arguments!
  foldVector(dataset2, 0, add) = 28
  foldVector(dataset2, 1, mul) = 5040

  -----------------------------------------------------------------------------------------
  >> Example(12) - Observer pattern
  (observer 1) Temperature changed to 30.5 C
  (observer 2) Sensor temperature changed to 30.5 C
  (observer 1) Temperature changed to 20.5 C
  (observer 2) Sensor temperature changed to 20.5 C

#+END_SRC

*References*

 - *Lambda Expressions in C++* -
   <https://msdn.microsoft.com/en-us/library/dd293608.aspx>

 - *Lambda expressions (since C++11)* -
   <http://en.cppreference.com/w/cpp/language/lambda> 

 - *C++ Core Guidelines: Function Objects and Lambdas* -
   <http://www.modernescpp.com/index.php/c-core-guidelines-function-objects-and-lambas> 

 - *C++11/C++14 lambda functions - 2017* -
   <http://www.bogotobogo.com/cplusplus/C11/C11_lambda_functions_expressions.php>

 - *Lambda Functions in C++11 - the Definitive Guide* -
   <https://www.cprogramming.com/c++11/c++11-lambda-closures.html> 

 - *Fun with Lambdas: C++14 Style (part 1)* -
   <https://www.slideshare.net/SumantTambe/fun-with-lambdas-c14-style> 

 - *ICS 45C Fall 2016 - Notes and Examples: Functions and Lambdas* -
   <http://www.ics.uci.edu/~thornton/ics45c/Notes/FunctionsAndLambdas/>

 - *Creating Recursive Lambdas ... and returning them too!* -
   <http://cpptruths.blogspot.com.br/2013/10/creating-recursive-lambdas-and.html> 

