Understanding-CPP.html

<div id="outline-container-orgfb90088" class="outline-4">
<h4 id="orgfb90088"><span class="section-number-4">1.10.2</span> Basic Example</h4>
<div class="outline-text-4" id="text-1-10-2">
<p>
<b>Proof-of-concept code</b> 
</p>

<ul class="org-ul">
<li>File: <a href="src/lambdaFun.cpp">file:src/lambdaFun.cpp</a></li>
<li>Online Compiler: <a href="http://rextester.com/SCQP30593">http://rextester.com/SCQP30593</a></li>
</ul>

<p>
Code Highlights:
</p>

<ul class="org-ul">
<li>Lambda function - lambda1</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Example (1)</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">lambda1</span> = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">str</span><span class="org-rainbow-delimiters-depth-1">){</span>
   <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Lambda1: : I got the value = "</span> &lt;&lt; str &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Alternative 1:</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">------------------------------</span>
<span class="org-function-name">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp;<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> lambda1A = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">str</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Lambda1: : I got the value = "</span> &lt;&lt; str &lt;&lt; endl;
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Alternative 2:</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">------------------------------</span>
<span class="org-function-name">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">auto</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp;<span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">void</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> lambda1B = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">str</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Lambda1: : I got the value = "</span> &lt;&lt; str &lt;&lt; endl;
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Alternative 3:</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">------------------------------</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Type synonym </span>
<span class="org-keyword">using</span> <span class="org-type">FnAction</span> = <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp;<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Alternative type synonym: </span>
<span class="org-keyword">using</span> <span class="org-type">FnAction</span> = <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">auto</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp;<span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">void</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>;

<span class="org-type">FnAction</span> <span class="org-variable-name">lambda1C</span> = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">str</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Lambda1: : I got the value = "</span> &lt;&lt; str &lt;&lt; endl;
<span class="org-rainbow-delimiters-depth-1">}</span>;

&gt;&gt; lambda1<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"hello world"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-function-name">Lambda1</span>: : I got the value = hello world

&gt;&gt; lambda1<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"hola mundo"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-function-name">Lambda1</span>: : I got the value = hola mundo

&gt;&gt; lambda1A<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"testing C++"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-function-name">Lambda1</span>: : I got the value = testing C++

&gt;&gt; lambda1B<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Running lambda1B"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-function-name">Lambda1</span>: : I got the value = Running lambda1B

&gt;&gt; lambda1C<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"I am lambda1C function"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-function-name">Lambda1</span>: : I got the value = I am lambda1C function
&gt;&gt;  
</pre>
</div>


<ul class="org-ul">
<li>Higher order function which returns a lambda function which takes
two ints as parameters returning an int. This function captures the
parameter m by value, it means that the parameter is copied in the
function body.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">As it is in the code.</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">----------------------------------------- </span>
<span class="org-function-name">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span>, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> makeFunction1<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">m</span><span class="org-rainbow-delimiters-depth-1">){</span>
    <span class="org-keyword">return</span> <span class="org-rainbow-delimiters-depth-2">[</span>m<span class="org-rainbow-delimiters-depth-2">](</span><span class="org-type">int</span> <span class="org-variable-name">x</span>, <span class="org-type">int</span> <span class="org-variable-name">y</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-keyword">return</span> m * <span class="org-rainbow-delimiters-depth-3">(</span>x + y<span class="org-rainbow-delimiters-depth-3">)</span>; <span class="org-rainbow-delimiters-depth-2">}</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

&gt;&gt; <span class="org-keyword">auto</span> fn = makeFunction1<span class="org-rainbow-delimiters-depth-1">(</span>4<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">int</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-type">int</span>, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7fb73017f010
&gt;&gt; fn<span class="org-rainbow-delimiters-depth-1">(</span>3, 5<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 32
&gt;&gt; fn<span class="org-rainbow-delimiters-depth-1">(</span>4, 3<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 28
&gt;&gt; 

<span class="org-comment-delimiter">// </span><span class="org-comment">Alternative 1:</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">-----------------------------------------</span>
<span class="org-keyword">auto</span> makeFunction1A<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">m</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span>, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">&gt;{</span>
    <span class="org-keyword">return</span> <span class="org-rainbow-delimiters-depth-2">[</span>m<span class="org-rainbow-delimiters-depth-2">](</span><span class="org-type">int</span> <span class="org-variable-name">x</span>, <span class="org-type">int</span> <span class="org-variable-name">y</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-keyword">return</span> m * <span class="org-rainbow-delimiters-depth-3">(</span>x + y<span class="org-rainbow-delimiters-depth-3">)</span>; <span class="org-rainbow-delimiters-depth-2">}</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

&gt;&gt; fna<span class="org-rainbow-delimiters-depth-1">(</span>3, 5<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 32
&gt;&gt; fna<span class="org-rainbow-delimiters-depth-1">(</span>4, 3<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 28
&gt;&gt; <span class="org-keyword">auto</span> fna6 = makeFunction1A<span class="org-rainbow-delimiters-depth-1">(</span>6<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">int</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-type">int</span>, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7f696d823030
&gt;&gt; fna6<span class="org-rainbow-delimiters-depth-1">(</span>3, 5<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 48
&gt;&gt; fna6<span class="org-rainbow-delimiters-depth-1">(</span>4, 3<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 42
&gt;&gt; 

<span class="org-comment-delimiter">// </span><span class="org-comment">Alternative 2:</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">-----------------------------------------</span>
<span class="org-keyword">auto</span> makeFunction1B<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">m</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">auto</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span>, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;{</span>
    <span class="org-keyword">return</span> <span class="org-rainbow-delimiters-depth-2">[</span>m<span class="org-rainbow-delimiters-depth-2">](</span><span class="org-type">int</span> <span class="org-variable-name">x</span>, <span class="org-type">int</span> <span class="org-variable-name">y</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-keyword">return</span> m * <span class="org-rainbow-delimiters-depth-3">(</span>x + y<span class="org-rainbow-delimiters-depth-3">)</span>; <span class="org-rainbow-delimiters-depth-2">}</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Alternative 3:</span>
<span class="org-comment-delimiter">//</span><span class="org-comment">-----------------------------------------</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">C++11 Type synonym</span>
<span class="org-keyword">using</span> <span class="org-type">BinaryIntFunctionA</span> = <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span>, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>;
<span class="org-keyword">using</span> <span class="org-type">BinaryIntFunctionB</span> = <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">auto</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span>, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Prior to C++11 type synonym</span>
<span class="org-keyword">typedef</span> <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">auto</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span>, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-type">BinaryIntFunction</span>;

<span class="org-keyword">auto</span> <span class="org-function-name">makeFunction1C</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">m</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">BinaryIntFunctionB</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">return</span> <span class="org-rainbow-delimiters-depth-2">[</span>m<span class="org-rainbow-delimiters-depth-2">](</span><span class="org-type">int</span> <span class="org-variable-name">x</span>, <span class="org-type">int</span> <span class="org-variable-name">y</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-keyword">return</span> m * <span class="org-rainbow-delimiters-depth-3">(</span>x + y<span class="org-rainbow-delimiters-depth-3">)</span>; <span class="org-rainbow-delimiters-depth-2">}</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

&gt;&gt; <span class="org-keyword">auto</span> fnc = makeFunction1C<span class="org-rainbow-delimiters-depth-1">(</span>8<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">int</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-type">int</span>, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7f696d823050
&gt;&gt; fnc<span class="org-rainbow-delimiters-depth-1">(</span>3, 5<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 64
&gt;&gt; fnc<span class="org-rainbow-delimiters-depth-1">(</span>6, 7<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 104
&gt;&gt; 8 * <span class="org-rainbow-delimiters-depth-1">(</span>6 + 7<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 104
&gt;&gt; 
</pre>
</div>


<p>
Complete program output (<a href="src/lambdaFun.cpp">file:src/lambdaFun.cpp</a>) : 
</p>

<div class="org-src-container">
<pre class="src src-sh">g++ lamdaFun.cpp -o <span class="org-keyword">bin/lamdaFun.bin</span> &amp;&amp; bin/lamdaFun.bin

-----------------------------------------------------------------------------------------
&gt;&gt; Example(1) - Testing <span class="org-keyword">function</span> <span class="org-function-name">lambda1</span>
<span class="org-function-name">Lambda1</span>: : I got the value = Hello
<span class="org-function-name">Lambda1</span>: : I got the value = World

-----------------------------------------------------------------------------------------
&gt;&gt; Example(2) Testing <span class="org-keyword">function</span> <span class="org-function-name">lambda2</span>
Lambda 2 :: I got the value  = Japan
Lambda 2 :: I got the value  = Korea

-----------------------------------------------------------------------------------------
&gt;&gt; Example(3) Testing <span class="org-keyword">function</span> <span class="org-function-name">lambda3</span>
   - Lambda <span class="org-keyword">function</span> <span class="org-function-name">can</span> be defined and executed at the call-site
Lambda 3 :: I got the value = C++11 is awesome!

-----------------------------------------------------------------------------------------
&gt;&gt; Example(4) Testing <span class="org-keyword">function</span> <span class="org-function-name">sumLambda</span>
   - Lambda functions  can return values as any function.
<span class="org-function-name">sumLambda</span>(10.0, 25.34) = 35.34
<span class="org-function-name">sumLambda</span>(-10.23, 4.56) = -5.67

-----------------------------------------------------------------------------------------
&gt;&gt; Example(5) Testing <span class="org-keyword">function</span> <span class="org-function-name">lamdaCapture</span>
   - Lambda functions  can capture its environment (closures) and have state as <span class="org-string">"function objects"</span>
  x  = 5  c = 3
<span class="org-function-name">lamdaCapture</span>(2, 5)  = 32
  x  = 5  c = 4
  lamdaCapture(1, 2) =  16
  x  = 5  c = 5

-----------------------------------------------------------------------------------------
&gt;&gt; Example(6) Testing <span class="org-keyword">function</span> <span class="org-function-name">sumLambda</span>
   - Lambda functions  can play well with STL algorithms
Print all vector elements - Version 1
  v[0] = 1
  v[1] = 2
  v[2] = 3
  v[3] = 4
  v[4] = 5
  v[5] = 6
  v[6] = 7
  v[7] = 8
Print all vector element Version 2  - local state with <span class="org-string">'static'</span> keyword
  v[0] = 1
  v[1] = 2
  v[2] = 3
  v[3] = 4
  v[4] = 5
  v[5] = 6
  v[6] = 7
  v[7] = 8

-----------------------------------------------------------------------------------------
&gt;&gt; Example(7) 
   Playing with STL transform algorithm.
  Vector transformed =  
v  [0] = 4
v  [1] = 7
v  [2] = 10
v  [3] = 13
v  [4] = 16
v  [5] = 19
v  [6] = 22
v  [7] = 25

-----------------------------------------------------------------------------------------
&gt;&gt; Example(8) 
   Lambda functions can be returned from functions and be generated at run-time.
  mulSumBy2(2, 4) = 12
  mulSumBy2(3, 1) = 8
  mulSumBy5(2, 4) = 30
  mulSumBy5(9, 2) = 55

-----------------------------------------------------------------------------------------
&gt;&gt; Example(9) 
   Lambda functions can be returned from functions and have state.
  Running dummy <span class="org-keyword">function</span>
    (*) m = 2, n = 0, x = 1, y = 3, z = 8
  Running dummy <span class="org-keyword">function</span>
    (*) m = 2, n = 1, x = 2, y = 5, z = 15
  Running dummy <span class="org-keyword">function</span>
    (*) m = 3, n = 0, x = 1, y = 3, z = 12
  Running dummy <span class="org-keyword">function</span>
    (*) m = 3, n = 1, x = 2, y = 5, z = 22

-----------------------------------------------------------------------------------------
&gt;&gt; Example(10) 
   Lambda functions can return lambda functions!!
  addTo5(4) = 9
  addTo5(3) = 8
  addTo10(4) = 14
  addTo10(3) = 13

-----------------------------------------------------------------------------------------
&gt;&gt; Example(11) 
   Lambda functions can be passed as <span class="org-keyword">function</span> <span class="org-function-name">arguments</span>!
<span class="org-function-name">foldVector</span>(dataset2, 0, add) = 28
<span class="org-function-name">foldVector</span>(dataset2, 1, mul) = 5040

-----------------------------------------------------------------------------------------
&gt;&gt; Example(12) - Observer pattern
(observer 1) Temperature changed to 30.5 C
(observer 2) Sensor temperature changed to 30.5 C
(observer 1) Temperature changed to 20.5 C
(observer 2) Sensor temperature changed to 20.5 C

</pre>
</div>

<p>
<b>References</b>
</p>

<ul class="org-ul">
<li><b>Lambda Expressions in C++</b> -
<a href="https://msdn.microsoft.com/en-us/library/dd293608.aspx">https://msdn.microsoft.com/en-us/library/dd293608.aspx</a></li>

<li><b>Lambda expressions (since C++11)</b> -
<a href="http://en.cppreference.com/w/cpp/language/lambda">http://en.cppreference.com/w/cpp/language/lambda</a></li>

<li><b>C++ Core Guidelines: Function Objects and Lambdas</b> -
<a href="http://www.modernescpp.com/index.php/c-core-guidelines-function-objects-and-lambas">http://www.modernescpp.com/index.php/c-core-guidelines-function-objects-and-lambas</a></li>

<li><b>C++11/C++14 lambda functions - 2017</b> -
<a href="http://www.bogotobogo.com/cplusplus/C11/C11_lambda_functions_expressions.php">http://www.bogotobogo.com/cplusplus/C11/C11_lambda_functions_expressions.php</a></li>

<li><b>Lambda Functions in C++11 - the Definitive Guide</b> -
<a href="https://www.cprogramming.com/c++11/c++11-lambda-closures.html">https://www.cprogramming.com/c++11/c++11-lambda-closures.html</a></li>

<li><b>Fun with Lambdas: C++14 Style (part 1)</b> -
<a href="https://www.slideshare.net/SumantTambe/fun-with-lambdas-c14-style">https://www.slideshare.net/SumantTambe/fun-with-lambdas-c14-style</a></li>

<li><b>ICS 45C Fall 2016 - Notes and Examples: Functions and Lambdas</b> -
<a href="http://www.ics.uci.edu/~thornton/ics45c/Notes/FunctionsAndLambdas/">http://www.ics.uci.edu/~thornton/ics45c/Notes/FunctionsAndLambdas/</a></li>

<li><b>Creating Recursive Lambdas &#x2026; and returning them too!</b> -
<a href="http://cpptruths.blogspot.com.br/2013/10/creating-recursive-lambdas-and.html">http://cpptruths.blogspot.com.br/2013/10/creating-recursive-lambdas-and.html</a></li>
</ul>
</div>
</div>
