Understanding-CPP.org
**** Overview

The operator std::bind can simplify help simplifying turning ordinary
functions, instance methods (member functions) and static methods
(static member functions) into ordinary functions.

Example 1: Turn a function of signature: 
  + Input Signature:
    + double functionABC(double a, double c, double c)
  + Target signature: 
    + function<double (double)> 

For the function functionABC

#+BEGIN_SRC cpp 
  double functionABC(double a, double c, double c);
#+END_SRC

The expression:

#+BEGIN_SRC cpp 
 // Type of fnFunOfA is std::function<double (double)>
 auto fnFunOfA = std::bind(functionABC, _1, 10.0, 20.0)
 // It is the same as 
 auto fnFunOfA = [](double x){ return functionABC(x, 10.0, 20.0); };
 // It also equivalent to 
 std::function<double (double)> fnFunOfA = [](double x){ return functionABC(x, 10.0, 20.0); };
#+END_SRC

So, it follows that: 

#+BEGIN_SRC cpp 
  auto fnFunOfB = std::bind(functionABC, 25.0 , _1, 20.0);
  // It is equivalent to 
  auto fnFunOfB = [](double x){ return (functionABC, 25.0 , _1, 20.0); };
#+END_SRC

By using more lambda placeholders it is also possible to generate
multi variable functions: 

#+BEGIN_SRC cpp 
  #include <functional> 
  using namespace std::placeholders; // Import placeholders, _1, _2, _3 ...  

  //----------------------------------//
  auto fnFunOfAB = std::bind(functionABC, _1 , _2, 20.0);
  // Equivalent to 
  auto fnFunOfAB = [](double x, double y){ return functionABC( x , y, 20.0);};

  //----------------------------------//
  auto fnFunOfAC = std::bind(functionABC, _1 , 10.0, _2);
  // Equivalent to 
  auto fnFunOfAC = [](double x, double y){ return functionABC( x , 10.0, y);};

  //----------------------------------//
  auto fnFunOfABC = std::bind(functionABC, _1 , 10.0, _2);
  // Equivalent to 
  auto fnFunOfABC = [](double x, double y, double z){ return functionABC( x , y, z);};
#+END_SRC


 *Binding non-static methods (member function)*

For the following class:

#+BEGIN_SRC cpp 
 struct FunctionObject{
      double x;
      double y;
      FunctionObject(double x, double y): x(x), y(y) {};      
      double operator ()(double a){   
         return a * a;
      }   
      double operator ()(double a, double b, double c){
          return a * x + b * y + c / (x + y);
      }
      double method1(double a){
          return this->x * a  + this->y / a;
      }
      double method2(double a, double b, double c){
          return  c * (a / x + b / y);
      }       
  };
#+END_SRC

It is possible to create lambda functions from those class methods
(member functions):

#+BEGIN_SRC cpp 
  FunctionObject obj;

  //-------------------------
  auto method1LambdaA = std::bind(&FunctionObject::method1, fobj, _1);
  // Equivalent to: 
  auto method1LambdaA = [&obj](double a){return obj.method1(x); };

  //-------------------------
  auto method2LambdaAsFnOfAC = std::bind(&FunctionObject::method2, &fobj, _1, 10.0, _2);
  // Equivalent to: 
  auto method2LambdaAsFnOfAC = [&obj](double a, double c){ return obj.method2(a, 10.0, c); }

  //-------------------------
  auto functionOfObj = std::bind(&FunctionObject::method1, _1, 10.0);
  // Equivalent to: 
  auto functionOfobj = [](FunctionObject a){ return obj.method1(obj, 10.0);};
#+END_SRC

