Understanding-CPP.html

<div id="outline-container-org1d4ea75" class="outline-4">
<h4 id="org1d4ea75"><span class="section-number-4">1.10.3</span> std::bind</h4>
<div class="outline-text-4" id="text-1-10-3">
</div>
<ol class="org-ol">
<li><a id="orga4c9f6a"></a>Overview<br />
<div class="outline-text-5" id="text-1-10-3-1">
<p>
The operator std::bind can simplify help simplifying turning ordinary
functions, instance methods (member functions) and static methods
(static member functions) into ordinary functions.
</p>

<p>
Example 1: Turn a function of signature: 
</p>
<ul class="org-ul">
<li>Input Signature:
<ul class="org-ul">
<li>double functionABC(double a, double c, double c)</li>
</ul></li>
<li>Target signature: 
<ul class="org-ul">
<li>function&lt;double (double)&gt;</li>
</ul></li>
</ul>

<p>
For the function functionABC
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">double</span> <span class="org-function-name">functionABC</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">double</span> <span class="org-variable-name">c</span>, <span class="org-type">double</span> <span class="org-variable-name">c</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
The expression:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Type of fnFunOfA is std::function&lt;double (double)&gt;</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">fnFunOfA</span> = <span class="org-constant">std</span>::bind<span class="org-rainbow-delimiters-depth-1">(</span>functionABC, _1, 10.0, 20.0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">It is the same as </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">fnFunOfA</span> = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-keyword">return</span> functionABC<span class="org-rainbow-delimiters-depth-2">(</span>x, 10.0, 20.0<span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">It also equivalent to </span>
<span class="org-function-name">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> fnFunOfA = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-keyword">return</span> functionABC<span class="org-rainbow-delimiters-depth-2">(</span>x, 10.0, 20.0<span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<p>
So, it follows that: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">auto</span> <span class="org-variable-name">fnFunOfB</span> = <span class="org-constant">std</span>::bind<span class="org-rainbow-delimiters-depth-1">(</span>functionABC, 25.0 , _1, 20.0<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">It is equivalent to </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">fnFunOfB</span> = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-keyword">return</span> <span class="org-rainbow-delimiters-depth-2">(</span>functionABC, 25.0 , _1, 20.0<span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<p>
By using more lambda placeholders it is also possible to generate
multi variable functions: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">functional</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span> 
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>::<span class="org-constant">placeholders</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Import placeholders, _1, _2, _3 ...  </span>

<span class="org-comment-delimiter">//</span><span class="org-comment">----------------------------------//</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">fnFunOfAB</span> = <span class="org-constant">std</span>::bind<span class="org-rainbow-delimiters-depth-1">(</span>functionABC, _1 , _2, 20.0<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Equivalent to </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">fnFunOfAB</span> = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span>, <span class="org-type">double</span> <span class="org-variable-name">y</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-keyword">return</span> functionABC<span class="org-rainbow-delimiters-depth-2">(</span> x , y, 20.0<span class="org-rainbow-delimiters-depth-2">)</span>;<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">//</span><span class="org-comment">----------------------------------//</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">fnFunOfAC</span> = <span class="org-constant">std</span>::bind<span class="org-rainbow-delimiters-depth-1">(</span>functionABC, _1 , 10.0, _2<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Equivalent to </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">fnFunOfAC</span> = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span>, <span class="org-type">double</span> <span class="org-variable-name">y</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-keyword">return</span> functionABC<span class="org-rainbow-delimiters-depth-2">(</span> x , 10.0, y<span class="org-rainbow-delimiters-depth-2">)</span>;<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">//</span><span class="org-comment">----------------------------------//</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">fnFunOfABC</span> = <span class="org-constant">std</span>::bind<span class="org-rainbow-delimiters-depth-1">(</span>functionABC, _1 , 10.0, _2<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Equivalent to </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">fnFunOfABC</span> = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span>, <span class="org-type">double</span> <span class="org-variable-name">y</span>, <span class="org-type">double</span> <span class="org-variable-name">z</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-keyword">return</span> functionABC<span class="org-rainbow-delimiters-depth-2">(</span> x , y, z<span class="org-rainbow-delimiters-depth-2">)</span>;<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>


<p>
<b>Binding non-static methods (member function)</b>
</p>

<p>
For the following class:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">struct</span> <span class="org-type">FunctionObject</span><span class="org-rainbow-delimiters-depth-1">{</span>
     <span class="org-type">double</span> <span class="org-variable-name">x</span>;
     <span class="org-type">double</span> <span class="org-variable-name">y</span>;
     <span class="org-function-name">FunctionObject</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span>, <span class="org-type">double</span> <span class="org-variable-name">y</span><span class="org-rainbow-delimiters-depth-2">)</span>: x<span class="org-rainbow-delimiters-depth-2">(</span>x<span class="org-rainbow-delimiters-depth-2">)</span>, y<span class="org-rainbow-delimiters-depth-2">(</span>y<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{}</span>;      
     <span class="org-type">double</span> <span class="org-keyword">operator</span> <span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span><span class="org-rainbow-delimiters-depth-2">){</span>   
        <span class="org-keyword">return</span> a * a;
     <span class="org-rainbow-delimiters-depth-2">}</span>   
     <span class="org-type">double</span> <span class="org-keyword">operator</span> <span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">double</span> <span class="org-variable-name">b</span>, <span class="org-type">double</span> <span class="org-variable-name">c</span><span class="org-rainbow-delimiters-depth-2">){</span>
         <span class="org-keyword">return</span> a * x + b * y + c / <span class="org-rainbow-delimiters-depth-3">(</span>x + y<span class="org-rainbow-delimiters-depth-3">)</span>;
     <span class="org-rainbow-delimiters-depth-2">}</span>
     <span class="org-type">double</span> <span class="org-function-name">method1</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span><span class="org-rainbow-delimiters-depth-2">){</span>
         <span class="org-keyword">return</span> <span class="org-keyword">this</span>-&gt;x * a  + <span class="org-keyword">this</span>-&gt;y / a;
     <span class="org-rainbow-delimiters-depth-2">}</span>
     <span class="org-type">double</span> <span class="org-function-name">method2</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">double</span> <span class="org-variable-name">b</span>, <span class="org-type">double</span> <span class="org-variable-name">c</span><span class="org-rainbow-delimiters-depth-2">){</span>
         <span class="org-keyword">return</span>  c * <span class="org-rainbow-delimiters-depth-3">(</span>a / x + b / y<span class="org-rainbow-delimiters-depth-3">)</span>;
     <span class="org-rainbow-delimiters-depth-2">}</span>       
 <span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<p>
It is possible to create lambda functions from those class methods
(member functions):
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">FunctionObject</span> <span class="org-variable-name">obj</span>;

<span class="org-comment-delimiter">//</span><span class="org-comment">-------------------------</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">method1LambdaA</span> = <span class="org-constant">std</span>::bind<span class="org-rainbow-delimiters-depth-1">(</span>&amp;<span class="org-constant">FunctionObject</span>::method1, fobj, _1<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Equivalent to: </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">method1LambdaA</span> = <span class="org-rainbow-delimiters-depth-1">[</span>&amp;<span class="org-variable-name">obj</span><span class="org-rainbow-delimiters-depth-1">](</span><span class="org-type">double</span> <span class="org-variable-name">a</span><span class="org-rainbow-delimiters-depth-1">){</span><span class="org-keyword">return</span> obj.method1<span class="org-rainbow-delimiters-depth-2">(</span>x<span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">//</span><span class="org-comment">-------------------------</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">method2LambdaAsFnOfAC</span> = <span class="org-constant">std</span>::bind<span class="org-rainbow-delimiters-depth-1">(</span>&amp;<span class="org-constant">FunctionObject</span>::method2, &amp;fobj, _1, 10.0, _2<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Equivalent to: </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">method2LambdaAsFnOfAC</span> = <span class="org-rainbow-delimiters-depth-1">[</span>&amp;<span class="org-variable-name">obj</span><span class="org-rainbow-delimiters-depth-1">](</span><span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">double</span> <span class="org-variable-name">c</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-keyword">return</span> obj.method2<span class="org-rainbow-delimiters-depth-2">(</span>a, 10.0, c<span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">//</span><span class="org-comment">-------------------------</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">functionOfObj</span> = <span class="org-constant">std</span>::bind<span class="org-rainbow-delimiters-depth-1">(</span>&amp;<span class="org-constant">FunctionObject</span>::method1, _1, 10.0<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Equivalent to: </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">functionOfobj</span> = <span class="org-rainbow-delimiters-depth-1">[](</span><span class="org-type">FunctionObject</span> <span class="org-variable-name">a</span><span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-keyword">return</span> obj.method1<span class="org-rainbow-delimiters-depth-2">(</span>obj, 10.0<span class="org-rainbow-delimiters-depth-2">)</span>;<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>
</div>
</li>
