Understanding-CPP.org
**** std::bind Example 
     :PROPERTIES:
     :ID:       219c4de9-3e9e-446f-bdd5-1ae6e7d45b5b
     :END:

File: 
 +  [[file:src/lambda-bind.cpp][file:src/lambda-bind.cpp]]

Running: 

#+BEGIN_SRC sh 
  $ g++ lambda-bind.cpp -o lambda-bind.bin -g -std=c++11 -Wall -Wextra -ldl 
  $ ./lambda-bind.bin

  ======== Test 1 ========
  lambda-bind.cpp:58: ; sum10(2.0) = 12
  lambda-bind.cpp:59: ; sum10(4.5) = 14.5
  lambda-bind.cpp:60: ; sum10(25.0) = 35
  ======== Test 2 ========
  lambda-bind.cpp:66: ; vectorLenAsFunctionOfX(4.0) = 27.2213
  lambda-bind.cpp:67: ; std::bind(vectorLength, _1, 10.0, 25.0)(4.0) = 27.2213
  lambda-bind.cpp:68: ; vectorLenAsFunctionOfX(10.0) = 28.7228
  lambda-bind.cpp:69: ; std::bind(vectorLength, _1, 10.0, 25.0)(10.0) = 28.7228
  Tabulating - vectorLenAsFunctionOfX
       1.000    26.944
       2.000    27.000
       3.000    27.092
       4.000    27.221
       5.000    27.386
  ======== Test 3 ========
  lambda-bind.cpp:77: ; vectorLenAsFunctionOfY(14.0) = 30.348
  lambda-bind.cpp:78: ; vectorLenAsFunctionOfY(20.0) = 33.541
  Tabulating - vectorLenAsFunctionOfY
       1.000    26.944
       2.000    27.000
       3.000    27.092
       4.000    27.221
       5.000    27.386
  ======== Test 4 ========
  lambda-bind.cpp:92: ; vectorLenAsFunctionOfYZ(3.0, 6.0) = 12.0416
  lambda-bind.cpp:93: ; vectorLenAsFunctionOfYZ(15.0, 26.0) = 31.6386
  ======== Test 5 ========
  lambda-bind.cpp:97: ; fobj(4.0) = 16
  lambda-bind.cpp:98: ; fobj(5.0) = 25
  lambda-bind.cpp:99: ; fobj(10.0) = 100
  lambda-bind.cpp:101: ; fobj(4.0, 10.0, 5.0) = 104.357
  lambda-bind.cpp:102: ; fobj(6.0, 8.0, 9.0) = 100.643
  Running: tabulate(0.0, 5.0, 1.0, fobj)
       0.000     0.000
       1.000     1.000
       2.000     4.000
       3.000     9.000
       4.000    16.000
       5.000    25.000
  Turning class member function into lambda function 
   Note: it is not possible (0.0, 5.0, 1.0, fobj.method1)
  lambda-bind.cpp:111: ; fobj.method1(10.0) = 60.8
  lambda-bind.cpp:112: ; method1LambdaA(10.0) = 60.8
  lambda-bind.cpp:113: ; fobj.method1(20.0) = 120.4
  lambda-bind.cpp:114: ; method1LambdaA(20.0) = 120.4
  lambda-bind.cpp:115: ; fobj.method1(30.0) = 180.267
  lambda-bind.cpp:116: ; method1LambdaA(30.0) = 180.267
  Tabulating method1LambdaA
       0.000       inf
       1.000    14.000
       2.000    16.000
       3.000    20.667
       4.000    26.000
       5.000    31.600
  Tabulating method1LambdaA using direct lambda
       0.000       inf
       1.000    14.000
       2.000    16.000
       3.000    20.667
       4.000    26.000
       5.000    31.600
  ======== Test 6 ========
  lambda-bind.cpp:129: ; method2LambdaAsFnOfA(5.0) = 41.6667
  lambda-bind.cpp:130: ; method2LambdaAsFnOfA(6.0) = 45
  lambda-bind.cpp:131: ; method2LambdaAsFnOfA(10.0) = 58.3333
  lambda-bind.cpp:136: ; fobj.method2(3.0, 10.0, 4.0) = 7
  lambda-bind.cpp:137: ; method2LambdaAsFnOfAC(3.0, 4.0) = 7
  lambda-bind.cpp:138: ; fobj.method2(15.0, 10.0, 14.0) = 52.5
  lambda-bind.cpp:139: ; method2LambdaAsFnOfAC(15.0, 14.0) = 52.5


#+END_SRC
** OOP Polymorphism 
*** Overview 

 Dynamic or subtyping polymorphis is basically, the ability
 of the client code to deal with any any instance of derived classes in
 the same way it deals with an instance of the base class. 

 In C++, it is only possible to use OOP subtyping polymorphism with
 pointers or references. As a result, it is not possible to store
 instances of base class in STL containers by value, or to create
 polymorphic functions which return instance of derived classes by
 value or take instance derived classes as argument passed by value.

 To summarize: 

  + Object Oriented Polymorphism, is aso called:
    + Dynamic polymorphism
    + Runtime polymorphism 
  + In C++ it is only possible to use polymorphism with references or
    pointers.
  + A polymorphic function which returns any instance of the derived
    class casted as an instance of the base class can only return them
    *by pointer to objects allocated on the heap* (dynamic memory) with
    *new* operator. Functions like this are called factory functions and
    in this case, it is better to wrap the pointer in smart pointer,
    ~unique_ptr~ or ~shared_ptr~.
