Understanding-CPP.html

<li><a id="org55a72c1"></a><a id="ID-219c4de9-3e9e-446f-bdd5-1ae6e7d45b5b"></a>std::bind Example<br />
<div class="outline-text-5" id="text-1-10-3-2">
<p>
File: 
</p>
<ul class="org-ul">
<li><a href="src/lambda-bind.cpp">file:src/lambda-bind.cpp</a></li>
</ul>

<p>
Running: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ g++ lambda-bind.cpp -o <span class="org-keyword">lambda-bind.bin</span> -g -std=c++11 -Wall -Wextra -ldl 
$ ./lambda-bind.bin

======== Test 1 ========
<span class="org-function-name">lambda-bind.cpp</span>:58: ; sum10(2.0) = 12
<span class="org-function-name">lambda-bind.cpp</span>:59: ; sum10(4.5) = 14.5
<span class="org-function-name">lambda-bind.cpp</span>:60: ; sum10(25.0) = 35
======== Test 2 ========
<span class="org-function-name">lambda-bind.cpp</span>:66: ; vectorLenAsFunctionOfX(4.0) = 27.2213
<span class="org-function-name">lambda-bind.cpp</span>:67: ; std::bind(vectorLength, _1, 10.0, 25.0)(4.0) = 27.2213
<span class="org-function-name">lambda-bind.cpp</span>:68: ; vectorLenAsFunctionOfX(10.0) = 28.7228
<span class="org-function-name">lambda-bind.cpp</span>:69: ; std::bind(vectorLength, _1, 10.0, 25.0)(10.0) = 28.7228
Tabulating - vectorLenAsFunctionOfX
     1.000    26.944
     2.000    27.000
     3.000    27.092
     4.000    27.221
     5.000    27.386
======== Test 3 ========
<span class="org-function-name">lambda-bind.cpp</span>:77: ; vectorLenAsFunctionOfY(14.0) = 30.348
<span class="org-function-name">lambda-bind.cpp</span>:78: ; vectorLenAsFunctionOfY(20.0) = 33.541
Tabulating - vectorLenAsFunctionOfY
     1.000    26.944
     2.000    27.000
     3.000    27.092
     4.000    27.221
     5.000    27.386
======== Test 4 ========
<span class="org-function-name">lambda-bind.cpp</span>:92: ; vectorLenAsFunctionOfYZ(3.0, 6.0) = 12.0416
<span class="org-function-name">lambda-bind.cpp</span>:93: ; vectorLenAsFunctionOfYZ(15.0, 26.0) = 31.6386
======== Test 5 ========
<span class="org-function-name">lambda-bind.cpp</span>:97: ; fobj(4.0) = 16
<span class="org-function-name">lambda-bind.cpp</span>:98: ; fobj(5.0) = 25
<span class="org-function-name">lambda-bind.cpp</span>:99: ; fobj(10.0) = 100
<span class="org-function-name">lambda-bind.cpp</span>:101: ; fobj(4.0, 10.0, 5.0) = 104.357
<span class="org-function-name">lambda-bind.cpp</span>:102: ; fobj(6.0, 8.0, 9.0) = 100.643
<span class="org-function-name">Running</span>: tabulate(0.0, 5.0, 1.0, fobj)
     0.000     0.000
     1.000     1.000
     2.000     4.000
     3.000     9.000
     4.000    16.000
     5.000    25.000
Turning class member <span class="org-keyword">function</span> <span class="org-function-name">into</span> lambda <span class="org-keyword">function</span> 
 Note: it is not possible (0.0, 5.0, 1.0, fobj.method1)
<span class="org-function-name">lambda-bind.cpp</span>:111: ; fobj.method1(10.0) = 60.8
<span class="org-function-name">lambda-bind.cpp</span>:112: ; method1LambdaA(10.0) = 60.8
<span class="org-function-name">lambda-bind.cpp</span>:113: ; fobj.method1(20.0) = 120.4
<span class="org-function-name">lambda-bind.cpp</span>:114: ; method1LambdaA(20.0) = 120.4
<span class="org-function-name">lambda-bind.cpp</span>:115: ; fobj.method1(30.0) = 180.267
<span class="org-function-name">lambda-bind.cpp</span>:116: ; method1LambdaA(30.0) = 180.267
Tabulating method1LambdaA
     0.000       inf
     1.000    14.000
     2.000    16.000
     3.000    20.667
     4.000    26.000
     5.000    31.600
Tabulating method1LambdaA using direct lambda
     0.000       inf
     1.000    14.000
     2.000    16.000
     3.000    20.667
     4.000    26.000
     5.000    31.600
======== Test 6 ========
<span class="org-function-name">lambda-bind.cpp</span>:129: ; method2LambdaAsFnOfA(5.0) = 41.6667
<span class="org-function-name">lambda-bind.cpp</span>:130: ; method2LambdaAsFnOfA(6.0) = 45
<span class="org-function-name">lambda-bind.cpp</span>:131: ; method2LambdaAsFnOfA(10.0) = 58.3333
<span class="org-function-name">lambda-bind.cpp</span>:136: ; fobj.method2(3.0, 10.0, 4.0) = 7
<span class="org-function-name">lambda-bind.cpp</span>:137: ; method2LambdaAsFnOfAC(3.0, 4.0) = 7
<span class="org-function-name">lambda-bind.cpp</span>:138: ; fobj.method2(15.0, 10.0, 14.0) = 52.5
<span class="org-function-name">lambda-bind.cpp</span>:139: ; method2LambdaAsFnOfAC(15.0, 14.0) = 52.5


</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org15cc8ef" class="outline-3">
<h3 id="org15cc8ef"><span class="section-number-3">1.11</span> OOP Polymorphism</h3>
<div class="outline-text-3" id="text-1-11">
</div>
<div id="outline-container-orgaf15b97" class="outline-4">
<h4 id="orgaf15b97"><span class="section-number-4">1.11.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-11-1">
<p>
Dynamic or subtyping polymorphis is basically, the ability
of the client code to deal with any any instance of derived classes in
the same way it deals with an instance of the base class. 
</p>

<p>
In C++, it is only possible to use OOP subtyping polymorphism with
pointers or references. As a result, it is not possible to store
instances of base class in STL containers by value, or to create
polymorphic functions which return instance of derived classes by
value or take instance derived classes as argument passed by value.
</p>

<p>
To summarize: 
</p>

<ul class="org-ul">
<li>Object Oriented Polymorphism, is aso called:
<ul class="org-ul">
<li>Dynamic polymorphism</li>
<li>Runtime polymorphism</li>
</ul></li>
<li>In C++ it is only possible to use polymorphism with references or
pointers.</li>
<li>A polymorphic function which returns any instance of the derived
class casted as an instance of the base class can only return them
<b>by pointer to objects allocated on the heap</b> (dynamic memory) with
<b>new</b> operator. Functions like this are called factory functions and
in this case, it is better to wrap the pointer in smart pointer,
<code>unique_ptr</code> or <code>shared_ptr</code>.</li>
</ul>
</div>
</div>
