Understanding-CPP.org
*** Dynamic Polymorphism example 

 File: polymorphism.cpp 

 #+BEGIN_SRC cpp 
   #include <iostream>
   #include <string>
   #include <memory>   // C++11 Smart pointers (unique_ptr and shared_ptr)
   #include <map>      // Hash table, hash map or dictionary
   #include <vector>
   #include <deque>

   #include <cassert> // assertions tests 

   // Interface class 
   class GenericDBDriver{
   public:
     GenericDBDriver() = default;
     virtual auto driverName()  const -> std::string {
       return "generic";   
     }
     virtual auto getID() const -> std::string {
       return "unknown";
     }
     virtual auto connect(std::string url) -> void {
       std::cout << "Connecting to generic driver url = " << url << std::endl;
     }
     virtual auto isConnected()  const -> bool {
       return false;
     }
     // Default destructor
     virtual ~GenericDBDriver() {
       std::cout << "Disconnecting from generic driver - id = " << "unknown"<< std::endl;
     }
   };

   class DriverSQLiteDriver: public GenericDBDriver{
   private:
     bool m_connected = false;
     std::string m_id = "unknown";
   public:
     DriverSQLiteDriver() = default;
     DriverSQLiteDriver(const std::string& name): m_id(name){}
    
     // Const keyword in this case indicates that the member function (method)
     // doesn't change the current object.
     auto driverName() const -> std::string override{
       return "sqlite";
     }
     auto getID() const -> std::string override {
       return m_id;
     }  
     // This keyword override -> indicates visually that the method
     // is being overriden and also provides some safety features which
     // helps to improve type-safety and compile-time correctness.
     // For instance, if member function (aka method) being overriden
     // is not annotated as virtual in the base class, this C++11 keyword
     // will generate a compile-time error. It also will generate a compile-time
     // error if the member function being overriden doesn't exist in the base class.  
     auto connect(std::string url) -> void override {
       std::cout << "Connecting to " << url << std::endl;
       m_connected = true;
     }
     auto isConnected() const -> bool override {
       return m_connected;
     }
     ~DriverSQLiteDriver(){
       std::cout << "Disconnecting from PosgresDB - m_id = " << m_id << std::endl;
     }
   };


   class DriverPostgresSQL: public GenericDBDriver{
   private:
     bool m_connected = false;
     std::string m_id = "unknown";  
   public:
     // DriverPostgresSQL () = default;
     DriverPostgresSQL(const std::string& name): m_id(name){}
 
     auto driverName() const -> std::string override{
       return "PostGresSQL";
     }
     virtual auto getID() const -> std::string override {
       return m_id;
     }   
     auto connect(std::string url) -> void override {
       std::cout << "Connecting to " << url << std::endl;
       m_connected = true;
     }
     auto isConnected() const -> bool override {
       return m_connected;
     }
     ~DriverPostgresSQL(){
       std::cout << "Disconnecting from PostGresSQL - id = " << m_id << std::endl;
     }  
   };


   class DriverSQLServer : public GenericDBDriver{
   private:
     bool m_connected = false;
     std::string m_id = "unknown";  
   public:
     DriverSQLServer() = default;
     DriverSQLServer(const std::string& name): m_id(name){}
      
     auto driverName() const -> std::string override{
       return "SQLServer";
     }
     auto getID() const -> std::string override {
       return m_id;
     }    
     auto connect(std::string url) -> void override {
       std::cout << "Connecting to " << url << std::endl;
       m_connected = true;
     }
     auto isConnected() const -> bool override {
       return m_connected;
     }
     ~DriverSQLServer(){
       std::cout << "Disconnecting from SQLServer - id = " << m_id << std::endl;
     }  
   };


   // Non-polymorphi function -> Parameters passed by value cannot be polymorphic
   // void showDriverStatus(const GenericDBDriver driver){ ... }

   // Polymorphic function using references 
   void showDriverStatus1(const GenericDBDriver& driver){
     std::cout << std::boolalpha;
     std::cout << " [INFO] Driver = " << driver.driverName()
               << " id = " << driver.getID()
               << " ; status = " << driver.isConnected() <<  std::endl;
   }

   // Polymorphic function using pointers 
   void showDriverStatus2(const GenericDBDriver* driver){
     std::cout << std::boolalpha;
     std::cout << " [INFO] Driver = " << driver->driverName()
               << " id = " << driver->getID()
               << " ; status = " << driver->isConnected() <<  std::endl;
   }


   // Factory method
   enum class DriverType{
    generic,
    sqlite,
    postgres,
    sqlserver                        
   };

   auto dbDriverFactory(const DriverType& dbtype, const std::string& id = "unknown")
     -> std::shared_ptr<GenericDBDriver>{
     if(dbtype == DriverType::generic)
       return std::make_shared<GenericDBDriver>();   
     if(dbtype == DriverType::sqlite)
       return std::make_shared<DriverSQLiteDriver>(id);   
     if(dbtype == DriverType::postgres)
       return std::make_shared<DriverPostgresSQL>(id);   
     if(dbtype == DriverType::sqlserver)
       return std::make_shared<DriverSQLServer>(id);    
     // Failure -> DO NOT return old C++98 NULL as it is not typesafe 
     return nullptr;
   }


   class DriverFactory{
   private:
  
   public:

     DriverFactory() = delete;
     DriverFactory(const DriverFactory& lhs) = delete;

     static auto getInstance() 
   };

   int main(){

     {
       std::cout << "\n====== Test 1 ===========" << std::endl;
       // Uniform initialization 
       GenericDBDriver   d0;
       DriverSQLServer   d1{"d1"};
       DriverPostgresSQL d2 = {"d2"};
       DriverSQLServer   d3 = {"d3"};

       showDriverStatus1(d0);
       showDriverStatus1(d1);
       d1.connect("file:///home/user/datbase.sqlite");
       showDriverStatus1(d1);
       showDriverStatus1(d2);
       showDriverStatus1(d3);

       std::cout << "====== End of test 1 ===========" << std::endl;
     }

     {
       std::cout << "\n====== Test 2 ===========" << std::endl;
       // Uniform initialization 
       GenericDBDriver   d0;
       DriverSQLServer   d1{"d1"};
       DriverPostgresSQL d2 = {"d2"};
       DriverSQLServer   d3 = {"d3"};

       showDriverStatus2(&d0);
       showDriverStatus2(&d1);
       d1.connect("file:///home/user/datbase.sqlite");
       showDriverStatus2(&d1);
       showDriverStatus2(&d2);
       showDriverStatus2(&d3);

       std::cout << "====== End of test 2 ===========" << std::endl;
     }

     { // Failure ! -> It only calls the methods of GenericDBDriver
       // It is not possible to polymorphism (subtyping polymorphism) in C++
       // without pointers or references.
       std::cout << "\n====== Test 3 ===========" << std::endl;
       std::deque<GenericDBDriver> xs;

       xs.push_back(GenericDBDriver{});
       xs.push_back(DriverSQLServer {"d1"});
       xs.push_back(DriverPostgresSQL{"d2"});
       xs.push_back(DriverSQLServer{"d3"});

       for(const auto& x: xs){
         std::cout << " - driver = " << x.driverName() << " ; id = " << x.getID() << std::endl;
       }

       assert(xs.at(0).driverName() == "generic");
       assert(xs.at(1).driverName() == "generic");
       assert(xs.at(2).driverName() == "generic");
       assert(xs.at(3).driverName() == "generic");
    
       std::cout << "\n====== End of test 3 ===========" << std::endl;
     }


     { std::cout << "\n====== Test 4 ===========" << std::endl;
       std::deque<GenericDBDriver*> xs;

       auto d0 = GenericDBDriver{};
       auto d1 = DriverSQLiteDriver {"d1"};
       auto d2 = DriverPostgresSQL{"d2"};
       auto d3 = DriverSQLServer{"d3"};
       xs.push_back(&d0);
       xs.push_back(&d1);
       xs.push_back(&d2);
       xs.push_back(&d3);

       for(const auto& x: xs){
         std::cout << " - driver = " << x->driverName() << " ; id = " << x->getID() << std::endl;;
       }
       assert(xs.at(0)->driverName() == "generic");
       assert(xs.at(1)->driverName() == "sqlite");
       assert(xs.at(2)->driverName() == "PostGresSQL");
       assert(xs.at(3)->driverName() == "SQLServer");
    
       std::cout << "====== End of test 4 ===========" << std::endl;
     }  

     { std::cout << "\n====== Test 5 ===========" << std::endl;
       std::deque<std::shared_ptr<GenericDBDriver>> xs;
       xs.push_back(dbDriverFactory(DriverType::generic));
       xs.push_back(dbDriverFactory(DriverType::sqlite,    "d1"));
       xs.push_back(dbDriverFactory(DriverType::postgres,  "d2"));
       xs.push_back(dbDriverFactory(DriverType::sqlserver, "d3"));
       for(const auto& x: xs){
         std::cout << " - driver = " << x->driverName() << " ; id = " << x->getID() << std::endl;;
       }
       assert(xs.at(0)->driverName() == "generic");
       assert(xs.at(1)->driverName() == "sqlite");
       assert(xs.at(2)->driverName() == "PostGresSQL");
       assert(xs.at(3)->driverName() == "SQLServer");
    
       std::cout << "====== End of test 5 ===========" << std::endl;
     }  
     return EXIT_SUCCESS;
   }
 #+END_SRC

 Running: 

 #+BEGIN_SRC sh
   $ clang++ polymorphism.cpp -std=c++1z -Wall -Wextra && ./a.out

   ====== Test 1 ===========
    [INFO] Driver = generic id = unknown ; status = false
    [INFO] Driver = SQLServer id = d1 ; status = false
   Connecting to file:///home/user/datbase.sqlite
    [INFO] Driver = SQLServer id = d1 ; status = true
    [INFO] Driver = PostGresSQL id = d2 ; status = false
    [INFO] Driver = SQLServer id = d3 ; status = false
   ====== End of test 1 ===========
   Disconnecting from SQLServer - id = d3
   Disconnecting from generic driver - id = unknown
   Disconnecting from PostGresSQL - id = d2
   Disconnecting from generic driver - id = unknown
   Disconnecting from SQLServer - id = d1
   Disconnecting from generic driver - id = unknown
   Disconnecting from generic driver - id = unknown

   ====== Test 2 ===========
    [INFO] Driver = generic id = unknown ; status = false
    [INFO] Driver = SQLServer id = d1 ; status = false
   Connecting to file:///home/user/datbase.sqlite
    [INFO] Driver = SQLServer id = d1 ; status = true
    [INFO] Driver = PostGresSQL id = d2 ; status = false
    [INFO] Driver = SQLServer id = d3 ; status = false
   ====== End of test 2 ===========
   Disconnecting from SQLServer - id = d3
   Disconnecting from generic driver - id = unknown
   Disconnecting from PostGresSQL - id = d2
   Disconnecting from generic driver - id = unknown
   Disconnecting from SQLServer - id = d1
   Disconnecting from generic driver - id = unknown
   Disconnecting from generic driver - id = unknown

   ====== Test 3 ===========
   Disconnecting from generic driver - id = unknown
   Disconnecting from SQLServer - id = d1
   Disconnecting from generic driver - id = unknown
   Disconnecting from PostGresSQL - id = d2
   Disconnecting from generic driver - id = unknown
   Disconnecting from SQLServer - id = d3
   Disconnecting from generic driver - id = unknown
    - driver = generic ; id = unknown
    - driver = generic ; id = unknown
    - driver = generic ; id = unknown
    - driver = generic ; id = unknown

   ====== End of test 3 ===========
   Disconnecting from generic driver - id = unknown
   Disconnecting from generic driver - id = unknown
   Disconnecting from generic driver - id = unknown
   Disconnecting from generic driver - id = unknown

   ====== Test 4 ===========
    - driver = generic ; id = unknown
    - driver = sqlite ; id = d1
    - driver = PostGresSQL ; id = d2
    - driver = SQLServer ; id = d3
   ====== End of test 4 ===========
   Disconnecting from SQLServer - id = d3
   Disconnecting from generic driver - id = unknown
   Disconnecting from PostGresSQL - id = d2
   Disconnecting from generic driver - id = unknown
   Disconnecting from PosgresDB - m_id = d1
   Disconnecting from generic driver - id = unknown
   Disconnecting from generic driver - id = unknown

   ====== Test 5 ===========
    - driver = generic ; id = unknown
    - driver = sqlite ; id = d1
    - driver = PostGresSQL ; id = d2
    - driver = SQLServer ; id = d3
   ====== End of test 5 ===========
   Disconnecting from generic driver - id = unknown
   Disconnecting from PosgresDB - m_id = d1
   Disconnecting from generic driver - id = unknown
   Disconnecting from PostGresSQL - id = d2
   Disconnecting from generic driver - id = unknown
   Disconnecting from SQLServer - id = d3
   Disconnecting from generic driver - id = unknown

 #+END_SRC


