Understanding-CPP.html
<div id="outline-container-org988da5d" class="outline-4">
<h4 id="org988da5d"><span class="section-number-4">1.11.2</span> Dynamic Polymorphism example</h4>
<div class="outline-text-4" id="text-1-11-2">
<p>
File: polymorphism.cpp 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">string</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">memory</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>   <span class="org-comment-delimiter">// </span><span class="org-comment">C++11 Smart pointers (unique_ptr and shared_ptr)</span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">map</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>      <span class="org-comment-delimiter">// </span><span class="org-comment">Hash table, hash map or dictionary</span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">vector</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">deque</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">cassert</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span> <span class="org-comment-delimiter">// </span><span class="org-comment">assertions tests </span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Interface class </span>
<span class="org-keyword">class</span> <span class="org-type">GenericDBDriver</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">public</span>:
  <span class="org-function-name">GenericDBDriver</span><span class="org-rainbow-delimiters-depth-2">()</span> = <span class="org-keyword">default</span>;
  <span class="org-keyword">virtual</span> <span class="org-keyword">auto</span> <span class="org-function-name">driverName</span><span class="org-rainbow-delimiters-depth-2">()</span>  <span class="org-keyword">const</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> <span class="org-string">"generic"</span>;   
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-keyword">virtual</span> <span class="org-keyword">auto</span> <span class="org-function-name">getID</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> <span class="org-string">"unknown"</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-keyword">virtual</span> <span class="org-keyword">auto</span> <span class="org-function-name">connect</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">url</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Connecting to generic driver url = "</span> &lt;&lt; url &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-keyword">virtual</span> <span class="org-keyword">auto</span> <span class="org-function-name">isConnected</span><span class="org-rainbow-delimiters-depth-2">()</span>  <span class="org-keyword">const</span> -&gt; <span class="org-type">bool</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> <span class="org-constant">false</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">Default destructor</span>
  <span class="org-keyword">virtual</span> ~<span class="org-function-name">GenericDBDriver</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Disconnecting from generic driver - id = "</span> &lt;&lt; <span class="org-string">"unknown"</span>&lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-keyword">class</span> <span class="org-type">DriverSQLiteDriver</span>: <span class="org-keyword">public</span> <span class="org-type">GenericDBDriver</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:
  <span class="org-type">bool</span> <span class="org-variable-name">m_connected</span> = <span class="org-constant">false</span>;
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">m_id</span> = <span class="org-string">"unknown"</span>;
<span class="org-function-name">public</span>:
  <span class="org-function-name">DriverSQLiteDriver</span><span class="org-rainbow-delimiters-depth-2">()</span> = <span class="org-keyword">default</span>;
  <span class="org-function-name">DriverSQLiteDriver</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">)</span>: <span class="org-function-name">m_id</span><span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">){}</span>

  <span class="org-comment-delimiter">// </span><span class="org-comment">Const keyword in this case indicates that the member function (method)</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">doesn't change the current object.</span>
  <span class="org-keyword">auto</span> <span class="org-function-name">driverName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-keyword">override</span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> <span class="org-string">"sqlite"</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-keyword">auto</span> <span class="org-function-name">getID</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-keyword">override</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> m_id;
  <span class="org-rainbow-delimiters-depth-2">}</span>  
  <span class="org-comment-delimiter">// </span><span class="org-comment">This keyword override -&gt; indicates visually that the method</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">is being overriden and also provides some safety features which</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">helps to improve type-safety and compile-time correctness.</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">For instance, if member function (aka method) being overriden</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">is not annotated as virtual in the base class, this C++11 keyword</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">will generate a compile-time error. It also will generate a compile-time</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">error if the member function being overriden doesn't exist in the base class.  </span>
  <span class="org-keyword">auto</span> <span class="org-function-name">connect</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">url</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">void</span> <span class="org-keyword">override</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Connecting to "</span> &lt;&lt; url &lt;&lt; <span class="org-constant">std</span>::endl;
    m_connected = <span class="org-constant">true</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-keyword">auto</span> <span class="org-function-name">isConnected</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-type">bool</span> <span class="org-keyword">override</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> m_connected;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  ~<span class="org-function-name">DriverSQLiteDriver</span><span class="org-rainbow-delimiters-depth-2">(){</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Disconnecting from PosgresDB - m_id = "</span> &lt;&lt; m_id &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;


<span class="org-keyword">class</span> <span class="org-type">DriverPostgresSQL</span>: <span class="org-keyword">public</span> <span class="org-type">GenericDBDriver</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:
  <span class="org-type">bool</span> <span class="org-variable-name">m_connected</span> = <span class="org-constant">false</span>;
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">m_id</span> = <span class="org-string">"unknown"</span>;  
<span class="org-function-name">public</span>:
  <span class="org-comment-delimiter">// </span><span class="org-comment">DriverPostgresSQL () = default;</span>
  <span class="org-function-name">DriverPostgresSQL</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">)</span>: <span class="org-function-name">m_id</span><span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">){}</span>

  <span class="org-keyword">auto</span> <span class="org-function-name">driverName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-keyword">override</span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> <span class="org-string">"PostGresSQL"</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-keyword">virtual</span> <span class="org-keyword">auto</span> <span class="org-function-name">getID</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-keyword">override</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> m_id;
  <span class="org-rainbow-delimiters-depth-2">}</span>   
  <span class="org-keyword">auto</span> <span class="org-function-name">connect</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">url</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">void</span> <span class="org-keyword">override</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Connecting to "</span> &lt;&lt; url &lt;&lt; <span class="org-constant">std</span>::endl;
    m_connected = <span class="org-constant">true</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-keyword">auto</span> <span class="org-function-name">isConnected</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-type">bool</span> <span class="org-keyword">override</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> m_connected;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  ~<span class="org-function-name">DriverPostgresSQL</span><span class="org-rainbow-delimiters-depth-2">(){</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Disconnecting from PostGresSQL - id = "</span> &lt;&lt; m_id &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>  
<span class="org-rainbow-delimiters-depth-1">}</span>;


<span class="org-keyword">class</span> <span class="org-type">DriverSQLServer</span> : <span class="org-keyword">public</span> <span class="org-type">GenericDBDriver</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:
  <span class="org-type">bool</span> <span class="org-variable-name">m_connected</span> = <span class="org-constant">false</span>;
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">m_id</span> = <span class="org-string">"unknown"</span>;  
<span class="org-function-name">public</span>:
  <span class="org-function-name">DriverSQLServer</span><span class="org-rainbow-delimiters-depth-2">()</span> = <span class="org-keyword">default</span>;
  <span class="org-function-name">DriverSQLServer</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">)</span>: <span class="org-function-name">m_id</span><span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">){}</span>

  <span class="org-keyword">auto</span> <span class="org-function-name">driverName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-keyword">override</span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> <span class="org-string">"SQLServer"</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-keyword">auto</span> <span class="org-function-name">getID</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-keyword">override</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> m_id;
  <span class="org-rainbow-delimiters-depth-2">}</span>    
  <span class="org-keyword">auto</span> <span class="org-function-name">connect</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">url</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">void</span> <span class="org-keyword">override</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Connecting to "</span> &lt;&lt; url &lt;&lt; <span class="org-constant">std</span>::endl;
    m_connected = <span class="org-constant">true</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-keyword">auto</span> <span class="org-function-name">isConnected</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-type">bool</span> <span class="org-keyword">override</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> m_connected;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  ~<span class="org-function-name">DriverSQLServer</span><span class="org-rainbow-delimiters-depth-2">(){</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Disconnecting from SQLServer - id = "</span> &lt;&lt; m_id &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>  
<span class="org-rainbow-delimiters-depth-1">}</span>;


<span class="org-comment-delimiter">// </span><span class="org-comment">Non-polymorphi function -&gt; Parameters passed by value cannot be polymorphic</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">void showDriverStatus(const GenericDBDriver driver){ ... }</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Polymorphic function using references </span>
<span class="org-type">void</span> <span class="org-function-name">showDriverStatus1</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">GenericDBDriver</span>&amp; <span class="org-variable-name">driver</span><span class="org-rainbow-delimiters-depth-1">){</span>
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::boolalpha;
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [INFO] Driver = "</span> &lt;&lt; driver.driverName<span class="org-rainbow-delimiters-depth-2">()</span>
            &lt;&lt; <span class="org-string">" id = "</span> &lt;&lt; driver.getID<span class="org-rainbow-delimiters-depth-2">()</span>
            &lt;&lt; <span class="org-string">" ; status = "</span> &lt;&lt; driver.isConnected<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt;  <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Polymorphic function using pointers </span>
<span class="org-type">void</span> <span class="org-function-name">showDriverStatus2</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">GenericDBDriver</span>* <span class="org-variable-name">driver</span><span class="org-rainbow-delimiters-depth-1">){</span>
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::boolalpha;
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [INFO] Driver = "</span> &lt;&lt; driver-&gt;driverName<span class="org-rainbow-delimiters-depth-2">()</span>
            &lt;&lt; <span class="org-string">" id = "</span> &lt;&lt; driver-&gt;getID<span class="org-rainbow-delimiters-depth-2">()</span>
            &lt;&lt; <span class="org-string">" ; status = "</span> &lt;&lt; driver-&gt;isConnected<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt;  <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">}</span>


<span class="org-comment-delimiter">// </span><span class="org-comment">Factory method</span>
<span class="org-keyword">enum</span> <span class="org-keyword">class</span> <span class="org-type">DriverType</span><span class="org-rainbow-delimiters-depth-1">{</span>
 <span class="org-variable-name">generic</span>,
 <span class="org-variable-name">sqlite</span>,
 <span class="org-variable-name">postgres</span>,
 <span class="org-variable-name">sqlserver</span>                        
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-keyword">auto</span> <span class="org-function-name">dbDriverFactory</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">DriverType</span>&amp; <span class="org-variable-name">dbtype</span>, <span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">id</span> = <span class="org-string">"unknown"</span><span class="org-rainbow-delimiters-depth-1">)</span>
  -&gt; <span class="org-constant">std</span>::<span class="org-type">shared_ptr</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">GenericDBDriver</span><span class="org-rainbow-delimiters-depth-1">&gt;{</span>
  <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>dbtype == <span class="org-constant">DriverType</span>::generic<span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-keyword">return</span> <span class="org-constant">std</span>::make_shared<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">GenericDBDriver</span><span class="org-rainbow-delimiters-depth-2">&gt;()</span>;   
  <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>dbtype == <span class="org-constant">DriverType</span>::sqlite<span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-keyword">return</span> <span class="org-constant">std</span>::make_shared<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">DriverSQLiteDriver</span><span class="org-rainbow-delimiters-depth-2">&gt;(</span>id<span class="org-rainbow-delimiters-depth-2">)</span>;   
  <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>dbtype == <span class="org-constant">DriverType</span>::postgres<span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-keyword">return</span> <span class="org-constant">std</span>::make_shared<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">DriverPostgresSQL</span><span class="org-rainbow-delimiters-depth-2">&gt;(</span>id<span class="org-rainbow-delimiters-depth-2">)</span>;   
  <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>dbtype == <span class="org-constant">DriverType</span>::sqlserver<span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-keyword">return</span> <span class="org-constant">std</span>::make_shared<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">DriverSQLServer</span><span class="org-rainbow-delimiters-depth-2">&gt;(</span>id<span class="org-rainbow-delimiters-depth-2">)</span>;    
  <span class="org-comment-delimiter">// </span><span class="org-comment">Failure -&gt; DO NOT return old C++98 NULL as it is not typesafe </span>
  <span class="org-keyword">return</span> <span class="org-constant">nullptr</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>


<span class="org-keyword">class</span> <span class="org-type">DriverFactory</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:

<span class="org-function-name">public</span>:

  <span class="org-function-name">DriverFactory</span><span class="org-rainbow-delimiters-depth-2">()</span> = <span class="org-keyword">delete</span>;
  <span class="org-function-name">DriverFactory</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">DriverFactory</span>&amp; <span class="org-variable-name">lhs</span><span class="org-rainbow-delimiters-depth-2">)</span> = <span class="org-keyword">delete</span>;

  <span class="org-keyword">static</span> <span class="org-keyword">auto</span> <span class="org-function-name">getInstance</span><span class="org-rainbow-delimiters-depth-2">()</span> 
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-type">int</span> <span class="org-function-name">main</span><span class="org-rainbow-delimiters-depth-1">(){</span>

  <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\n====== Test 1 ==========="</span> &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-comment-delimiter">// </span><span class="org-comment">Uniform initialization </span>
    <span class="org-type">GenericDBDriver</span>   <span class="org-variable-name">d0</span>;
    <span class="org-type">DriverSQLServer</span>   <span class="org-variable-name">d1</span><span class="org-rainbow-delimiters-depth-3">{</span><span class="org-string">"d1"</span><span class="org-rainbow-delimiters-depth-3">}</span>;
    <span class="org-type">DriverPostgresSQL</span> <span class="org-variable-name">d2</span> = <span class="org-rainbow-delimiters-depth-3">{</span><span class="org-string">"d2"</span><span class="org-rainbow-delimiters-depth-3">}</span>;
    <span class="org-type">DriverSQLServer</span>   <span class="org-variable-name">d3</span> = <span class="org-rainbow-delimiters-depth-3">{</span><span class="org-string">"d3"</span><span class="org-rainbow-delimiters-depth-3">}</span>;

    showDriverStatus1<span class="org-rainbow-delimiters-depth-3">(</span>d0<span class="org-rainbow-delimiters-depth-3">)</span>;
    showDriverStatus1<span class="org-rainbow-delimiters-depth-3">(</span>d1<span class="org-rainbow-delimiters-depth-3">)</span>;
    d1.connect<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"file:///home/user/datbase.sqlite"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    showDriverStatus1<span class="org-rainbow-delimiters-depth-3">(</span>d1<span class="org-rainbow-delimiters-depth-3">)</span>;
    showDriverStatus1<span class="org-rainbow-delimiters-depth-3">(</span>d2<span class="org-rainbow-delimiters-depth-3">)</span>;
    showDriverStatus1<span class="org-rainbow-delimiters-depth-3">(</span>d3<span class="org-rainbow-delimiters-depth-3">)</span>;

    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"====== End of test 1 ==========="</span> &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>

  <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\n====== Test 2 ==========="</span> &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-comment-delimiter">// </span><span class="org-comment">Uniform initialization </span>
    <span class="org-type">GenericDBDriver</span>   <span class="org-variable-name">d0</span>;
    <span class="org-type">DriverSQLServer</span>   <span class="org-variable-name">d1</span><span class="org-rainbow-delimiters-depth-3">{</span><span class="org-string">"d1"</span><span class="org-rainbow-delimiters-depth-3">}</span>;
    <span class="org-type">DriverPostgresSQL</span> <span class="org-variable-name">d2</span> = <span class="org-rainbow-delimiters-depth-3">{</span><span class="org-string">"d2"</span><span class="org-rainbow-delimiters-depth-3">}</span>;
    <span class="org-type">DriverSQLServer</span>   <span class="org-variable-name">d3</span> = <span class="org-rainbow-delimiters-depth-3">{</span><span class="org-string">"d3"</span><span class="org-rainbow-delimiters-depth-3">}</span>;

    showDriverStatus2<span class="org-rainbow-delimiters-depth-3">(</span>&amp;d0<span class="org-rainbow-delimiters-depth-3">)</span>;
    showDriverStatus2<span class="org-rainbow-delimiters-depth-3">(</span>&amp;d1<span class="org-rainbow-delimiters-depth-3">)</span>;
    d1.connect<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"file:///home/user/datbase.sqlite"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    showDriverStatus2<span class="org-rainbow-delimiters-depth-3">(</span>&amp;d1<span class="org-rainbow-delimiters-depth-3">)</span>;
    showDriverStatus2<span class="org-rainbow-delimiters-depth-3">(</span>&amp;d2<span class="org-rainbow-delimiters-depth-3">)</span>;
    showDriverStatus2<span class="org-rainbow-delimiters-depth-3">(</span>&amp;d3<span class="org-rainbow-delimiters-depth-3">)</span>;

    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"====== End of test 2 ==========="</span> &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>

  <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-comment-delimiter">// </span><span class="org-comment">Failure ! -&gt; It only calls the methods of GenericDBDriver</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">It is not possible to polymorphism (subtyping polymorphism) in C++</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">without pointers or references.</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\n====== Test 3 ==========="</span> &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">GenericDBDriver</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-variable-name">xs</span>;

    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>GenericDBDriver<span class="org-rainbow-delimiters-depth-4">{}</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>DriverSQLServer <span class="org-rainbow-delimiters-depth-4">{</span><span class="org-string">"d1"</span><span class="org-rainbow-delimiters-depth-4">}</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>DriverPostgresSQL<span class="org-rainbow-delimiters-depth-4">{</span><span class="org-string">"d2"</span><span class="org-rainbow-delimiters-depth-4">}</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>DriverSQLServer<span class="org-rainbow-delimiters-depth-4">{</span><span class="org-string">"d3"</span><span class="org-rainbow-delimiters-depth-4">}</span><span class="org-rainbow-delimiters-depth-3">)</span>;

    <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: xs<span class="org-rainbow-delimiters-depth-3">){</span>
      <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" - driver = "</span> &lt;&lt; x.driverName<span class="org-rainbow-delimiters-depth-4">()</span> &lt;&lt; <span class="org-string">" ; id = "</span> &lt;&lt; x.getID<span class="org-rainbow-delimiters-depth-4">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-rainbow-delimiters-depth-3">}</span>

    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>0<span class="org-rainbow-delimiters-depth-4">)</span>.driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"generic"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>1<span class="org-rainbow-delimiters-depth-4">)</span>.driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"generic"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>2<span class="org-rainbow-delimiters-depth-4">)</span>.driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"generic"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>3<span class="org-rainbow-delimiters-depth-4">)</span>.driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"generic"</span><span class="org-rainbow-delimiters-depth-3">)</span>;

    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\n====== End of test 3 ==========="</span> &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>


  <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\n====== Test 4 ==========="</span> &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">GenericDBDriver</span>*<span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-variable-name">xs</span>;

    <span class="org-keyword">auto</span> <span class="org-variable-name">d0</span> = GenericDBDriver<span class="org-rainbow-delimiters-depth-3">{}</span>;
    <span class="org-keyword">auto</span> <span class="org-variable-name">d1</span> = DriverSQLiteDriver <span class="org-rainbow-delimiters-depth-3">{</span><span class="org-string">"d1"</span><span class="org-rainbow-delimiters-depth-3">}</span>;
    <span class="org-keyword">auto</span> <span class="org-variable-name">d2</span> = DriverPostgresSQL<span class="org-rainbow-delimiters-depth-3">{</span><span class="org-string">"d2"</span><span class="org-rainbow-delimiters-depth-3">}</span>;
    <span class="org-keyword">auto</span> <span class="org-variable-name">d3</span> = DriverSQLServer<span class="org-rainbow-delimiters-depth-3">{</span><span class="org-string">"d3"</span><span class="org-rainbow-delimiters-depth-3">}</span>;
    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>&amp;d0<span class="org-rainbow-delimiters-depth-3">)</span>;
    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>&amp;d1<span class="org-rainbow-delimiters-depth-3">)</span>;
    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>&amp;d2<span class="org-rainbow-delimiters-depth-3">)</span>;
    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>&amp;d3<span class="org-rainbow-delimiters-depth-3">)</span>;

    <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: xs<span class="org-rainbow-delimiters-depth-3">){</span>
      <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" - driver = "</span> &lt;&lt; x-&gt;driverName<span class="org-rainbow-delimiters-depth-4">()</span> &lt;&lt; <span class="org-string">" ; id = "</span> &lt;&lt; x-&gt;getID<span class="org-rainbow-delimiters-depth-4">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;;
    <span class="org-rainbow-delimiters-depth-3">}</span>
    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>0<span class="org-rainbow-delimiters-depth-4">)</span>-&gt;driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"generic"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>1<span class="org-rainbow-delimiters-depth-4">)</span>-&gt;driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"sqlite"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>2<span class="org-rainbow-delimiters-depth-4">)</span>-&gt;driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"PostGresSQL"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>3<span class="org-rainbow-delimiters-depth-4">)</span>-&gt;driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"SQLServer"</span><span class="org-rainbow-delimiters-depth-3">)</span>;

    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"====== End of test 4 ==========="</span> &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>  

  <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\n====== Test 5 ==========="</span> &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-constant">std</span>::<span class="org-type">shared_ptr</span><span class="org-rainbow-delimiters-depth-4">&lt;</span><span class="org-type">GenericDBDriver</span><span class="org-rainbow-delimiters-depth-4">&gt;</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-variable-name">xs</span>;
    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>dbDriverFactory<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">DriverType</span>::generic<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>dbDriverFactory<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">DriverType</span>::sqlite,    <span class="org-string">"d1"</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>dbDriverFactory<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">DriverType</span>::postgres,  <span class="org-string">"d2"</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    xs.push_back<span class="org-rainbow-delimiters-depth-3">(</span>dbDriverFactory<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">DriverType</span>::sqlserver, <span class="org-string">"d3"</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: xs<span class="org-rainbow-delimiters-depth-3">){</span>
      <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" - driver = "</span> &lt;&lt; x-&gt;driverName<span class="org-rainbow-delimiters-depth-4">()</span> &lt;&lt; <span class="org-string">" ; id = "</span> &lt;&lt; x-&gt;getID<span class="org-rainbow-delimiters-depth-4">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;;
    <span class="org-rainbow-delimiters-depth-3">}</span>
    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>0<span class="org-rainbow-delimiters-depth-4">)</span>-&gt;driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"generic"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>1<span class="org-rainbow-delimiters-depth-4">)</span>-&gt;driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"sqlite"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>2<span class="org-rainbow-delimiters-depth-4">)</span>-&gt;driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"PostGresSQL"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    assert<span class="org-rainbow-delimiters-depth-3">(</span>xs.at<span class="org-rainbow-delimiters-depth-4">(</span>3<span class="org-rainbow-delimiters-depth-4">)</span>-&gt;driverName<span class="org-rainbow-delimiters-depth-4">()</span> == <span class="org-string">"SQLServer"</span><span class="org-rainbow-delimiters-depth-3">)</span>;

    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"====== End of test 5 ==========="</span> &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-2">}</span>  
  <span class="org-keyword">return</span> EXIT_SUCCESS;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Running: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ clang++ polymorphism.cpp -std=c++1z -Wall -Wextra &amp;&amp; ./a.out

====== Test 1 ===========
 [INFO] Driver = generic id = unknown ; status = false
 [INFO] Driver = SQLServer id = d1 ; status = false
Connecting to file:///home/user/datbase.sqlite
 [INFO] Driver = SQLServer id = d1 ; status = true
 [INFO] Driver = PostGresSQL id = d2 ; status = false
 [INFO] Driver = SQLServer id = d3 ; status = false
====== End of test 1 ===========
Disconnecting from SQLServer - id = d3
Disconnecting from generic driver - id = unknown
Disconnecting from PostGresSQL - id = d2
Disconnecting from generic driver - id = unknown
Disconnecting from SQLServer - id = d1
Disconnecting from generic driver - id = unknown
Disconnecting from generic driver - id = unknown

====== Test 2 ===========
 [INFO] Driver = generic id = unknown ; status = false
 [INFO] Driver = SQLServer id = d1 ; status = false
Connecting to file:///home/user/datbase.sqlite
 [INFO] Driver = SQLServer id = d1 ; status = true
 [INFO] Driver = PostGresSQL id = d2 ; status = false
 [INFO] Driver = SQLServer id = d3 ; status = false
====== End of test 2 ===========
Disconnecting from SQLServer - id = d3
Disconnecting from generic driver - id = unknown
Disconnecting from PostGresSQL - id = d2
Disconnecting from generic driver - id = unknown
Disconnecting from SQLServer - id = d1
Disconnecting from generic driver - id = unknown
Disconnecting from generic driver - id = unknown

====== Test 3 ===========
Disconnecting from generic driver - id = unknown
Disconnecting from SQLServer - id = d1
Disconnecting from generic driver - id = unknown
Disconnecting from PostGresSQL - id = d2
Disconnecting from generic driver - id = unknown
Disconnecting from SQLServer - id = d3
Disconnecting from generic driver - id = unknown
 - driver = generic ; id = unknown
 - driver = generic ; id = unknown
 - driver = generic ; id = unknown
 - driver = generic ; id = unknown

====== End of test 3 ===========
Disconnecting from generic driver - id = unknown
Disconnecting from generic driver - id = unknown
Disconnecting from generic driver - id = unknown
Disconnecting from generic driver - id = unknown

====== Test 4 ===========
 - driver = generic ; id = unknown
 - driver = sqlite ; id = d1
 - driver = PostGresSQL ; id = d2
 - driver = SQLServer ; id = d3
====== End of test 4 ===========
Disconnecting from SQLServer - id = d3
Disconnecting from generic driver - id = unknown
Disconnecting from PostGresSQL - id = d2
Disconnecting from generic driver - id = unknown
Disconnecting from PosgresDB - m_id = d1
Disconnecting from generic driver - id = unknown
Disconnecting from generic driver - id = unknown

====== Test 5 ===========
 - driver = generic ; id = unknown
 - driver = sqlite ; id = d1
 - driver = PostGresSQL ; id = d2
 - driver = SQLServer ; id = d3
====== End of test 5 ===========
Disconnecting from generic driver - id = unknown
Disconnecting from PosgresDB - m_id = d1
Disconnecting from generic driver - id = unknown
Disconnecting from PostGresSQL - id = d2
Disconnecting from generic driver - id = unknown
Disconnecting from SQLServer - id = d3
Disconnecting from generic driver - id = unknown

</pre>
</div>
</div>
</div>
