Understanding-CPP.org
*** STL containers and polymorphism 

C++'s STL (Standard Template Library) containers/collections such as
vector, deque, map, stack and so on can only store pointers to
instances of different derived classes from a given base
class. However the STL containers cannot store references to those
instances. The STL std::reference_wrapper solves this problem. 

Documentation: 
  + http://www.cplusplus.com/reference/functional/reference_wrapper/operator_func/

Demonstration in CERN's ROOT C++ REPL: 

 - Create test classes.

#+BEGIN_SRC cpp 
  // Base class 
  class IRoot{
  public:
    virtual auto getName() const -> std::string {
      return "root";
    }
  };

  //===== Derived Classes ====== //
 
  class A: public IRoot{
  public:
    auto getName() const -> std::string {
      return "Class A";
    }
  };

  class B: public IRoot{
  public:
    auto getName() const -> std::string {
      return "Class B";
    }
  };
#+END_SRC

 - Play with sample objects:

#+BEGIN_SRC cpp 
  // Create test objects 
  auto r = IRoot();
  auto a = A();
  auto b = B();

  // Test objects 
  >> r.getName()
  (std::string) "root"
  >> a.getName()
  (std::string) "Class A"
  >> b.getName()
  (std::string) "Class B"
  >>
#+END_SRC

 - Store those objects in a collection by pointer:

#+BEGIN_SRC cpp 
  >> auto xsp = std::deque<IRoot*>()
  (std::deque<IRoot *, std::allocator<IRoot *> > &) {}
  >> xsp.push_back(&r)
  >> xsp.push_back(&a)
  >> xsp.push_back(&b)
  >> xsp
  (std::deque<IRoot *, std::allocator<IRoot *> > &) { @0x2f01990, @0x2f01998, @0x2f019a0 }
  >>
  >>

  >> for(auto x: xsp) { std::cout << "name = " << x->getName() << std::endl; }
  name = root
  name = Class A
  name = Class B
  >>

#+END_SRC

 - Try to store those object r, a and b in a container/collection by
   reference.

#+BEGIN_SRC cpp 
  /** Many of errors: new_allocator.h:63:18: error: 'pointer' declared
   ,* as a pointer to a reference of type 'IRoot &' typedef _Tp* pointer;
   ,*/
  auto xs = std::deque<IRoot&>() 
#+END_SRC

 - Try to store those object r, a and b in a container/collection by
   reference using _std::reference_wrapper_.

#+BEGIN_SRC cpp 
  >> auto xsr = std::deque<std::reference_wrapper<IRoot>> {}
  (std::deque<std::reference_wrapper<IRoot>, std::allocator<std::reference_wrapper<IRoot> > > &) {}
  >>

  xsr.push_back(a)
  xsr.push_back(r)
  xsr.push_back(b)

  >> xsr
  (std::deque<std::reference_wrapper<IRoot>, std::allocator<std::reference_wrapper<IRoot> > > &)
  { @0x31013c0, @0x31013c8, @0x31013d0 }
  >>

  >> xsr.at(0).get().getName()
  (std::string) "Class A"
  >> xsr.at(1).get().getName()
  (std::string) "root"
  >> xsr.at(2).get().getName()
  (std::string) "Class B"
  >> 
  >>

  >> for(auto x: xsr) { std::cout << "name = " << x.get().getName() << std::endl; }
  name = Class A
  name = root
  name = Class B
  >> 

  >> for(const auto& x: xsr) { std::cout << "name = " << x.get().getName() << std::endl; }
  name = Class A
  name = root
  name = Class B
  >> 
#+END_SRC

References: 

 + https://oopscenities.net/2012/08/09/reference_wrapper/

 + How to correctly use std::reference_wrappers -
   <https://stackoverflow.com/questions/18127469/how-to-correctly-use-stdreference-wrappers>
