Understanding-CPP.html


<div id="outline-container-org85110a8" class="outline-4">
<h4 id="org85110a8"><span class="section-number-4">1.11.3</span> STL containers and polymorphism</h4>
<div class="outline-text-4" id="text-1-11-3">
<p>
C++'s STL (Standard Template Library) containers/collections such as
vector, deque, map, stack and so on can only store pointers to
instances of different derived classes from a given base
class. However the STL containers cannot store references to those
instances. The STL std::reference_wrapper solves this problem. 
</p>

<p>
Documentation: 
</p>
<ul class="org-ul">
<li><a href="http://www.cplusplus.com/reference/functional/reference_wrapper/operator_func/">http://www.cplusplus.com/reference/functional/reference_wrapper/operator_func/</a></li>
</ul>

<p>
Demonstration in CERN's ROOT C++ REPL: 
</p>

<ul class="org-ul">
<li>Create test classes.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Base class </span>
<span class="org-keyword">class</span> <span class="org-type">IRoot</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">public</span>:
  <span class="org-keyword">virtual</span> <span class="org-keyword">auto</span> <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> <span class="org-string">"root"</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">//</span><span class="org-comment">===== Derived Classes ====== //</span>

<span class="org-keyword">class</span> <span class="org-type">A</span>: <span class="org-keyword">public</span> <span class="org-type">IRoot</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">public</span>:
  <span class="org-keyword">auto</span> <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> <span class="org-string">"Class A"</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-keyword">class</span> <span class="org-type">B</span>: <span class="org-keyword">public</span> <span class="org-type">IRoot</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">public</span>:
  <span class="org-keyword">auto</span> <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">return</span> <span class="org-string">"Class B"</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<ul class="org-ul">
<li>Play with sample objects:</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Create test objects </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">r</span> = IRoot<span class="org-rainbow-delimiters-depth-1">()</span>;
<span class="org-keyword">auto</span> <span class="org-variable-name">a</span> = A<span class="org-rainbow-delimiters-depth-1">()</span>;
<span class="org-keyword">auto</span> <span class="org-variable-name">b</span> = B<span class="org-rainbow-delimiters-depth-1">()</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Test objects </span>
&gt;&gt; r.getName<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"root"</span>
&gt;&gt; a.getName<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"Class A"</span>
&gt;&gt; b.getName<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"Class B"</span>
&gt;&gt;
</pre>
</div>

<ul class="org-ul">
<li>Store those objects in a collection by pointer:</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; <span class="org-keyword">auto</span> xsp = <span class="org-constant">std</span>::deque<span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">IRoot</span>*<span class="org-rainbow-delimiters-depth-1">&gt;()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">IRoot</span> *, <span class="org-constant">std</span>::<span class="org-type">allocator</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">IRoot</span> *<span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{}</span>
&gt;&gt; xsp.push_back<span class="org-rainbow-delimiters-depth-1">(</span>&amp;r<span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; xsp.push_back<span class="org-rainbow-delimiters-depth-1">(</span>&amp;a<span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; xsp.push_back<span class="org-rainbow-delimiters-depth-1">(</span>&amp;b<span class="org-rainbow-delimiters-depth-1">)</span>
&gt;&gt; xsp
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">IRoot</span> *, <span class="org-constant">std</span>::<span class="org-type">allocator</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">IRoot</span> *<span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> @0x2f01990, @0x2f01998, @0x2f019a0 <span class="org-rainbow-delimiters-depth-1">}</span>
&gt;&gt;
&gt;&gt;

&gt;&gt; <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">auto</span> <span class="org-variable-name">x</span>: xsp<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"name = "</span> &lt;&lt; x-&gt;getName<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-constant">std</span>::endl; <span class="org-rainbow-delimiters-depth-1">}</span>
name = root
name = Class A
name = Class B
&gt;&gt;

</pre>
</div>

<ul class="org-ul">
<li>Try to store those object r, a and b in a container/collection by
reference.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">/** </span><span class="org-comment">Many of errors: new_allocator.h:63:18: error: 'pointer' declared</span>
<span class="org-comment"> * as a pointer to a reference of type 'IRoot &amp;' typedef _Tp* pointer;</span>
<span class="org-comment"> */</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">xs</span> = <span class="org-constant">std</span>::deque<span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">IRoot</span>&amp;<span class="org-rainbow-delimiters-depth-1">&gt;()</span> 
</pre>
</div>

<ul class="org-ul">
<li>Try to store those object r, a and b in a container/collection by
reference using <span class="underline">std::reference_wrapper</span>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; <span class="org-keyword">auto</span> xsr = <span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::<span class="org-type">reference_wrapper</span><span class="org-rainbow-delimiters-depth-2">&lt;</span>IRoot<span class="org-rainbow-delimiters-depth-2">&gt;</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{}</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">std</span>::<span class="org-type">reference_wrapper</span><span class="org-rainbow-delimiters-depth-3">&lt;</span>IRoot<span class="org-rainbow-delimiters-depth-3">&gt;</span>, <span class="org-constant">std</span>::<span class="org-type">allocator</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-constant">std</span>::<span class="org-type">reference_wrapper</span><span class="org-rainbow-delimiters-depth-4">&lt;</span>IRoot<span class="org-rainbow-delimiters-depth-4">&gt;</span> <span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{}</span>
&gt;&gt;

xsr.push_back<span class="org-rainbow-delimiters-depth-1">(</span>a<span class="org-rainbow-delimiters-depth-1">)</span>
xsr.push_back<span class="org-rainbow-delimiters-depth-1">(</span>r<span class="org-rainbow-delimiters-depth-1">)</span>
xsr.push_back<span class="org-rainbow-delimiters-depth-1">(</span>b<span class="org-rainbow-delimiters-depth-1">)</span>

&gt;&gt; xsr
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">std</span>::<span class="org-type">reference_wrapper</span><span class="org-rainbow-delimiters-depth-3">&lt;</span>IRoot<span class="org-rainbow-delimiters-depth-3">&gt;</span>, <span class="org-constant">std</span>::<span class="org-type">allocator</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-constant">std</span>::<span class="org-type">reference_wrapper</span><span class="org-rainbow-delimiters-depth-4">&lt;</span>IRoot<span class="org-rainbow-delimiters-depth-4">&gt;</span> <span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span> @0x31013c0, @0x31013c8, @0x31013d0 <span class="org-rainbow-delimiters-depth-1">}</span>
&gt;&gt;

&gt;&gt; xsr.at<span class="org-rainbow-delimiters-depth-1">(</span>0<span class="org-rainbow-delimiters-depth-1">)</span>.get<span class="org-rainbow-delimiters-depth-1">()</span>.getName<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"Class A"</span>
&gt;&gt; xsr.at<span class="org-rainbow-delimiters-depth-1">(</span>1<span class="org-rainbow-delimiters-depth-1">)</span>.get<span class="org-rainbow-delimiters-depth-1">()</span>.getName<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"root"</span>
&gt;&gt; xsr.at<span class="org-rainbow-delimiters-depth-1">(</span>2<span class="org-rainbow-delimiters-depth-1">)</span>.get<span class="org-rainbow-delimiters-depth-1">()</span>.getName<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"Class B"</span>
&gt;&gt; 
&gt;&gt;

&gt;&gt; <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">auto</span> <span class="org-variable-name">x</span>: xsr<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"name = "</span> &lt;&lt; x.get<span class="org-rainbow-delimiters-depth-2">()</span>.getName<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-constant">std</span>::endl; <span class="org-rainbow-delimiters-depth-1">}</span>
name = Class A
name = root
name = Class B
&gt;&gt; 

&gt;&gt; <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: xsr<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"name = "</span> &lt;&lt; x.get<span class="org-rainbow-delimiters-depth-2">()</span>.getName<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-constant">std</span>::endl; <span class="org-rainbow-delimiters-depth-1">}</span>
name = Class A
name = root
name = Class B
&gt;&gt; 
</pre>
</div>

<p>
References: 
</p>

<ul class="org-ul">
<li><a href="https://oopscenities.net/2012/08/09/reference_wrapper/">https://oopscenities.net/2012/08/09/reference_wrapper/</a></li>

<li>How to correctly use std::reference_wrappers -
<a href="https://stackoverflow.com/questions/18127469/how-to-correctly-use-stdreference-wrappers">https://stackoverflow.com/questions/18127469/how-to-correctly-use-stdreference-wrappers</a></li>
</ul>
</div>
</div>
</div>
