Understanding-CPP.html
<div id="outline-container-org3d0e997" class="outline-3">
<h3 id="org3d0e997"><a id="ID-07dc0b5f-0486-4c18-b356-226ec48d4834"></a><span class="section-number-3">1.12</span> Pointer to Member Function</h3>
<div class="outline-text-3" id="text-1-12">
<p>
In addition to ordinary pointers and function pointers, C++ has member
function pointers which can point to a particular class method and be
used for performing indirect method calls. 
</p>

<p>
Despite member function pointer are much less used than other types of
pointers, they are still useful in lots of use cases such as: 
</p>

<ul class="org-ul">
<li>Implementing callbacks =&gt; Example: QT Slots and Signals.</li>
<li>Creating warappers     =&gt; Example: Boost.Python</li>
<li>Reflection</li>
</ul>

<p>
Pointer Member Function variable declaration : 
</p>

<ul class="org-ul">
<li>It declares a pointer-to-member function of the class
<span class="underline">CLASS_NAME</span>. The pointer variable  is named pVariable and has the
type signature:  <span class="underline">(ARG0, ARG1, &#x2026; ARGN) =&gt; RETURN_TYPE</span></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">RETURN_TYPE <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">CLASS_NAME</span>::* pVariable<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span>ARG0, ARG1, ..., ARGN-1<span class="org-rainbow-delimiters-depth-1">)</span>;
RETURN_TYPE <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">CLASS_NAME</span>::* pVariable<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span>ARG0, ARG1, ..., ARGN-1<span class="org-rainbow-delimiters-depth-1">)</span> = <span class="org-constant">nullptr</span>;
RETURN_TYPE <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">CLASS_NAME</span>::* pVariable<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span>ARG0, ARG1, ..., ARGN-1<span class="org-rainbow-delimiters-depth-1">)</span> = &amp;<span class="org-constant">CLASS_NAME</span>::member_functionA;
RETURN_TYPE <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">CLASS_NAME</span>::* pVariable<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span>ARG0, ARG1, ..., ARGN-1<span class="org-rainbow-delimiters-depth-1">)</span> = &amp;<span class="org-constant">CLASS_NAME</span>::member_functionB;
</pre>
</div>

<ul class="org-ul">
<li>Example: Pointer to any member function taking zero arguments and
returning a string.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::string <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">Dummy</span>::* pMemfn<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">()</span> = <span class="org-constant">nullptr</span>;
</pre>
</div>

<ul class="org-ul">
<li>Invoking a pointer to member function. It is necessary an instance
of the class in order to invoke the member function pointed by the
pointer.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">CLASS_TYPE</span> <span class="org-variable-name">obj</span>;
pVariable = &amp;<span class="org-constant">CLASS_TYPE</span>::member_function1;
<span class="org-rainbow-delimiters-depth-1">(</span>obj.*pVariable<span class="org-rainbow-delimiters-depth-1">)(</span>arg0, arg1, arg2, ... argn<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>


<ul class="org-ul">
<li>Type synonym with Typdef</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">typedef</span> <span class="org-type">RETURN_TYPE</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">CLASS_NAME</span>::* pMemberFunction<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span>ARG0, ARG1, ..., ARGN-1<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-type">pMemberFunction</span> <span class="org-variable-name">pvar</span> = &amp;<span class="org-constant">CLASS_NAME</span>::member_functionA;
<span class="org-type">CLASS_NAME</span> <span class="org-variable-name">obj</span>;
<span class="org-rainbow-delimiters-depth-1">(</span>obj.*pvar<span class="org-rainbow-delimiters-depth-1">)(</span>arg0, arg1, .... argn-1<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>Type synonym with C++11 "using" keyword</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">using</span> <span class="org-type">pMemberFunction</span> = RETURN_TYPE <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">CLASS_NAME</span>::*<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span>ARG0, ARG1, ..., ARGN-1<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-type">pMemberFunction</span> <span class="org-variable-name">pvar</span> = &amp;<span class="org-constant">CLASS_NAME</span>::member_functionA;
<span class="org-type">CLASS_NAME</span> <span class="org-variable-name">obj</span>;
<span class="org-rainbow-delimiters-depth-1">(</span>obj.*pvar<span class="org-rainbow-delimiters-depth-1">)(</span>arg0, arg1, .... argn-1<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
<b>Further Reading:</b>
</p>

<ul class="org-ul">
<li><a href="https://accu.org/index.php/journals/495">ACCU - An Application of Pointers to Members</a></li>
<li><a href="http://soggywizards.com/tips/code/c++/member-pointers.html">Pointers to C++ Member Functions</a></li>
<li><a href="https://yosefk.com/c++fqa/function.html">C++ FQA Lite: Pointers to member functions</a></li>
<li><a href="https://arne-mertz.de/2017/01/decltype-declval/">Modern C++ Features - decltype and std::declval - Simplify C++!</a></li>
<li><a href="https://isocpp.org/wiki/faq/pointers-to-members">Pointers to Member Functions, C++ FAQ</a></li>
<li><a href="https://wiki.qt.io/New_Signal_Slot_Syntax">New Signal Slot Syntax - Qt Wiki</a></li>
<li><a href="https://www.codeguru.com/cpp/cpp/article.php/c17401/C-Tutorial-PointertoMember-Function.htm">C++ Tutorial: Pointer-to-Member Function</a></li>
<li><a href="https://embeddedartistry.com/blog/2017/1/26/c11-improving-your-callback-game">Improving Your Callback Game — Embedded Artistry</a></li>
</ul>


<p>
<b>Example</b>
</p>

<p>
File: 
</p>
<ul class="org-ul">
<li><a href="src/member-function-pointer.cpp">file:src/member-function-pointer.cpp</a></li>
<li>Online compiler: <a href="http://rextester.com/WYFC32509">http://rextester.com/WYFC32509</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">string</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iomanip</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">deque</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">map</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">cassert</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-keyword">class</span> <span class="org-type">Dummy</span> <span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">_name</span> = <span class="org-string">"unnamed"</span>;
<span class="org-function-name">public</span>:
        <span class="org-function-name">Dummy</span><span class="org-rainbow-delimiters-depth-2">(){}</span>
        <span class="org-function-name">Dummy</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">)</span>: <span class="org-function-name">_name</span><span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">){}</span>
        ~<span class="org-function-name">Dummy</span><span class="org-rainbow-delimiters-depth-2">()</span> = <span class="org-keyword">default</span>;
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-keyword">return</span> <span class="org-string">"I am a dummy class named &lt;"</span> + _name + <span class="org-string">"&gt;"</span>;
        <span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-function-name">getLocation</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-keyword">return</span> <span class="org-string">"Unknown location"</span>;
        <span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-keyword">operator</span><span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">(){</span>
                <span class="org-keyword">return</span> <span class="org-string">"I am a function-object called: &lt;"</span> + _name + <span class="org-string">"&gt;"</span>;
        <span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-keyword">auto</span> <span class="org-function-name">compute</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span>, <span class="org-type">double</span> <span class="org-variable-name">y</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">double</span> <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-keyword">return</span> 4 * x + 5 * y;
        <span class="org-rainbow-delimiters-depth-2">}</span>   
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-keyword">class</span> <span class="org-type">DummyB</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">public</span>:
        <span class="org-function-name">DummyB</span><span class="org-rainbow-delimiters-depth-2">(){}</span>
        ~<span class="org-function-name">DummyB</span><span class="org-rainbow-delimiters-depth-2">()</span> = <span class="org-keyword">default</span>;
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-keyword">return</span> <span class="org-string">"My name is DummyB"</span>;
        <span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-function-name">getLocation</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-keyword">return</span> <span class="org-string">"Location of dummyB location"</span>;
        <span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-keyword">operator</span><span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">(){</span>
                <span class="org-keyword">return</span> <span class="org-string">"I am the class DummyB"</span>;
        <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Create type synonym to any member function of Dummy class</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">which takes no parameter and returns a string.</span>
<span class="org-keyword">typedef</span> <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">Dummy</span>::* pDummyMemFnStr<span class="org-rainbow-delimiters-depth-1">)()</span>;

<span class="org-type">void</span> <span class="org-function-name">invokeMemberFun</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">Dummy</span>&amp; <span class="org-variable-name">obj</span>, <span class="org-type">pDummyMemFnStr</span> <span class="org-variable-name">pMemfn</span><span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [1] Method invocation returned value: "</span> &lt;&lt; <span class="org-rainbow-delimiters-depth-2">(</span>obj.*pMemfn<span class="org-rainbow-delimiters-depth-2">)()</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Create type synonum with the new "using" C++11 syntax</span>
<span class="org-keyword">using</span> <span class="org-type">pDummyMemFnStrCPP11</span> = <span class="org-constant">std</span>::string <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">Dummy</span>::*<span class="org-rainbow-delimiters-depth-1">)()</span>;

<span class="org-keyword">auto</span> <span class="org-function-name">invokeMemberFun2</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">Dummy</span>&amp; <span class="org-variable-name">obj</span>, <span class="org-type">pDummyMemFnStrCPP11</span> <span class="org-variable-name">pMemfn</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [2] Method invocation returned value: "</span> &lt;&lt; <span class="org-rainbow-delimiters-depth-2">(</span>obj.*pMemfn<span class="org-rainbow-delimiters-depth-2">)()</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">auto</span> <span class="org-function-name">invokeMemberFun3</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">T</span>&amp; <span class="org-variable-name">obj</span>, <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">T</span>::* <span class="org-function-name">pMemfn</span><span class="org-rainbow-delimiters-depth-2">)()</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">void</span><span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [3] Method invocation returned value: "</span> &lt;&lt; <span class="org-rainbow-delimiters-depth-2">(</span>obj.*pMemfn<span class="org-rainbow-delimiters-depth-2">)()</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T</span>, <span class="org-keyword">class</span> <span class="org-type">R</span>, <span class="org-keyword">class</span> ... <span class="org-type">Args</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">auto</span> <span class="org-function-name">invokeMemfn</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">R</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">T</span>::* <span class="org-function-name">pMemfn</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">Args</span> ... <span class="org-variable-name">args</span><span class="org-rainbow-delimiters-depth-2">)</span>, <span class="org-type">T</span>&amp; <span class="org-variable-name">obj</span>, <span class="org-type">Args</span> ... <span class="org-variable-name">arglist</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">R</span><span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">return</span> <span class="org-rainbow-delimiters-depth-2">(</span>obj.*pMemfn<span class="org-rainbow-delimiters-depth-2">)(</span>arglist ...<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-type">int</span> <span class="org-function-name">main</span><span class="org-rainbow-delimiters-depth-1">(){</span>
        <span class="org-keyword">const</span> <span class="org-keyword">auto</span> nl = <span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-keyword">const</span> <span class="org-keyword">auto</span> nl2 = <span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n\n"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">line</span> = <span class="org-string">"--------------------------------------------------\n"</span>;

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"=== Experiment 1 ==============="</span> &lt;&lt; nl2;
        <span class="org-constant">std</span>::cout &lt;&lt; line;
        <span class="org-comment-delimiter">// </span><span class="org-comment">Pointer to member function to any member functions</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">(aka method) which takes no argument and returns a string</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">of signature: () =&gt; std::string</span>
        <span class="org-comment-delimiter">//</span><span class="org-comment">.....................................................</span>
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">Dummy</span>::* <span class="org-variable-name">pMemfn</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">()</span> = <span class="org-constant">nullptr</span>;
        <span class="org-comment-delimiter">// </span><span class="org-comment">std::string (Dummy::* pMemfn) ();</span>
        <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>pMemfn == <span class="org-constant">nullptr</span><span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-constant">std</span>::cerr &lt;&lt; <span class="org-string">" [INFO] Pointer not initilialized yet."</span> &lt;&lt; nl;

        <span class="org-type">Dummy</span> <span class="org-variable-name">d</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"DUMMY"</span><span class="org-rainbow-delimiters-depth-2">)</span>;

        <span class="org-comment-delimiter">// </span><span class="org-comment">Set the function pointer to member function getName().</span>
        pMemfn = &amp;<span class="org-constant">Dummy</span>::getName;
        <span class="org-comment-delimiter">// </span><span class="org-comment">Invoke pointer to member function (aka pointer to method)</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Name     = "</span> &lt;&lt; <span class="org-rainbow-delimiters-depth-2">(</span>d.*pMemfn<span class="org-rainbow-delimiters-depth-2">)()</span> &lt;&lt; nl2;
        assert<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>d.*pMemfn<span class="org-rainbow-delimiters-depth-3">)()</span> == <span class="org-string">"I am a dummy class named &lt;DUMMY&gt;"</span><span class="org-rainbow-delimiters-depth-2">)</span>;

        <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>pMemfn != <span class="org-constant">nullptr</span><span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-constant">std</span>::cerr &lt;&lt; <span class="org-string">" [INFO] Pointer initilialized OK."</span> &lt;&lt; nl;

        <span class="org-comment-delimiter">// </span><span class="org-comment">Set pointer to Dummy::getLocation</span>
        pMemfn = &amp;<span class="org-constant">Dummy</span>::getLocation;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Location = "</span> &lt;&lt; <span class="org-rainbow-delimiters-depth-2">(</span>d.*pMemfn<span class="org-rainbow-delimiters-depth-2">)()</span> &lt;&lt; nl;
        <span class="org-comment-delimiter">// </span><span class="org-comment">assert((d.*pMemfn)() == "I am a dummy class named &lt;DUMMY&gt;"); </span>


        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"=== Experiment 2 - Using typedef ==============="</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; line;
        <span class="org-type">pDummyMemFnStr</span> <span class="org-variable-name">pMemfn2</span> = <span class="org-constant">nullptr</span>;
        pMemfn2 = &amp;<span class="org-constant">Dummy</span>::getName;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"d.getName() == "</span> &lt;&lt; <span class="org-rainbow-delimiters-depth-2">(</span>d.*pMemfn2<span class="org-rainbow-delimiters-depth-2">)()</span> &lt;&lt; nl;
        assert<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>d.*pMemfn2<span class="org-rainbow-delimiters-depth-3">)()</span> == <span class="org-string">"I am a dummy class named &lt;DUMMY&gt;"</span><span class="org-rainbow-delimiters-depth-2">)</span>;   

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"=== Experiment 3 - Invoking member function with free function ="</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; line;
        <span class="org-comment-delimiter">// </span><span class="org-comment">execute d.getName() </span>
        invokeMemberFun<span class="org-rainbow-delimiters-depth-2">(</span>d, &amp;<span class="org-constant">Dummy</span>::getName<span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-comment-delimiter">// </span><span class="org-comment">execute d.getLocation() </span>
        invokeMemberFun<span class="org-rainbow-delimiters-depth-2">(</span>d, &amp;<span class="org-constant">Dummy</span>::getLocation<span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-comment-delimiter">// </span><span class="org-comment">execute d() </span>
        invokeMemberFun<span class="org-rainbow-delimiters-depth-2">(</span>d, &amp;<span class="org-constant">Dummy</span>::<span class="org-keyword">operator</span><span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">)</span>;

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"=== Experiment 4 - Invoking member function with free function C++11"</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; line;
        invokeMemberFun2<span class="org-rainbow-delimiters-depth-2">(</span>d, &amp;<span class="org-constant">Dummy</span>::getName<span class="org-rainbow-delimiters-depth-2">)</span>;
        invokeMemberFun2<span class="org-rainbow-delimiters-depth-2">(</span>d, &amp;<span class="org-constant">Dummy</span>::getLocation<span class="org-rainbow-delimiters-depth-2">)</span>;
        invokeMemberFun2<span class="org-rainbow-delimiters-depth-2">(</span>d, &amp;<span class="org-constant">Dummy</span>::<span class="org-keyword">operator</span><span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">)</span>;

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"=== Experiment 5 - Pointer to member functions in STL deque collection"</span> &lt;&lt; nl;
        <span class="org-keyword">auto</span> <span class="org-variable-name">plist</span> = <span class="org-constant">std</span>::deque<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">pDummyMemFnStrCPP11</span><span class="org-rainbow-delimiters-depth-2">&gt;()</span>;
        plist.push_back<span class="org-rainbow-delimiters-depth-2">(</span>&amp;<span class="org-constant">Dummy</span>::getName<span class="org-rainbow-delimiters-depth-2">)</span>;
        plist.push_back<span class="org-rainbow-delimiters-depth-2">(</span>&amp;<span class="org-constant">Dummy</span>::getLocation<span class="org-rainbow-delimiters-depth-2">)</span>;
        plist.push_back<span class="org-rainbow-delimiters-depth-2">(</span>&amp;<span class="org-constant">Dummy</span>::<span class="org-keyword">operator</span><span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">p</span>: plist<span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" (+) Calll returned = "</span> &lt;&lt; <span class="org-rainbow-delimiters-depth-2">(</span>d.*p<span class="org-rainbow-delimiters-depth-2">)()</span> &lt;&lt; nl;

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"=== Experiment 6 - Pointer to member functions in map collection"</span> &lt;&lt; nl;
        <span class="org-keyword">auto</span> <span class="org-variable-name">dict</span> = <span class="org-constant">std</span>::map<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">std</span>::<span class="org-type">string</span>, <span class="org-type">pDummyMemFnStrCPP11</span><span class="org-rainbow-delimiters-depth-2">&gt;()</span>;
        dict<span class="org-rainbow-delimiters-depth-2">[</span><span class="org-string">"getName"</span><span class="org-rainbow-delimiters-depth-2">]</span>     = &amp;<span class="org-constant">Dummy</span>::getName;
        dict<span class="org-rainbow-delimiters-depth-2">[</span><span class="org-string">"getLocation"</span><span class="org-rainbow-delimiters-depth-2">]</span> = &amp;<span class="org-constant">Dummy</span>::getLocation;
        dict<span class="org-rainbow-delimiters-depth-2">[</span><span class="org-string">"callme"</span><span class="org-rainbow-delimiters-depth-2">]</span>      = &amp;<span class="org-constant">Dummy</span>::<span class="org-keyword">operator</span><span class="org-rainbow-delimiters-depth-2">()</span>;
        <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">kv</span>: dict<span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::right &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>20<span class="org-rainbow-delimiters-depth-2">)</span>  &lt;&lt; <span class="org-string">"invoke(object, "</span>
                                  &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>15<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; kv.first &lt;&lt; <span class="org-string">")"</span>
                                  &lt;&lt; <span class="org-string">" = "</span> &lt;&lt; <span class="org-rainbow-delimiters-depth-2">(</span>d.*<span class="org-rainbow-delimiters-depth-3">(</span>kv.second<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)()</span> &lt;&lt; nl;

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"=== Experiment 7 - Template "</span> &lt;&lt; nl;
        <span class="org-type">DummyB</span> <span class="org-variable-name">b</span>;
        invokeMemberFun3<span class="org-rainbow-delimiters-depth-2">(</span>d, &amp;<span class="org-constant">Dummy</span>::getName<span class="org-rainbow-delimiters-depth-2">)</span>;
        invokeMemberFun3<span class="org-rainbow-delimiters-depth-2">(</span>b, &amp;<span class="org-constant">DummyB</span>::getName<span class="org-rainbow-delimiters-depth-2">)</span>;
        invokeMemberFun3<span class="org-rainbow-delimiters-depth-2">(</span>d, &amp;<span class="org-constant">Dummy</span>::getLocation<span class="org-rainbow-delimiters-depth-2">)</span>;
        invokeMemberFun3<span class="org-rainbow-delimiters-depth-2">(</span>b, &amp;<span class="org-constant">DummyB</span>::getLocation<span class="org-rainbow-delimiters-depth-2">)</span>;

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"=== Experiment 8 - Template "</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; line;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"d.getName()         = "</span> &lt;&lt; invokeMemfn<span class="org-rainbow-delimiters-depth-2">(</span>&amp;<span class="org-constant">Dummy</span>::getName, d<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"d.compute(3.0, 4.0) = "</span> &lt;&lt; invokeMemfn<span class="org-rainbow-delimiters-depth-2">(</span>&amp;<span class="org-constant">Dummy</span>::compute, d, 3.0, 4.0<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; nl;

        <span class="org-keyword">return</span> 0;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Running: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ clang++ member-function-pointer.cpp -o <span class="org-keyword">member-function-pointer.bin</span> -std=c++1z -Wall -Wextra  &amp;&amp; ./member-function-pointer.bin

=== Experiment 1 ===============

--------------------------------------------------
 [INFO] Pointer not initilialized yet.
Name     = I am a dummy class named &lt;DUMMY&gt;

 [INFO] Pointer initilialized OK.
Location = Unknown location

=== Experiment 2 - Using typedef ===============
--------------------------------------------------
<span class="org-function-name">d.getName</span>() == I am a dummy class named &lt;DUMMY&gt;

=== Experiment 3 - Invoking member <span class="org-keyword">function</span> <span class="org-function-name">with</span> free <span class="org-keyword">function</span> =
--------------------------------------------------
 [1] Method invocation returned value: I am a dummy class named &lt;DUMMY&gt;
 [1] Method invocation returned value: Unknown location
 [1] Method invocation returned value: I am a function-object called: &lt;DUMMY&gt;

=== Experiment 4 - Invoking member <span class="org-keyword">function</span> <span class="org-function-name">with</span> free <span class="org-keyword">function</span> <span class="org-function-name">C</span>++11
--------------------------------------------------
 [2] Method invocation returned value: I am a dummy class named &lt;DUMMY&gt;
 [2] Method invocation returned value: Unknown location
 [2] Method invocation returned value: I am a function-object called: &lt;DUMMY&gt;

=== Experiment 5 - Pointer to member functions<span class="org-keyword"> in</span> STL deque collection
 (+) Calll returned = I am a dummy class named &lt;DUMMY&gt;
 (+) Calll returned = Unknown location
 (+) Calll returned = I am a function-object called: &lt;DUMMY&gt;

=== Experiment 6 - Pointer to member functions<span class="org-keyword"> in</span> map collection
     invoke(object,          callme) = I am a function-object called: &lt;DUMMY&gt;
     invoke(object,     getLocation) = Unknown location
     invoke(object,         getName) = I am a dummy class named &lt;DUMMY&gt;

=== Experiment 7 - Template 
 [3] Method invocation returned value: I am a dummy class named &lt;DUMMY&gt;
 [3] Method invocation returned value: My name is DummyB
 [3] Method invocation returned value: Unknown location
 [3] Method invocation returned value: Location of dummyB location

=== Experiment 8 - Template 
--------------------------------------------------
<span class="org-function-name">d.getName</span>()         = I am a dummy class named &lt;DUMMY&gt;
<span class="org-function-name">d.compute</span>(3.0, 4.0) = 32

</pre>
</div>
</div>
</div>
