Understanding-CPP.org
** Template Metaprogramming or Generic Programming 
*** Overview 

 *C++ Metaprogramming Features:*

 + _Templates_
   + Use case:
     + Template metaprogramming or generic programming
     + Generic classes and containers
     + Generic algorithms
     + Compile-time optmization
     + Write high performance code by eliminating virtual member
       function calls.
   + Limitation: Unfortunately, the C++ templates cannot manipulate
     the AST and generate code in the way that LISP-like languages
     do. 

 + C++11 _Constexpr_
   + Use cases:
     + Compile-time computations such as look up tables, math
       constants, CRC32, hash, string encryption and obfuscation at
       compile-time and so on.

 + _Inline functions_
   + Use cases:
     + Removing function-calls. The function code is inserted at the
       call-site by the compiler allowing a more efficient and
       perfomant code.

 + _Pre-processor macros_
   + Use-cases:
     + Debugging, print line number, file, current function, function
       signature and so on. 
     + Conditional compilation
     + Conditional compilation for cross platform compatibility
     + Boilerplate code generation which cannot be done with templates
       or anything else.
     + Generation of reflection data. 

 *Generic Programming / Template Metaprogramming Design Patterns:*

 + _Generic Functions, algorithms and containers_
   + Some known use cases:
     + C++ STL introduced by Alexander Stepanov.
     + Boost Libraries
 + _CRTP => Curious Recurring Template Pattern_
   + Eliminates virtual function-calls overhead by emulating
     inheritance or dynamic polymorphism with static polymorphism or
     template metaprogramming.
 + _Type Erasure_ 
   + Despite the high performance and the ability to operate ony type
     regardless of the class hierarchy, the main shortcoming of
     generic programming is that, it is not possible to store
     unrelated types in the same containers or access them by the same
     pointer. The type erasure technique address those downsides by
     combining generic programmign and generic programming.
   + Known uses:
     + std::function (C++11)
     + std::any (C++17), Boost.any, std::variant (C++17) and Boost.variant
 + _EP => Expression Template_ => Technique used by many scientific
   library for encoding DSL - Domain Specific Languages with
   templates.
   + Some known uses of this design pattern are:
     + Linear Algebra: librareis Blitz++, Eigen and Armadillo
     + Automatic Differentiation.
 + _Meta Functions_ => "Functions" emualted with structs and static
   methods or members that can manipulate types or query information
   about types using template specialisation.
 + _Policy Based Design_
 + _SFINAE_

 *Libraries and Frameworks for metaprogramming:*

 + [[https://www.boost.org/doc/libs/1_61_0/libs/hana/doc/html/index.html][Boost.Hana]]  
 + [[https://www.boost.org/doc/libs/1_68_0/libs/fusion/doc/html/fusion/preface.html][Boost.Fusion]] 
 + [[https://www.boost.org/doc/libs/1_68_0/libs/mpl/doc/index.html][Boost.MPL]] 

 *Tool for testing templates online* 

 + [[http://metashell.org/index.html][Home - Metashell]] - "The goal of this project is to provide an
   interactive template metaprogramming shell." 


 *Template Metaprogramming Reference* 

 - Andrei Alexandrescu's *Loki Library* (http://loki-lib.sourceforge.net/)
   + type list
   + functor
   + singleton
   + object factory
   + visitor
   + multi methods
   + pimpl - pointer to implementation.

