Understanding-CPP.html
<div id="outline-container-org3703f5a" class="outline-3">
<h3 id="org3703f5a"><span class="section-number-3">1.13</span> Template Metaprogramming or Generic Programming</h3>
<div class="outline-text-3" id="text-1-13">
</div>
<div id="outline-container-org0591170" class="outline-4">
<h4 id="org0591170"><span class="section-number-4">1.13.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-13-1">
<p>
<b>C++ Metaprogramming Features:</b>
</p>

<ul class="org-ul">
<li><span class="underline">Templates</span>
<ul class="org-ul">
<li>Use case:
<ul class="org-ul">
<li>Template metaprogramming or generic programming</li>
<li>Generic classes and containers</li>
<li>Generic algorithms</li>
<li>Compile-time optmization</li>
<li>Write high performance code by eliminating virtual member
function calls.</li>
</ul></li>
<li>Limitation: Unfortunately, the C++ templates cannot manipulate
the AST and generate code in the way that LISP-like languages
do.</li>
</ul></li>

<li>C++11 <span class="underline">Constexpr</span>
<ul class="org-ul">
<li>Use cases:
<ul class="org-ul">
<li>Compile-time computations such as look up tables, math
constants, CRC32, hash, string encryption and obfuscation at
compile-time and so on.</li>
</ul></li>
</ul></li>

<li><span class="underline">Inline functions</span>
<ul class="org-ul">
<li>Use cases:
<ul class="org-ul">
<li>Removing function-calls. The function code is inserted at the
call-site by the compiler allowing a more efficient and
perfomant code.</li>
</ul></li>
</ul></li>

<li><span class="underline">Pre-processor macros</span>
<ul class="org-ul">
<li>Use-cases:
<ul class="org-ul">
<li>Debugging, print line number, file, current function, function
signature and so on.</li>
<li>Conditional compilation</li>
<li>Conditional compilation for cross platform compatibility</li>
<li>Boilerplate code generation which cannot be done with templates
or anything else.</li>
<li>Generation of reflection data.</li>
</ul></li>
</ul></li>
</ul>

<p>
<b>Generic Programming / Template Metaprogramming Design Patterns:</b>
</p>

<ul class="org-ul">
<li><span class="underline">Generic Functions, algorithms and containers</span>
<ul class="org-ul">
<li>Some known use cases:
<ul class="org-ul">
<li>C++ STL introduced by Alexander Stepanov.</li>
<li>Boost Libraries</li>
</ul></li>
</ul></li>
<li><span class="underline">CRTP =&gt; Curious Recurring Template Pattern</span>
<ul class="org-ul">
<li>Eliminates virtual function-calls overhead by emulating
inheritance or dynamic polymorphism with static polymorphism or
template metaprogramming.</li>
</ul></li>
<li><span class="underline">Type Erasure</span> 
<ul class="org-ul">
<li>Despite the high performance and the ability to operate ony type
regardless of the class hierarchy, the main shortcoming of
generic programming is that, it is not possible to store
unrelated types in the same containers or access them by the same
pointer. The type erasure technique address those downsides by
combining generic programmign and generic programming.</li>
<li>Known uses:
<ul class="org-ul">
<li>std::function (C++11)</li>
<li>std::any (C++17), Boost.any, std::variant (C++17) and Boost.variant</li>
</ul></li>
</ul></li>
<li><span class="underline">EP =&gt; Expression Template</span> =&gt; Technique used by many scientific
library for encoding DSL - Domain Specific Languages with
templates.
<ul class="org-ul">
<li>Some known uses of this design pattern are:
<ul class="org-ul">
<li>Linear Algebra: librareis Blitz++, Eigen and Armadillo</li>
<li>Automatic Differentiation.</li>
</ul></li>
</ul></li>
<li><span class="underline">Meta Functions</span> =&gt; "Functions" emualted with structs and static
methods or members that can manipulate types or query information
about types using template specialisation.</li>
<li><span class="underline">Policy Based Design</span></li>
<li><span class="underline">SFINAE</span></li>
</ul>

<p>
<b>Libraries and Frameworks for metaprogramming:</b>
</p>

<ul class="org-ul">
<li><a href="https://www.boost.org/doc/libs/1_61_0/libs/hana/doc/html/index.html">Boost.Hana</a></li>
<li><a href="https://www.boost.org/doc/libs/1_68_0/libs/fusion/doc/html/fusion/preface.html">Boost.Fusion</a></li>
<li><a href="https://www.boost.org/doc/libs/1_68_0/libs/mpl/doc/index.html">Boost.MPL</a></li>
</ul>

<p>
<b>Tool for testing templates online</b> 
</p>

<ul class="org-ul">
<li><a href="http://metashell.org/index.html">Home - Metashell</a> - "The goal of this project is to provide an
interactive template metaprogramming shell."</li>
</ul>


<p>
<b>Template Metaprogramming Reference</b> 
</p>

<ul class="org-ul">
<li>Andrei Alexandrescu's <b>Loki Library</b> (<a href="http://loki-lib.sourceforge.net/">http://loki-lib.sourceforge.net/</a>)
<ul class="org-ul">
<li>type list</li>
<li>functor</li>
<li>singleton</li>
<li>object factory</li>
<li>visitor</li>
<li>multi methods</li>
<li>pimpl - pointer to implementation.</li>
</ul></li>
</ul>
</div>
</div>
