Understanding-CPP.html

<div id="outline-container-orgd8f2a43" class="outline-4">
<h4 id="orgd8f2a43"><span class="section-number-4">1.13.2</span> Template type-safe duck-typing or structural typing</h4>
<div class="outline-text-4" id="text-1-13-2">
<p>
In dynamically programming languages like Python, Ruby and etc, a
function or method can accept any object implementing the methods
referred in the function body regardless of the object base or
interface. For instance, in the code below the function describeArea
will work with any class implementing the methods .area() and .name()
not matter the object's base class. 
</p>

<p>
This ability to work with any object which has that requested types,
in this case .area() and .name() is called <span class="underline">duck-typying</span>. Other
languages with duck-typing ability are Smalltalk, Groovy, C#, Scala
and Objective-C. The advantage of duck-typing is that function or
methods can work with classes without an inheritance hierarchy or a
common base class.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">describeArea</span>(shape):
    <span class="org-keyword">print</span>(<span class="org-string">"Shape is      = "</span> + shape.name())
    <span class="org-keyword">print</span>(<span class="org-string">"Shape area is = "</span> + <span class="org-builtin">str</span>(shape.area()))

<span class="org-keyword">class</span> <span class="org-type">Square</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, side):
        <span class="org-keyword">self</span>.side = side 
    <span class="org-keyword">def</span> <span class="org-function-name">area</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>.side * <span class="org-keyword">self</span>.side
    <span class="org-keyword">def</span> <span class="org-function-name">name</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">return</span> <span class="org-string">"square"</span>

<span class="org-keyword">class</span> <span class="org-type">Circle</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, radius):
        <span class="org-keyword">self</span>.radius = radius
    <span class="org-keyword">def</span> <span class="org-function-name">area</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>.radius * <span class="org-keyword">self</span>.radius  * 3.1415
    <span class="org-keyword">def</span> <span class="org-function-name">name</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">return</span> <span class="org-string">"circle"</span>    
</pre>
</div>

<p>
Running: 
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span class="org-variable-name">s</span> = Square(10)
&gt;&gt;&gt; <span class="org-variable-name">c</span> = Circle(3)
&gt;&gt;&gt;

&gt;&gt;&gt; describeArea(s)
Shape <span class="org-keyword">is</span>      = square
Shape area <span class="org-keyword">is</span> = 100
&gt;&gt;&gt; 
&gt;&gt;&gt; describeArea(c)
Shape <span class="org-keyword">is</span>      = circle
Shape area <span class="org-keyword">is</span> = 28.273500000000002
&gt;&gt;&gt; 
&gt;&gt;&gt; 
</pre>
</div>


<p>
<b>C++ "Duck-typing" or type-safe structural typing</b>
</p>

<p>
C++ templates feature supports a more type-safe duck-typing as the
feature allows to write functions or methods which works with any
object implementing the methods requested in the template code
regardless of passed types have a common class hierarchy or a base
class. However, unlike Python or Scala's duck typing, C++'s template
doesn't have performance penalty due to dynamic polymorphism or
reflection as it generates code at compile-time for each parameter
type. 
</p>

<p>
The C++'s template duck-typing is also called static polymorphism as a
contrast to dynamic polymorphism which requires that all objects
passed to a function or method implement the same base class.
</p>

<p>
Example: The function describeArea works with any object implementing
the methods area() and name(), however unlike Python and other
dynamically typed languages, if an object that doesn't implement none
of those mentioned methods is passed as argument, a compile error will
be generated rather than a runtime error. 
</p>

<p>
The advantage of C++ template is that it eliminates the runtime
overhead of dynamic polymorphism or virtual function calls, therefore
makes the code more performant and loosely coupled as it can work with
any class without any inheritance hierarchy.  
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Works with any type T which implements .name() or .area()</span>
<span class="org-keyword">template</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-type">void</span> <span class="org-function-name">describeArea</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">T</span>&amp; <span class="org-variable-name">obj</span><span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Shape is = "</span> &lt;&lt; obj.name<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Area is  = "</span> &lt;&lt; obj.area<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"---------"</span> &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-keyword">class</span> <span class="org-type">Circle</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:
        <span class="org-type">double</span> <span class="org-variable-name">m_radius</span>;
<span class="org-function-name">public</span>:
        <span class="org-function-name">Circle</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">radius</span><span class="org-rainbow-delimiters-depth-2">)</span>: <span class="org-function-name">m_radius</span><span class="org-rainbow-delimiters-depth-2">(</span>radius<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{}</span>;
        <span class="org-type">double</span> <span class="org-function-name">area</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-keyword">return</span> 3.1415 * m_radius * m_radius;
        <span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">name</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-keyword">return</span> <span class="org-string">"circle"</span>;
        <span class="org-rainbow-delimiters-depth-2">}</span>   
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-keyword">class</span> <span class="org-type">Square</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:
        <span class="org-type">double</span> <span class="org-variable-name">m_side</span>;
<span class="org-function-name">public</span>:
        <span class="org-function-name">Square</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">side</span><span class="org-rainbow-delimiters-depth-2">)</span>: <span class="org-function-name">m_side</span><span class="org-rainbow-delimiters-depth-2">(</span>side<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{}</span>;
        <span class="org-type">double</span> <span class="org-function-name">area</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-keyword">return</span> m_side * m_side;
        <span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">name</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-keyword">return</span> <span class="org-string">"square"</span>;
        <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-type">int</span> <span class="org-function-name">main</span><span class="org-rainbow-delimiters-depth-1">(){</span>
        <span class="org-type">Square</span> <span class="org-variable-name">s</span><span class="org-rainbow-delimiters-depth-2">(</span>4.0<span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-type">Circle</span> <span class="org-variable-name">c</span><span class="org-rainbow-delimiters-depth-2">(</span>3.0<span class="org-rainbow-delimiters-depth-2">)</span>;
        describeArea<span class="org-rainbow-delimiters-depth-2">(</span>s<span class="org-rainbow-delimiters-depth-2">)</span>;
        describeArea<span class="org-rainbow-delimiters-depth-2">(</span>c<span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-keyword">return</span> 0;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Running: 
</p>

<ul class="org-ul">
<li>The template generates multiple versions of the function
describeArea specific for each type, for instance, it generates,
describeArea(const Circle&amp;) and describeArea(const Square&amp;). The
static polymorphism is a high performance alternative to the use of
dynamic polymorphism, inheritance, and virtual methods since the
methods that will be called are resolved at compile-time.</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">$ clang++ -std=c++11 templateDuckTyping.cpp -o <span class="org-keyword">out.bin</span> &amp;&amp; ./out.bin
Shape is = square
Area is  = 16
---------
Shape is = circle
Area is  = 28.2735
---------
</pre>
</div>

<p>
Summary: 
</p>

<ul class="org-ul">
<li>C++ Templates works in similar fashion to dynamically typed
languages' duck typing.</li>

<li>Templates can make the code more loosely coupled as they works with
any class or type implementing the requested methods.</li>

<li>Templates have zero cost and follows the C++ motto, "don't pay for
what you don't use" they only generate code when requested or
instantiated.</li>

<li>Templates are widely used in the STL (Standard Template Library)
and the Boost Library.</li>
</ul>
</div>
</div>
