Understanding-CPP.html
<div id="outline-container-org5fa9e80" class="outline-4">
<h4 id="org5fa9e80"><span class="section-number-4">1.13.3</span> Templates and C++ iterators</h4>
<div class="outline-text-4" id="text-1-13-3">
<p>
Templates can be used for writing more generic and resuable code which
operates like functions or STL algorithms on  any type of iterator or
container. 
</p>

<p>
This example shows how to implement generic code which operates on any
type of container or iterator in modern C++.
</p>

<ul class="org-ul">
<li>File: <a href="src/template-iterator-container.cpp">file:src/template-iterator-container.cpp</a></li>
</ul>

<p>
Code highlights:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">namespace</span> <span class="org-constant">IterUtils</span><span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-keyword">class</span> <span class="org-type">Iterator</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>
        <span class="org-type">double</span> <span class="org-function-name">sumContainer</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">Iterator</span>&amp; <span class="org-variable-name">begin</span>, <span class="org-keyword">const</span> <span class="org-type">Iterator</span>&amp; <span class="org-variable-name">end</span><span class="org-rainbow-delimiters-depth-2">){</span>
                <span class="org-type">double</span> <span class="org-variable-name">sum</span> = 0.0;
                <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-type">Iterator</span> <span class="org-variable-name">it</span> = begin; it != end; ++it<span class="org-rainbow-delimiters-depth-3">)</span>
                        sum += *it;
                <span class="org-keyword">return</span> sum;
        <span class="org-rainbow-delimiters-depth-2">}</span>

        <span class="org-comment-delimiter">// </span><span class="org-comment">Sum elements of any type &lt;Container&gt; with methods .begin() and .end()</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">returnign iterators.</span>
        <span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-keyword">class</span> <span class="org-type">U</span>, <span class="org-keyword">class</span> <span class="org-type">Container</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>
        <span class="org-keyword">auto</span> <span class="org-function-name">sumContainer2</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">Container</span>&amp; <span class="org-variable-name">container</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">U</span><span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-type">U</span> <span class="org-variable-name">sum</span><span class="org-rainbow-delimiters-depth-3">{}</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Uniform initialization</span>
                <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">auto</span> <span class="org-variable-name">it</span> = container.begin<span class="org-rainbow-delimiters-depth-4">()</span>; it != container.end<span class="org-rainbow-delimiters-depth-4">()</span>; ++it<span class="org-rainbow-delimiters-depth-3">)</span>
                        sum += *it;
                <span class="org-keyword">return</span> sum;
        <span class="org-rainbow-delimiters-depth-2">}</span>

        <span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-keyword">class</span> <span class="org-type">Iterator</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>
        <span class="org-keyword">auto</span> <span class="org-function-name">printContainer</span><span class="org-rainbow-delimiters-depth-2">(</span>
                <span class="org-keyword">const</span> <span class="org-type">Iterator</span>&amp; <span class="org-variable-name">begin</span>,
                <span class="org-keyword">const</span> <span class="org-type">Iterator</span>&amp; <span class="org-variable-name">end</span>,
                <span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">sep</span> = <span class="org-string">", "</span> <span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">void</span>
        <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-type">Iterator</span> <span class="org-variable-name">it</span> = begin; it != end; ++it<span class="org-rainbow-delimiters-depth-3">)</span>
                        <span class="org-constant">std</span>::cout &lt;&lt;  *it &lt;&lt; sep;
        <span class="org-rainbow-delimiters-depth-2">}</span>

        <span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-keyword">class</span> <span class="org-type">Container</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>
        <span class="org-keyword">auto</span> <span class="org-function-name">printContainer2</span><span class="org-rainbow-delimiters-depth-2">(</span>
                  <span class="org-keyword">const</span> <span class="org-type">Container</span>&amp; <span class="org-variable-name">cont</span>
                 ,<span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">sep</span> = <span class="org-string">", "</span>
                <span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">void</span>
        <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-comment-delimiter">// </span><span class="org-comment">C++11 For-range based loop</span>
                <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: cont<span class="org-rainbow-delimiters-depth-3">)</span>
                        <span class="org-constant">std</span>::cout &lt;&lt;  x &lt;&lt; sep;
        <span class="org-rainbow-delimiters-depth-2">}</span>

        <span class="org-comment-delimiter">// </span><span class="org-comment">Higher order function</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">The parameter actions accepts any type which can be called like</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">a function returning void.</span>
        <span class="org-comment-delimiter">//</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Note: It doesn't matter as it is possible to use both class T or typename T.</span>
        <span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-keyword">typename</span> <span class="org-type">Container</span>, <span class="org-keyword">typename</span> <span class="org-type">Function</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>
        <span class="org-keyword">auto</span> <span class="org-function-name">for_each</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">Container</span> <span class="org-variable-name">cont</span>, <span class="org-type">Function</span> <span class="org-variable-name">action</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">void</span>
        <span class="org-rainbow-delimiters-depth-2">{</span>
                <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: cont<span class="org-rainbow-delimiters-depth-3">)</span> action<span class="org-rainbow-delimiters-depth-3">(</span>x<span class="org-rainbow-delimiters-depth-3">)</span>;
        <span class="org-rainbow-delimiters-depth-2">}</span>

<span class="org-rainbow-delimiters-depth-1">}</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">----- End of namespace IterUtils ----- //</span>
</pre>
</div>

<p>
Program output: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ clang++ template-iterator-container.cpp -o <span class="org-keyword">template-iterator-container.bin</span> -g -std=c++11 -Wall -Wextra 
$ ./template-iterator-container.bin

=========== Experiment 1 - sumContainer
<span class="org-function-name">template-iterator-container.cpp</span>:95: ; iu::sumContainer(&amp;carray[0], &amp;carray[0] + arrsize) = 16
<span class="org-function-name">template-iterator-container.cpp</span>:96: ; iu::sumContainer(vec1.begin(), vec1.end()) = 16
<span class="org-function-name">template-iterator-container.cpp</span>:97: ; iu::sumContainer(list1.begin(), list1.end()) = 16
<span class="org-function-name">template-iterator-container.cpp</span>:98: ; iu::sumContainer(deque1.begin(), deque1.end()) = 16

=========== Experiment 2 - sumContainer2 
<span class="org-function-name">template-iterator-container.cpp</span>:101: ; iu::sumContainer2&lt;double&gt;(vec1) = 16
<span class="org-function-name">template-iterator-container.cpp</span>:102: ; iu::sumContainer2&lt;int&gt;(vec1) = 15
<span class="org-function-name">template-iterator-container.cpp</span>:103: ; iu::sumContainer2&lt;double&gt;(list1) = 16
<span class="org-function-name">template-iterator-container.cpp</span>:104: ; iu::sumContainer2&lt;int&gt;(list2) = 114

=========== Experiment 3 - printContainer 

Contents of carray  = 1, 2, 4.5, 2.5, 6, 
Contents of vec1  = 1, 2, 4.5, 2.5, 6, 
Contents of vec2  = c++, templates, awesome, binary, 
Contents of list1 = 1, 2, 4.5, 2.5, 6, 

=========== Experiment 4 - printContainer2 

Contents of vec1  = 1, 2, 4.5, 2.5, 6, 
Contents of vec2  = c++, templates, awesome, binary, 
Contents of list1 = 1, 2, 4.5, 2.5, 6, 

=========== Experiment 5 - for_each higher order <span class="org-keyword">function</span> 

Contents of vec1  = 1, 2, 4.5, 2.5, 6, 
Contents of vec2  = c++, templates, awesome, binary, c++, templates, awesome, binary, 
Contents of m1  = 
  earth-gravity     9.810
          euler     2.718
             pi     3.142
              x     2.345

</pre>
</div>
</div>
</div>
