Understanding-CPP.html

<div id="outline-container-orgec6cc0b" class="outline-4">
<h4 id="orgec6cc0b"><a id="ID-80f3766a-39eb-47ef-a3f5-5a49ef183db0"></a><span class="section-number-4">1.13.4</span> Basic Template Specialization</h4>
<div class="outline-text-4" id="text-1-13-4">
<p>
Code example showing template specialization. As the code shows, the
template specilization can be used for type introspection, type
identification and implement reflection.
</p>

<ul class="org-ul">
<li>File: <a href="src/template-specialization1.cpp">file:src/template-specialization1.cpp</a></li>
<li>Online compiler: <a href="http://rextester.com/BKG53705">http://rextester.com/BKG53705</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iomanip</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>    <span class="org-comment-delimiter">// </span><span class="org-comment">Stream manipulator std::fixed, std::setw ... </span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">vector</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">cmath</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>      <span class="org-comment-delimiter">// </span><span class="org-comment">sin, cos, tan, exp ... M_PI, M_E ...</span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">functional</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span> <span class="org-comment-delimiter">// </span><span class="org-comment">std::function </span>

<span class="org-comment-delimiter">// </span><span class="org-comment">============= Example 1 ===============================//</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Check whether type is float point </span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">auto</span> <span class="org-function-name">isFPNumber</span><span class="org-rainbow-delimiters-depth-1">()</span> -&gt; <span class="org-type">bool</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">return</span> <span class="org-constant">false</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Template specialization of isFPNumber for type float</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;&gt;</span> <span class="org-keyword">auto</span> <span class="org-function-name">isFPNumber</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">float</span><span class="org-rainbow-delimiters-depth-1">&gt;()</span> -&gt; <span class="org-type">bool</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">return</span> <span class="org-constant">true</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Template specialization of isFPNumber for type double </span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;&gt;</span> <span class="org-keyword">auto</span> <span class="org-function-name">isFPNumber</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;()</span> -&gt; <span class="org-type">bool</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">return</span> <span class="org-constant">true</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">============= Example 2 - Template specialization for runtime type identification ====//</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Note: this technique can be used for implemeting custom C++ reflection </span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Return name of a given type </span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">Type</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">auto</span> <span class="org-function-name">TypeName</span><span class="org-rainbow-delimiters-depth-1">()</span> -&gt; <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-keyword">return</span> <span class="org-string">"unknown"</span>; <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-preprocessor">#define</span> <span class="org-function-name">REGISTER_TYPE</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">type</span><span class="org-rainbow-delimiters-depth-1">)</span>  <span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;&gt;</span> \
        <span class="org-keyword">auto</span> <span class="org-variable-name">TypeName</span><span class="org-rainbow-delimiters-depth-1">&lt;</span>type<span class="org-rainbow-delimiters-depth-1">&gt;()</span> -&gt; <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-keyword">return</span> #type; <span class="org-rainbow-delimiters-depth-1">}</span> 

<span class="org-comment-delimiter">// </span><span class="org-comment">Specialization for int type </span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;&gt;</span>
<span class="org-keyword">auto</span> <span class="org-function-name">TypeName</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;()</span> -&gt; <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-keyword">return</span> <span class="org-string">"int"</span>; <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Automate boilerplate code using macros.</span>
REGISTER_TYPE<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">bool</span><span class="org-rainbow-delimiters-depth-1">)</span>;
REGISTER_TYPE<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">)</span>;
REGISTER_TYPE<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span>*<span class="org-rainbow-delimiters-depth-1">)</span>;
REGISTER_TYPE<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">float</span><span class="org-rainbow-delimiters-depth-1">)</span>;
REGISTER_TYPE<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span>;
REGISTER_TYPE<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">long</span><span class="org-rainbow-delimiters-depth-1">)</span>;
REGISTER_TYPE<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span><span class="org-rainbow-delimiters-depth-1">)</span>;
REGISTER_TYPE<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-1">)</span>;
REGISTER_TYPE<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">long</span> <span class="org-type">long</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">============= Example 3 - Template with int argument specialization ===//</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">getNumberName</span><span class="org-rainbow-delimiters-depth-1">(){</span>
        <span class="org-keyword">return</span> <span class="org-string">"I down't known"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;&gt;</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">getNumberName</span><span class="org-rainbow-delimiters-depth-1">&lt;</span>0<span class="org-rainbow-delimiters-depth-1">&gt;(){</span> <span class="org-keyword">return</span> <span class="org-string">"zero"</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;&gt;</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">getNumberName</span><span class="org-rainbow-delimiters-depth-1">&lt;</span>1<span class="org-rainbow-delimiters-depth-1">&gt;(){</span> <span class="org-keyword">return</span> <span class="org-string">"one"</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;&gt;</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">getNumberName</span><span class="org-rainbow-delimiters-depth-1">&lt;</span>2<span class="org-rainbow-delimiters-depth-1">&gt;(){</span> <span class="org-keyword">return</span> <span class="org-string">"two"</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;&gt;</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">getNumberName</span><span class="org-rainbow-delimiters-depth-1">&lt;</span>3<span class="org-rainbow-delimiters-depth-1">&gt;(){</span> <span class="org-keyword">return</span> <span class="org-string">"three"</span>; <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">============= Example 4 - Template with bool argument specialization ====//</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">bool</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">struct</span> <span class="org-type">boolTemplate</span>;

<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;&gt;</span> <span class="org-keyword">struct</span> <span class="org-type">boolTemplate</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">false</span><span class="org-rainbow-delimiters-depth-1">&gt;{</span>
        <span class="org-keyword">static</span> <span class="org-keyword">auto</span> <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> -&gt; <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-keyword">return</span> <span class="org-string">"false"</span>; <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;&gt;</span> <span class="org-keyword">struct</span> <span class="org-type">boolTemplate</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">true</span><span class="org-rainbow-delimiters-depth-1">&gt;{</span>
        <span class="org-keyword">static</span> <span class="org-keyword">auto</span> <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> -&gt; <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-keyword">return</span> <span class="org-string">"true"</span>; <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">============= Example 5 - Check whether types are equal ====//</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Partial template specialization </span>

<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">A</span>, <span class="org-keyword">class</span> <span class="org-type">B</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">struct</span> <span class="org-type">type_equal</span><span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">static</span> <span class="org-type">bool</span> <span class="org-function-name">get</span><span class="org-rainbow-delimiters-depth-2">(){</span> <span class="org-keyword">return</span> <span class="org-constant">false</span>; <span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-keyword">enum</span> <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-variable-name">value</span> = 0 <span class="org-rainbow-delimiters-depth-2">}</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Partial specialisation</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">A</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">struct</span> <span class="org-type">type_equal</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">A</span>, <span class="org-type">A</span><span class="org-rainbow-delimiters-depth-1">&gt;{</span>
        <span class="org-keyword">static</span> <span class="org-type">bool</span> <span class="org-function-name">get</span><span class="org-rainbow-delimiters-depth-2">(){</span> <span class="org-keyword">return</span> <span class="org-constant">true</span>; <span class="org-rainbow-delimiters-depth-2">}</span>
        <span class="org-keyword">enum</span> <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-variable-name">value</span> = 1<span class="org-rainbow-delimiters-depth-2">}</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-type">int</span> <span class="org-function-name">main</span><span class="org-rainbow-delimiters-depth-1">(){</span>
        <span class="org-keyword">const</span> <span class="org-type">char</span> <span class="org-variable-name">nl</span> = <span class="org-string">'\n'</span>;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::boolalpha;

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"EXPERIMENT 1 - Check whether type is float pointer"</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"--------------------------------------------"</span> &lt;&lt; nl;  
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"is float point type&lt;int&gt;    ? = "</span> &lt;&lt; isFPNumber<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"is float point type&lt;char&gt;   ? = "</span> &lt;&lt; isFPNumber<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"is float point type&lt;float&gt;  ? = "</span> &lt;&lt; isFPNumber<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">float</span><span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"is float point type&lt;double&gt; ? = "</span> &lt;&lt; isFPNumber<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">float</span><span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"EXPERIMENT 2 - Type introspection"</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"--------------------------------------------"</span> &lt;&lt; nl;  
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"type = "</span> &lt;&lt; TypeName<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"type = "</span> &lt;&lt; TypeName<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"type = "</span> &lt;&lt; TypeName<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">float</span><span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"type = "</span> &lt;&lt; TypeName<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-keyword">const</span> <span class="org-type">char</span>*<span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"type = "</span> &lt;&lt; TypeName<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;    

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"EXPERIMENT 3 - Templates with integers as arguments"</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"--------------------------------------------"</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"getNumberName&lt;0&gt;() = "</span> &lt;&lt; getNumberName<span class="org-rainbow-delimiters-depth-2">&lt;</span>0<span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"getNumberName&lt;1&gt;() = "</span> &lt;&lt; getNumberName<span class="org-rainbow-delimiters-depth-2">&lt;</span>1<span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"getNumberName&lt;2&gt;() = "</span> &lt;&lt; getNumberName<span class="org-rainbow-delimiters-depth-2">&lt;</span>2<span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"getNumberName&lt;10&gt;() = "</span> &lt;&lt; getNumberName<span class="org-rainbow-delimiters-depth-2">&lt;</span>10<span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"getNumberName&lt;14&gt;() = "</span> &lt;&lt; getNumberName<span class="org-rainbow-delimiters-depth-2">&lt;</span>14<span class="org-rainbow-delimiters-depth-2">&gt;()</span> &lt;&lt; nl;

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"EXPERIMENT 4 - Templates with bool as arguments"</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"--------------------------------------------"</span> &lt;&lt; nl;  
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"boolTemplate&lt;false&gt;::getName&gt;()  = "</span> &lt;&lt; <span class="org-constant">boolTemplate</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">false</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>::getName<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"boolTemplate&lt;true&gt;::getName&gt;()   = "</span> &lt;&lt; <span class="org-constant">boolTemplate</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">true</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>::getName<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; nl;

        <span class="org-constant">std</span>::cout &lt;&lt; nl &lt;&lt; <span class="org-string">"Check whether types are equal"</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"type_equal&lt;int, char&gt;::get()       = "</span>  &lt;&lt; <span class="org-constant">type_equal</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">int</span>, <span class="org-type">char</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>::get<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; nl;    
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"type_equal&lt;char, double&gt;::get()    = "</span>  &lt;&lt; <span class="org-constant">type_equal</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">char</span>, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>::get<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"type_equal&lt;double, double&gt;::get()  = "</span>  &lt;&lt; <span class="org-constant">type_equal</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span>, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>::get<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; nl;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"type_equal&lt;int, int&gt;::get()        = "</span>  &lt;&lt; <span class="org-constant">type_equal</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">int</span>, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>::get<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; nl;

        <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>type_equal&lt;<span class="org-type">int</span>, <span class="org-type">double</span>&gt;::value<span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"[1] Types are equal\n"</span>;
        <span class="org-keyword">else</span>
                <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"[1] Types are not equal\n"</span>;

        <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>type_equal&lt;<span class="org-type">double</span>, <span class="org-type">double</span>&gt;::value<span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"[2] Types are equal\n"</span>;
        <span class="org-keyword">else</span>
                <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"[2] Types are not equal\n"</span>;


        <span class="org-keyword">return</span> 0;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Program output: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ clang++ template-specialization1.cpp -o <span class="org-keyword">template-specialization1.bin</span> -g -std=c++11 -Wall -Wextra 
$ ./template-specialization1.bin

EXPERIMENT 1 - Check whether type is float pointer
--------------------------------------------
is float point type&lt;int&gt;    ? = false
is float point type&lt;char&gt;   ? = false
is float point type&lt;float&gt;  ? = true
is float point type&lt;double&gt; ? = true

EXPERIMENT 2 - Type introspection
--------------------------------------------
<span class="org-builtin">type</span> = int
<span class="org-builtin">type</span> = char
<span class="org-builtin">type</span> = float
<span class="org-builtin">type</span> = const char*
<span class="org-builtin">type</span> = std::string

EXPERIMENT 3 - Templates with integers as arguments
--------------------------------------------
getNumberName&lt;0&gt;() = zero
getNumberName&lt;1&gt;() = one
getNumberName&lt;2&gt;() = two
getNumberName&lt;10&gt;() = I down<span class="org-string">'t known</span>
<span class="org-string">getNumberName&lt;14&gt;() = I down'</span>t known

EXPERIMENT 4 - Templates with bool as arguments
--------------------------------------------
boolTemplate&lt;false&gt;::getName&gt;()  = false
boolTemplate&lt;true&gt;::getName&gt;()   = true

Check whether types are equal
type_equal&lt;int, char&gt;::get()       = false
type_equal&lt;char, double&gt;::get()    = false
type_equal&lt;double, double&gt;::get()  = true
type_equal&lt;int, int&gt;::get()        = true
[1] Types are not equal
[2] Types are equal
</pre>
</div>
</div>
</div>
