Understanding-CPP.html
<div id="outline-container-org80e2271" class="outline-4">
<h4 id="org80e2271"><a id="ID-20156a12-aa32-407d-8cc0-5c4b85ba9021"></a><span class="section-number-4">1.13.5</span> Implementing Higher Order Functions with templates</h4>
<div class="outline-text-4" id="text-1-13-5">
<ul class="org-ul">
<li>File: <a href="src/template-hof1.cpp">file:src/template-hof1.cpp</a></li>
<li>Online Compiler: <a href="https://rextester.com/ZAT8950">https://rextester.com/ZAT8950</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">/**   </span><span class="org-comment">File:     template-hof1.cpp </span>
<span class="org-comment">  *  Brief:    Shows how to implement template higher order functions which operates on containers.</span>
<span class="org-comment">  *  Features: Template metaprogramming, C++11, functional programming and STL.</span>
<span class="org-comment">  ****************************************************************************/</span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">cmath</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">list</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">deque</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">vector</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">functional</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span> 
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iomanip</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Apply a function to every element of a container */</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">ELEM</span>, <span class="org-keyword">class</span> <span class="org-type">ALLOC</span>, <span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-keyword">class</span>, <span class="org-keyword">class</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-keyword">class</span> <span class="org-type">CONTAINER</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-type">void</span> <span class="org-function-name">forRange1</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">CONTAINER</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">ELEM</span>, <span class="org-type">ALLOC</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>&amp; <span class="org-variable-name">cont</span>, <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-type">ELEM</span>&amp;<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">fn</span><span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">auto</span> <span class="org-variable-name">i</span> =  <span class="org-constant">std</span>::begin<span class="org-rainbow-delimiters-depth-3">(</span>cont<span class="org-rainbow-delimiters-depth-3">)</span>; i != <span class="org-constant">std</span>::end<span class="org-rainbow-delimiters-depth-3">(</span>cont<span class="org-rainbow-delimiters-depth-3">)</span>; i++<span class="org-rainbow-delimiters-depth-2">)</span>
                fn<span class="org-rainbow-delimiters-depth-2">(</span>*i<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Apply a function to every element of a container */</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">CONTAINER</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-type">void</span> <span class="org-function-name">forRange2</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">CONTAINER</span>&amp; <span class="org-variable-name">cont</span>, <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">decltype</span><span class="org-rainbow-delimiters-depth-4">(</span>cont.front<span class="org-rainbow-delimiters-depth-5">()</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">fn</span><span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">auto</span> <span class="org-variable-name">i</span> =  <span class="org-constant">std</span>::begin<span class="org-rainbow-delimiters-depth-3">(</span>cont<span class="org-rainbow-delimiters-depth-3">)</span>; i != <span class="org-constant">std</span>::end<span class="org-rainbow-delimiters-depth-3">(</span>cont<span class="org-rainbow-delimiters-depth-3">)</span>; i++<span class="org-rainbow-delimiters-depth-2">)</span>
                fn<span class="org-rainbow-delimiters-depth-2">(</span>*i<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Template for folding over a container in a similar way to the higher order function fold. </span>
<span class="org-comment"> * Note: </span>
<span class="org-comment"> * + CONTAINER parameter accepts any argument which has .begin() and .end() methods </span>
<span class="org-comment"> *   returning iterators. </span>
<span class="org-comment"> * + STEPFN type parameters accepts any function-object, function pointer or lambda </span>
<span class="org-comment"> *   whith the following signature: (ACC, X) =&gt; ACC where ACC is the accumulator type </span>
<span class="org-comment"> *   and X is the type of the container element. </span>
<span class="org-comment"> */</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">CONTAINER</span>, <span class="org-keyword">class</span> <span class="org-type">ACC</span>, <span class="org-keyword">class</span> <span class="org-type">STEPFN</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">auto</span> <span class="org-function-name">foldRange</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">CONTAINER</span>&amp; <span class="org-variable-name">cont</span>, <span class="org-keyword">const</span> <span class="org-type">ACC</span>&amp; <span class="org-variable-name">init</span>, <span class="org-type">STEPFN</span> <span class="org-variable-name">fn</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">ACC</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-type">ACC</span> <span class="org-variable-name">acc</span><span class="org-rainbow-delimiters-depth-2">{</span>init<span class="org-rainbow-delimiters-depth-2">}</span>;
        <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">auto</span> <span class="org-variable-name">i</span> =  <span class="org-constant">std</span>::begin<span class="org-rainbow-delimiters-depth-3">(</span>cont<span class="org-rainbow-delimiters-depth-3">)</span>; i != <span class="org-constant">std</span>::end<span class="org-rainbow-delimiters-depth-3">(</span>cont<span class="org-rainbow-delimiters-depth-3">)</span>; i++<span class="org-rainbow-delimiters-depth-2">)</span>
                acc = fn<span class="org-rainbow-delimiters-depth-2">(</span>*i, acc<span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-keyword">return</span> acc;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-type">int</span> <span class="org-function-name">main</span><span class="org-rainbow-delimiters-depth-1">(){</span>
        <span class="org-constant">std</span>::<span class="org-constant">ios_base</span>::sync_with_stdio<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">false</span><span class="org-rainbow-delimiters-depth-2">)</span>;

        <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">vec</span><span class="org-rainbow-delimiters-depth-2">{</span>1, 2, 400, 100<span class="org-rainbow-delimiters-depth-2">}</span>;
        <span class="org-constant">std</span>::<span class="org-type">list</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>   <span class="org-variable-name">lst</span><span class="org-rainbow-delimiters-depth-2">{</span>1, 2, 400, 100<span class="org-rainbow-delimiters-depth-2">}</span>;

        <span class="org-comment-delimiter">// </span><span class="org-comment">Requires template argument </span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"===== EXPERIMENT 1 =================\n"</span>;
                <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"forRange1 - Vector"</span> &lt;&lt; <span class="org-string">"\n"</span>;
        forRange1<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">&gt;(</span>vec, <span class="org-rainbow-delimiters-depth-3">[](</span><span class="org-type">int</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-3">){</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-4">(</span>5<span class="org-rainbow-delimiters-depth-4">)</span> &lt;&lt; x &lt;&lt; <span class="org-string">" "</span>; <span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\n"</span>;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"forRange1 - List"</span> &lt;&lt; <span class="org-string">"\n"</span>;
        forRange1<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">&gt;(</span>lst, <span class="org-rainbow-delimiters-depth-3">[](</span><span class="org-type">int</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-3">){</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-4">(</span>5<span class="org-rainbow-delimiters-depth-4">)</span> &lt;&lt; x &lt;&lt; <span class="org-string">" "</span>; <span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\n"</span>;

        <span class="org-comment-delimiter">// </span><span class="org-comment">Doesn't require the template argument as the compiler can infer its type.</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"===== EXPERIMENT 2 =================\n"</span>;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"forRange1 - Vector"</span> &lt;&lt; <span class="org-string">"\n"</span>;
        forRange2<span class="org-rainbow-delimiters-depth-2">(</span>vec, <span class="org-rainbow-delimiters-depth-3">[](</span><span class="org-type">int</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-3">){</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-4">(</span>5<span class="org-rainbow-delimiters-depth-4">)</span> &lt;&lt; x &lt;&lt; <span class="org-string">" "</span>; <span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\n"</span>;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"forRange1 - list"</span> &lt;&lt; <span class="org-string">"\n"</span>;
        forRange2<span class="org-rainbow-delimiters-depth-2">(</span>lst, <span class="org-rainbow-delimiters-depth-3">[](</span><span class="org-type">int</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-3">){</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-4">(</span>5<span class="org-rainbow-delimiters-depth-4">)</span> &lt;&lt; x &lt;&lt; <span class="org-string">" "</span>; <span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\n"</span>;

        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"===== EXPERIMENT 3 =================\n"</span>;
        <span class="org-type">int</span> <span class="org-variable-name">result1</span> = foldRange<span class="org-rainbow-delimiters-depth-2">(</span>vec, 0, <span class="org-rainbow-delimiters-depth-3">[](</span><span class="org-type">int</span> <span class="org-variable-name">x</span>, <span class="org-type">int</span> <span class="org-variable-name">acc</span><span class="org-rainbow-delimiters-depth-3">){</span>
                                                <span class="org-keyword">return</span> x + acc;
                                          <span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">)</span>;   
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"sum(vec1) = "</span> &lt;&lt; result1 &lt;&lt; <span class="org-string">"\n"</span> ;
        <span class="org-type">int</span> <span class="org-variable-name">result2</span> = foldRange<span class="org-rainbow-delimiters-depth-2">(</span>lst, 0, <span class="org-constant">std</span>::plus<span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-3">&gt;()</span><span class="org-rainbow-delimiters-depth-2">)</span>;  
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"sum(lst) = "</span> &lt;&lt; result2 &lt;&lt; <span class="org-string">"\n"</span> ;

        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"product(lst) = "</span> &lt;&lt; foldRange<span class="org-rainbow-delimiters-depth-2">(</span>lst, 1, <span class="org-constant">std</span>::multiplies<span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-3">&gt;()</span><span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-string">"\n"</span> ;
        <span class="org-keyword">return</span> 0;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Output: 
</p>

<div class="org-src-container">
<pre class="src src-sh">clang++ template-hof1.cpp -o <span class="org-keyword">template-hof1.bin</span> -g -std=c++11 -Wall -Wextra &amp;&amp; ./template-hof1.bin
===== EXPERIMENT 1 =================
forRange1 - Vector
    1     2   400   100 
forRange1 - List
    1     2   400   100 
===== EXPERIMENT 2 =================
forRange1 - Vector
    1     2   400   100 
forRange1 - list
    1     2   400   100 
===== EXPERIMENT 3 =================
<span class="org-function-name">sum</span>(vec1) = 503
<span class="org-function-name">sum</span>(lst) = 503
<span class="org-function-name">product</span>(lst) = 80000
</pre>
</div>
</div>
</div>
