Understanding-CPP.html
<div id="outline-container-orgf9a88f2" class="outline-4">
<h4 id="orgf9a88f2"><span class="section-number-4">1.13.6</span> Metafunctions or type traits</h4>
<div class="outline-text-4" id="text-1-13-6">
</div>
<ol class="org-ol">
<li><a id="orgadb1d70"></a>Overview<br />
<div class="outline-text-5" id="text-1-13-6-1">
<p>
Metafunction (aka type traits) is a template metaprogramming technique
for type introspection, type manipulation and type computation. This
idiom uses templates, template specialization, structs (classes with
everything public) and constexpr in C++11.
</p>

<p>
This section contains examples about template metafunctions. For more
information about this subject and further reading, see: 
</p>
<ul class="org-ul">
<li><a href="https://en.wikibooks.org/wiki/More_C++_Idioms/Metafunction">More C++ Idioms/Metafunction - Wikibooks, open books for an open world</a></li>
<li><a href="https://en.wikibooks.org/wiki/More_C++_Idioms/Type_Generator">More C++ Idioms/Type Generator - Wikibooks, open books for an open world</a></li>
<li><a href="https://akrzemi1.wordpress.com/2012/03/19/meta-functions-in-c11/">Meta-functions in C++11 | Andrzej's C++ blog</a></li>
<li><a href="https://accu.org/index.php/journals/442">ACCU - An introduction to C++ Traits</a></li>
</ul>


<p>
A meta function has the forms: 
</p>

<ul class="org-ul">
<li>Meta function which returns type.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Doesn't matter using typename T1, typename T2</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">or using class T1, class T2 ..</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T1</span>, <span class="org-keyword">class</span> <span class="org-type">T2</span> ...<span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">struct</span> <span class="org-type">meta_function</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Before C++11</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Meta function which returns type </span>
        <span class="org-keyword">using</span> <span class="org-type">type</span> = ... ;
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">typename</span> <span class="org-type">T1</span>, <span class="org-keyword">typename</span> <span class="org-type">T2</span> ...<span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">struct</span> <span class="org-type">meta_function</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Before C++11</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Meta function which returns type </span>
        <span class="org-keyword">using</span> <span class="org-type">type</span> = ... ;
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Before C++11 </span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T1</span>, <span class="org-keyword">class</span> <span class="org-type">T2</span> ...<span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">struct</span> <span class="org-type">meta_function</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">typedef</span> ... ... <span class="org-type">type</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Usage: </span>
<span class="org-keyword">using</span> <span class="org-type">type_synonym</span> =  <span class="org-constant">meta_function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">T1</span>, <span class="org-type">T2</span>, ...<span class="org-rainbow-delimiters-depth-1">&gt;</span>::type ;
<span class="org-comment-delimiter">// </span><span class="org-comment">Or in before C++11</span>
<span class="org-keyword">typedef</span>  <span class="org-constant">meta_function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">T1</span>, <span class="org-type">T2</span>, ...<span class="org-rainbow-delimiters-depth-1">&gt;</span>::<span class="org-type">type</span> <span class="org-type">type_synonym</span>;
</pre>
</div>

<ul class="org-ul">
<li>Meta function which returns value.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">At least C++11</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T1</span>, <span class="org-keyword">class</span> <span class="org-type">T2</span> ...<span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">struct</span> <span class="org-type">meta_function</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Requires at aleast C++11</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Meta function which returns type </span>
        <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-type">TYPE</span> <span class="org-variable-name">value</span> = ... 
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Before C++11</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T1</span>, <span class="org-keyword">class</span> <span class="org-type">T2</span> ...<span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">struct</span> <span class="org-type">meta_function</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Requires at aleast C++11</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Meta function which returns type </span>
        <span class="org-keyword">static</span> <span class="org-keyword">const</span> <span class="org-type">TYPE</span> <span class="org-variable-name">value</span> = ... 
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Usage:</span>
<span class="org-type">TYPE</span> <span class="org-variable-name">result</span> = <span class="org-constant">meta_function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">T1</span>, <span class="org-type">T2</span>, ..<span class="org-rainbow-delimiters-depth-1">&gt;</span>::value;
</pre>
</div>

<p>
Further References: 
</p>

<ul class="org-ul">
<li><a href="https://en.cppreference.com/w/cpp/header/type_traits">Standard library header &lt;type_traits&gt; - cppreference.com</a></li>
<li><a href="https://www.youtube.com/watch?v=eVtLOHoDbTo">Type Traits - CopperSpice video</a></li>
</ul>
</div>
</li>
