Understanding-CPP.html

<li><a id="orgcc6285f"></a>Example<br />
<div class="outline-text-5" id="text-1-13-6-2">
<p>
<b>Example</b>
</p>

<p>
Example in:
</p>
<ul class="org-ul">
<li>file:            <a href="src/template-metafunction.cpp">file:src/template-metafunction.cpp</a></li>
<li>Online compiler: <a href="http://rextester.com/TAT89158">http://rextester.com/TAT89158</a></li>
<li>The code in the example demonstrates how to query types using
template specialization, catalog type information and display the
user as well.</li>
</ul>

<p>
Highlights: 
</p>

<ul class="org-ul">
<li>The <b>metafunction isPointer</b> checks whether a given type is a
pointer.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">struct</span> <span class="org-type">isPointer</span><span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-type">bool</span> <span class="org-variable-name">value</span> = <span class="org-constant">false</span>;
        <span class="org-keyword">constexpr</span> <span class="org-type">bool</span> <span class="org-keyword">operator</span><span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-keyword">return</span> <span class="org-constant">false</span>; <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">struct</span> <span class="org-type">isPointer</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">T</span>*<span class="org-rainbow-delimiters-depth-1">&gt;{</span>
        <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-type">bool</span> <span class="org-variable-name">value</span> = <span class="org-constant">true</span>;
        <span class="org-keyword">constexpr</span> <span class="org-type">bool</span> <span class="org-keyword">operator</span><span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-keyword">return</span> <span class="org-constant">true</span>; <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<p>
Sample usage:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"isPointer&lt;short*&gt;::value  = "</span> &lt;&lt; <span class="org-constant">isPointer</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">short</span>*<span class="org-rainbow-delimiters-depth-1">&gt;</span>::value &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"isPointer&lt;short&gt;::value   = "</span> &lt;&lt; <span class="org-constant">isPointer</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">short</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>::value &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"isPointer&lt;double&gt;::value  = "</span> &lt;&lt; <span class="org-constant">isPointer</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>::value &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"isPointer&lt;double*&gt;::value = "</span> &lt;&lt; <span class="org-constant">isPointer</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span>*<span class="org-rainbow-delimiters-depth-1">&gt;</span>::value &lt;&lt; <span class="org-string">"\n"</span>;
</pre>
</div>

<p>
Output: 
</p>

<div class="org-src-container">
<pre class="src src-text">isPointer&lt;short*&gt;::value  = true
isPointer&lt;short&gt;::value   = false
isPointer&lt;double&gt;::value  = false
isPointer&lt;double*&gt;::value = true
</pre>
</div>

<ul class="org-ul">
<li>The <b>meta function removePointer</b> turns any pointer type into a
non-pointer type removing the star operator.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Partial specilization</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-keyword">struct</span> <span class="org-type">removePointer</span><span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">typedef</span> <span class="org-type">T</span> <span class="org-type">type</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-keyword">struct</span> <span class="org-type">removePointer</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">T</span>*<span class="org-rainbow-delimiters-depth-1">&gt;{</span>
        <span class="org-keyword">typedef</span> <span class="org-type">T</span> <span class="org-type">type</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<p>
Usage: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">disp<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">Typeinfo</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">removePointer</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span>::type<span class="org-rainbow-delimiters-depth-2">&gt;</span>::name<span class="org-rainbow-delimiters-depth-1">)</span>;
disp<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">Typeinfo</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">removePointer</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span>*<span class="org-rainbow-delimiters-depth-3">&gt;</span>::type<span class="org-rainbow-delimiters-depth-2">&gt;</span>::name<span class="org-rainbow-delimiters-depth-1">)</span>;
disp<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">Typeinfo</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">removePointer</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-keyword">const</span> <span class="org-type">char</span>*<span class="org-rainbow-delimiters-depth-3">&gt;</span>::type<span class="org-rainbow-delimiters-depth-2">&gt;</span>::name<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
Output: 
</p>

<div class="org-src-container">
<pre class="src src-text">template-metafunction.cpp:175: ; Typeinfo&lt;removePointer&lt;double&gt;::type&gt;::name = double
template-metafunction.cpp:176: ; Typeinfo&lt;removePointer&lt;double*&gt;::type&gt;::name = double
template-metafunction.cpp:177: ; Typeinfo&lt;removePointer&lt;const char*&gt;::type&gt;::name = const char
</pre>
</div>

<ul class="org-ul">
<li><b>The metafunction Typeinfo</b> computes basic information about types at
compile-time. As this "metafunction" relies on template
specialization, it requires defining template specialization for
all supported types what can be cumbersome. In order to avoid the
specialization boilerplate code, the macro <code>REGISTER_TYPE_INFO</code> is
used to register the supported types.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">typename</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">struct</span> <span class="org-type">Typeinfo</span><span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">name</span>    = <span class="org-string">"unknown"</span>;
        <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-type">size_t</span>      <span class="org-variable-name">size</span>    = <span class="org-keyword">sizeof</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">T</span><span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-type">bool</span>        <span class="org-variable-name">isNumber</span>    = <span class="org-constant">false</span>;
        <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-type">bool</span>        <span class="org-variable-name">isPointer</span> = ::<span class="org-constant">isPointer</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">T</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>::value;
        <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-type">bool</span>        <span class="org-variable-name">isConst</span>     = ::<span class="org-constant">isConst</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">T</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>::value;     
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Macro for type registration </span>
<span class="org-preprocessor">#define</span> <span class="org-function-name">REGISTER_TYPE_INFO</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">type</span>, <span class="org-variable-name">isNumberFlag</span><span class="org-rainbow-delimiters-depth-1">)</span> \
        <span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;&gt;</span> <span class="org-keyword">struct</span> <span class="org-type">Typeinfo</span><span class="org-rainbow-delimiters-depth-1">&lt;</span>type<span class="org-rainbow-delimiters-depth-1">&gt;{</span> \
                <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">name</span>       = #type; \
                <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-type">size_t</span>      <span class="org-variable-name">size</span>       = <span class="org-keyword">sizeof</span><span class="org-rainbow-delimiters-depth-2">(</span>type<span class="org-rainbow-delimiters-depth-2">)</span>; \
                <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-type">bool</span>        <span class="org-variable-name">isNumber</span>   = isNumberFlag; \
                <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-type">bool</span>        <span class="org-variable-name">isPointer</span>  = ::<span class="org-constant">isPointer</span><span class="org-rainbow-delimiters-depth-2">&lt;</span>type<span class="org-rainbow-delimiters-depth-2">&gt;</span>::value; \
                <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-type">bool</span>        <span class="org-variable-name">isConst</span>    = ::<span class="org-constant">isConst</span><span class="org-rainbow-delimiters-depth-2">&lt;</span>type<span class="org-rainbow-delimiters-depth-2">&gt;</span>::value;   \
        <span class="org-rainbow-delimiters-depth-1">}</span>

 <span class="org-comment-delimiter">// </span><span class="org-comment">Type registration </span>
 REGISTER_TYPE_INFO<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">bool</span>, <span class="org-constant">false</span><span class="org-rainbow-delimiters-depth-1">)</span>;
 REGISTER_TYPE_INFO<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span>, <span class="org-constant">false</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
Usage example: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"Type info for "</span> &lt;&lt; <span class="org-type">Typeinfo</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>&gt;::name 
          &lt;&lt; <span class="org-string">" size = "</span> &lt;&lt; <span class="org-constant">Typeinfo</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>::size 
          &lt;&lt; <span class="org-string">" isPointer = "</span> &lt;&lt; <span class="org-constant">Typeinfo</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>::isPointer 
          &lt;&lt; <span class="org-string">"\n"</span>;
</pre>
</div>


<p>
<b>Complete Program output:</b> (<a href="src/template-metafunction.cpp">file:src/template-metafunction.cpp</a>)
</p>

<div class="org-src-container">
<pre class="src src-text">$ clang++ template-metafunction.cpp -o template-metafunction.bin -g -std=c++11 -Wall -Wextra  
./template-metafunction.bin

isPointerOLD&lt;short*&gt;::value  = 1
isPointerOLD&lt;short&gt;::value   = 0
isPointerOLD&lt;double&gt;::value  = 0
isPointerOLD&lt;double*&gt;::value = 1
isPointer&lt;short*&gt;::value  = true
isPointer&lt;short&gt;::value   = false
isPointer&lt;double&gt;::value  = false
isPointer&lt;double*&gt;::value = true
isPointer&lt;short*&gt;()()  = true
isPointer&lt;short&gt;()()   = false
isPointer&lt;double&gt;()()  = false
isPointer&lt;double*&gt;()() = true
Type Info: name =            bool ; bytes =    1 ; isNumber = false ; isPointer = false ; isConst = false
Type Info: name =            char ; bytes =    1 ; isNumber = false ; isPointer = false ; isConst = false
Type Info: name =     std::string ; bytes =   32 ; isNumber = false ; isPointer = false ; isConst = false
Type Info: name =             int ; bytes =    4 ; isNumber =  true ; isPointer = false ; isConst = false
Type Info: name =           short ; bytes =    2 ; isNumber =  true ; isPointer = false ; isConst = false
Type Info: name =           float ; bytes =    4 ; isNumber =  true ; isPointer = false ; isConst = false
Type Info: name =          double ; bytes =    8 ; isNumber =  true ; isPointer = false ; isConst = false
Type Info: name =     const char* ; bytes =    8 ; isNumber =  true ; isPointer =  true ; isConst =  true
Type Info: name =          float* ; bytes =    8 ; isNumber = false ; isPointer =  true ; isConst = false
Type Info: name =         double* ; bytes =    8 ; isNumber = false ; isPointer =  true ; isConst = false
Type Info: name =   const double&amp; ; bytes =    8 ; isNumber = false ; isPointer = false ; isConst =  true
template-metafunction.cpp:175: ; Typeinfo&lt;removePointer&lt;double&gt;::type&gt;::name = double
template-metafunction.cpp:176: ; Typeinfo&lt;removePointer&lt;double*&gt;::type&gt;::name = double
template-metafunction.cpp:177: ; Typeinfo&lt;removePointer&lt;const char*&gt;::type&gt;::name = const char
</pre>
</div>
</div>
</li>
</ol>
</div>
