Understanding-CPP.html
<div id="outline-container-org903563f" class="outline-4">
<h4 id="org903563f"><span class="section-number-4">1.13.7</span> Variadic Templates</h4>
<div class="outline-text-4" id="text-1-13-7">
<p>
This code shows examples about variadic templates in C++11 and
newer standards.
</p>

<p>
File: <a href="src/template-variadic.cpp">file:src/template-variadic.cpp</a>
</p>

<p>
Code Highlights:
</p>


<ul class="org-ul">
<li>Print a sequence of heterogenous arguments.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">typename</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-type">void</span> <span class="org-function-name">printTypes</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">T</span>&amp; <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-1">){</span>    
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::left &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>15<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; x
                                  &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>10<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::right &lt;&lt; <span class="org-string">" size = "</span>
                                  &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>2<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-keyword">sizeof</span><span class="org-rainbow-delimiters-depth-2">(</span>x<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-string">"\n"</span>;
        <span class="org-constant">std</span>::clog &lt;&lt; <span class="org-string">" [TRACE] Base case =&gt; x = "</span> &lt;&lt; x &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Variadic template arguments </span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">typename</span> <span class="org-type">T</span>, <span class="org-keyword">typename</span> ... <span class="org-type">Types</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-type">void</span> <span class="org-function-name">printTypes</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">T</span>&amp; <span class="org-variable-name">x</span>, <span class="org-keyword">const</span> <span class="org-type">Types</span> ... <span class="org-variable-name">args</span><span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::left &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>15<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; x
                                  &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>10<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-constant">std</span>::right &lt;&lt; <span class="org-string">" size = "</span>
                                  &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>2<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-keyword">sizeof</span><span class="org-rainbow-delimiters-depth-2">(</span>x<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-string">"\n"</span>;
        printTypes<span class="org-rainbow-delimiters-depth-2">(</span>args ...<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Usage: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">printTypes<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"hello world"</span>, 10, <span class="org-string">'x'</span>, 20.23f, <span class="org-constant">true</span>, NAN<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
Ouput: 
</p>

<div class="org-src-container">
<pre class="src src-text">hello world       size = 12
10                size =  4
x                 size =  1
20.23             size =  4
1                 size =  1
nan               size =  4
</pre>
</div>


<ul class="org-ul">
<li>Create a function that applies a member function to a given object.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T</span>, <span class="org-keyword">class</span> <span class="org-type">R</span>, <span class="org-keyword">class</span> ... <span class="org-type">Args</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">auto</span> <span class="org-function-name">makeCommand</span><span class="org-rainbow-delimiters-depth-1">(</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Pointer to member function </span>
        <span class="org-type">R</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">T</span>::* <span class="org-function-name">pMemfn</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">Args</span> ... <span class="org-variable-name">args</span><span class="org-rainbow-delimiters-depth-2">)</span>,
        <span class="org-comment-delimiter">// </span><span class="org-comment">Member function arguments </span>
        <span class="org-type">Args</span> ... <span class="org-variable-name">arglist</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span>R <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">T</span>&amp; <span class="org-variable-name">obj</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">return</span> <span class="org-rainbow-delimiters-depth-2">[</span>=<span class="org-rainbow-delimiters-depth-2">](</span><span class="org-type">T</span>&amp; <span class="org-variable-name">obj</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-keyword">return</span> <span class="org-rainbow-delimiters-depth-3">(</span>obj.*pMemfn<span class="org-rainbow-delimiters-depth-3">)(</span>arglist ...<span class="org-rainbow-delimiters-depth-3">)</span>; <span class="org-rainbow-delimiters-depth-2">}</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Usage:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">CNCMachine</span> <span class="org-variable-name">mach1</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"7Z9FA"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-type">CNCMachine</span> <span class="org-variable-name">mach2</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"MY9FT"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-keyword">auto</span> <span class="org-variable-name">setSpeed10</span> = makeCommand<span class="org-rainbow-delimiters-depth-1">(</span>&amp;<span class="org-constant">CNCMachine</span>::setSpeed, 10<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-keyword">auto</span> <span class="org-variable-name">shutdown</span>   = makeCommand<span class="org-rainbow-delimiters-depth-1">(</span>&amp;<span class="org-constant">CNCMachine</span>::shutdown<span class="org-rainbow-delimiters-depth-1">)</span>;
setSpeed10<span class="org-rainbow-delimiters-depth-1">(</span>mach1<span class="org-rainbow-delimiters-depth-1">)</span>;
setSpeed10<span class="org-rainbow-delimiters-depth-1">(</span>mach2<span class="org-rainbow-delimiters-depth-1">)</span>;
shutdown<span class="org-rainbow-delimiters-depth-1">(</span>mach2<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>Dynamic load an [U] nix-shared library or shared object.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">/** </span><span class="org-comment">Type synonym for shared library handler </span>
<span class="org-comment"> *  Requires: #include &lt;dlfcn.h&gt; and -ldl linker flag */</span>
<span class="org-keyword">using</span> <span class="org-type">LibHandle</span> = <span class="org-constant">std</span>::<span class="org-type">unique_ptr</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">void</span>, <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-type">void</span>*<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">&gt;</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>;

<span class="org-keyword">auto</span> <span class="org-function-name">loadDLL</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">libPath</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">LibHandle</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Return unique_ptr for RAAI -&gt; Resource Acquisition is Initialization</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">releasing closing handle when the unique_ptr goes out of scope. </span>
        <span class="org-keyword">return</span> LibHandle<span class="org-rainbow-delimiters-depth-2">(</span>
                dlopen<span class="org-rainbow-delimiters-depth-3">(</span>libPath.c_str<span class="org-rainbow-delimiters-depth-4">()</span>, RTLD_LAZY<span class="org-rainbow-delimiters-depth-3">)</span>,
                <span class="org-rainbow-delimiters-depth-3">[](</span><span class="org-type">void</span>* <span class="org-variable-name">h</span><span class="org-rainbow-delimiters-depth-3">){</span>
                        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [INFO] Shared library handle released OK."</span> &lt;&lt; <span class="org-string">"\n"</span>;
                        dlclose<span class="org-rainbow-delimiters-depth-4">(</span>h<span class="org-rainbow-delimiters-depth-4">)</span>;
                <span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">)</span>;     
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Load symbol from shared library </span>
<span class="org-comment">  *  Requires: #include &lt;dlfcn.h&gt; and -ldl linker flag */</span>
<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">typename</span> <span class="org-type">Function</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">auto</span> <span class="org-function-name">loadSymbol</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">LibHandle</span>&amp; <span class="org-variable-name">handle</span>, <span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">symbol</span><span class="org-rainbow-delimiters-depth-1">)</span> -&gt; <span class="org-type">Function</span>* <span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-type">void</span>* <span class="org-variable-name">voidptr</span> = dlsym<span class="org-rainbow-delimiters-depth-2">(</span>handle.get<span class="org-rainbow-delimiters-depth-3">()</span>, symbol.c_str<span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>voidptr == <span class="org-constant">nullptr</span><span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-keyword">return</span> <span class="org-constant">nullptr</span>;
        <span class="org-keyword">return</span> <span class="org-keyword">reinterpret_cast</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">Function</span>*<span class="org-rainbow-delimiters-depth-2">&gt;(</span>voidptr<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Usage: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">GNU Scientific Library - Linear Algebra CBLAS </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">handle1</span> = loadDLL<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/usr/lib64/libgslcblas.so"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-keyword">using</span> <span class="org-type">cblas_daxpy_type</span> = <span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span>, <span class="org-type">double</span>, <span class="org-keyword">const</span> <span class="org-type">double</span>*, <span class="org-type">int</span>, <span class="org-type">double</span>*, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-keyword">auto</span> <span class="org-variable-name">cblas_daxpy</span> = loadSymbol<span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">cblas_daxpy_type</span><span class="org-rainbow-delimiters-depth-1">&gt;(</span>handle1, <span class="org-string">"cblas_daxpy"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Or </span>
<span class="org-keyword">auto</span> <span class="org-variable-name">cblas_daxpy</span> = loadSymbol<span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span>, <span class="org-type">double</span>, <span class="org-keyword">const</span> <span class="org-type">double</span>*, <span class="org-type">int</span>, <span class="org-type">double</span>*, <span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">&gt;(</span>handle1, <span class="org-string">"cblas_daxpy"</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-keyword">auto</span> <span class="org-variable-name">xs</span> = <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;{</span> 3.0, 5.0, 6.0, 10.0, 8.0<span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-keyword">auto</span> <span class="org-variable-name">ys</span> = <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;{</span> 2.0, 2.0, 2.0,  2.0, 2.0<span class="org-rainbow-delimiters-depth-1">}</span>;
printContainer<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"xs"</span>, xs<span class="org-rainbow-delimiters-depth-1">)</span>;
printContainer<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"ys"</span>, ys<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Compute xs * 4.0 + ys</span>
cblas_daxpy<span class="org-rainbow-delimiters-depth-1">(</span>xs.size<span class="org-rainbow-delimiters-depth-2">()</span>, 4.0, &amp;xs<span class="org-rainbow-delimiters-depth-2">[</span>0<span class="org-rainbow-delimiters-depth-2">]</span>, 1, &amp;ys<span class="org-rainbow-delimiters-depth-2">[</span>0<span class="org-rainbow-delimiters-depth-2">]</span>, 1<span class="org-rainbow-delimiters-depth-1">)</span>;
printContainer<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"ys"</span>, ys<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
Output: 
</p>

<div class="org-src-container">
<pre class="src src-text"> [INFO]  Loaded clblas_daxpy OK!
xs = 3, 5, 6, 10, 8, 
ys = 2, 2, 2, 2, 2, 
ys = 14, 22, 26, 42, 34, 
 [INFO] Shared library handle released OK.
</pre>
</div>


<p>
Complete Output: 
</p>

<div class="org-src-container">
<pre class="src src-txt">$ g++ template-variadic.cpp -o template-variadic.bin -g -std=c++11 -Wall -Wextra -ldl 
$ ./template-variadic.bin

EXPERIMENT 1 = Function of many argument for printing all of them
---------------------------------------
hello world       size = 12
10                size =  4
x                 size =  1
20.23             size =  4
1                 size =  1
nan               size =  4
 [TRACE] Base case =&gt; x = nan

EXPERIMENT 2 = Indirect method invocation
--------------------------------------
[MACHINE] id = 7Z9FA Set machine speed to level 10
[MACHINE] id = MY9FT Set machine speed to level 10
[MACHINE] id = 7Z9FA  Equipment to position set to  x = 10 ; y = -20
[MACHINE] id = MY9FT  Equipment to position set to  x = 10 ; y = -20
[MACHINE] id = 7Z9FA Shutdown equipment
[MACHINE] id = MY9FT Shutdown equipment

EXPERIMENT 3 = Dynamic Loading from shared library (libgslcblas.so) 
--------------------------------------
 [INFO]  Loaded clblas_daxpy OK!
xs = 3, 5, 6, 10, 8, 
ys = 2, 2, 2, 2, 2, 
ys = 14, 22, 26, 42, 34, 
 [INFO] Shared library handle released OK.
</pre>
</div>

<p>
References:  
</p>
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/27604128/c-stdfunction-like-template-syntax">c++11 - C++ std::function-like template syntax - Stack Overflow</a></li>
<li><a href="https://www.nag.com/numeric/FL/nagdoc_fl24/html/F06/f06ecf.html">F06ECF (DAXPY) : NAG Library, Mark 24</a></li>
<li><a href="https://dwheeler.com/program-library/Program-Library-HOWTO/x172.html">Dynamically Loaded (DL) Libraries</a></li>
<li><a href="https://www.gnu.org/software/gsl/doc/html/cblas.html">GSL CBLAS Library — GSL 2.5 documentation</a></li>
</ul>
</div>
</div>
