Understanding-CPP.html

<div id="outline-container-org63b0b1d" class="outline-4">
<h4 id="org63b0b1d"><span class="section-number-4">1.13.8</span> References and Bookmarks</h4>
<div class="outline-text-4" id="text-1-13-8">
<p>
General 
</p>

<ul class="org-ul">
<li><a href="https://en.cppreference.com/w/cpp/language/templates">Templates - cppreference.com</a></li>

<li><a href="https://en.cppreference.com/w/cpp/header/type_traits">Standard library header &lt;type_traits&gt; - cppreference.com</a></li>

<li><a href="https://en.cppreference.com/w/cpp/language/class_template">Class template - cppreference.com</a></li>
</ul>


<p>
Templates and Iterators: 
</p>
<ul class="org-ul">
<li><a href="https://www.fluentcpp.com/2018/05/08/std-iterator-deprecated/">std::iterator is deprecated: Why, What It Was, and What to Use Instead - Fluent C++</a></li>
</ul>

<p>
Dependent Type Names: 
</p>
<ul class="org-ul">
<li><a href="http://www.enseignement.polytechnique.fr/informatique/INF478/docs/Cpp/en/cpp/language/dependent_name.html">Dependent names - cppreference.com</a></li>
</ul>

<p>
Variadic Templates:
</p>
<ul class="org-ul">
<li><a href="http://www.cplusplus.com/articles/EhvU7k9E/">C++11 - New features - Variadic template - C++ Articles</a></li>
<li><a href="http://kevinushey.github.io/blog/2016/01/27/introduction-to-c++-variadic-templates/">Introduction to C++ Variadic Templates · R and C++</a></li>
<li><a href="https://docs.microsoft.com/en-gb/cpp/cpp/ellipses-and-variadic-templates?view=vs-2017">Ellipses and Variadic Templates | Microsoft Docs</a></li>
<li><a href="https://stackoverflow.com/questions/27604128/c-stdfunction-like-template-syntax">c++11 - C++ std::function-like template syntax - Stack Overflow</a></li>
</ul>

<p>
Papers and technical documents about Generic Programming and Template Metaprogramming 
</p>

<ul class="org-ul">
<li>Alexander Stepanov and David R. Musser - <b>Generic Programming</b> -
<a href="http://stepanovpapers.com/genprog.pdf">http://stepanovpapers.com/genprog.pdf</a></li>

<li>Alexander Stepanov and Meng Lee. <b>The Standard Template Library</b>
<ul class="org-ul">
<li><a href="http://stepanovpapers.com/STL/DOC.PDF">http://stepanovpapers.com/STL/DOC.PDF</a></li>
</ul></li>

<li>Alexandre Duret-Lutz et al. <b>Design Patterns for Generic Programming in C++</b>
<ul class="org-ul">
<li><a href="https://www.lrde.epita.fr/dload/papers/coots01.html">https://www.lrde.epita.fr/dload/papers/coots01.html</a></li>
</ul></li>

<li>Alexandre Duret-Lutz et al. <b>Design Patterns for Generic Programming in C++</b>
<ul class="org-ul">
<li><a href="https://www.usenix.org/legacy/events/coots01/full_papers/duret/duret_html/index.html">https://www.usenix.org/legacy/events/coots01/full_papers/duret/duret_html/index.html</a></li>
</ul></li>

<li>James C. Dehnert and Alexander Stepanov. <b>Fundamentals of Generic Programming</b>
<ul class="org-ul">
<li><a href="http://stepanovpapers.com/DeSt98.pdf">http://stepanovpapers.com/DeSt98.pdf</a></li>
</ul></li>

<li>Jeremy Gibbons. <b>Patterns in Datatype-Generic Programming</b>
<ul class="org-ul">
<li><a href="http://www.cs.ox.ac.uk/jeremy.gibbons/publications/patterns.pdf">http://www.cs.ox.ac.uk/jeremy.gibbons/publications/patterns.pdf</a></li>
</ul></li>

<li>Giuseppe Lipari. <b>Design Patterns in C++ Template metaprogramming</b>
<ul class="org-ul">
<li><a href="http://retis.sssup.it/~lipari/courses/oosd2010-2/07.metaprogramming-handout.pdf">http://retis.sssup.it/~lipari/courses/oosd2010-2/07.metaprogramming-handout.pdf</a></li>
</ul></li>

<li>Gabriel Dos Reis and Jaakko Jarvi. <b>What is Generic Programming?</b>
<ul class="org-ul">
<li><a href="https://pdfs.semanticscholar.org/e730/3991015a041e50c7bdabbe4cb4678531e35b.pdf">https://pdfs.semanticscholar.org/e730/3991015a041e50c7bdabbe4cb4678531e35b.pdf</a></li>
</ul></li>

<li><b>Functional Programming with C++ Template Metaprograms</b>
<ul class="org-ul">
<li><a href="https://pdfs.semanticscholar.org/c7f3/a67b78dabd5aa6c4599a127583c07bb8c032.pdf">https://pdfs.semanticscholar.org/c7f3/a67b78dabd5aa6c4599a127583c07bb8c032.pdf</a></li>
</ul></li>

<li><b>Implementing Monads for C++ Template Metaprograms</b>
<ul class="org-ul">
<li><a href="http://plcportal.inf.elte.hu/en/publications/TechnicalReports/monad-tr.pdf">http://plcportal.inf.elte.hu/en/publications/TechnicalReports/monad-tr.pdf</a></li>
</ul></li>

<li>Angelika Langer. <b>C++ Expression Templates - An Introduction to the</b>
<b>Principles of Expression Templates</b>
<ul class="org-ul">
<li><a href="http://www.angelikalanger.com/Articles/Cuj/ExpressionTemplates/ExpressionTemplates.htm">http://www.angelikalanger.com/Articles/Cuj/ExpressionTemplates/ExpressionTemplates.htm</a></li>
</ul></li>

<li><b>Advanced C++ Template Techniques: An Introduction to Meta-Programming for Scientific Computing</b>
<ul class="org-ul">
<li><a href="https://conradsanderson.id.au/misc/sanderson_templates_lecture_uqcomp7305.pdf">https://conradsanderson.id.au/misc/sanderson_templates_lecture_uqcomp7305.pdf</a></li>
</ul></li>

<li><a href="http://people.cs.uchicago.edu/~jacobm/pubs/templates.html">What's Wrong with C++ Templates?</a></li>
</ul>
</div>
</div>
</div>
