Understanding-CPP.html
<div id="outline-container-orgc693a28" class="outline-3">
<h3 id="orgc693a28"><span class="section-number-3">1.14</span> Books</h3>
<div class="outline-text-3" id="text-1-14">
<ul class="org-ul">
<li>Bruce Eckel. <b>Thinking in C++</b>. 1995
<ul class="org-ul">
<li>Notes: Despite being an old book, it has a step-by-step coverage
of C++ main concepts and some design patterns.</li>
</ul></li>

<li>Andrei Alexandrescu. <b>Modern C++ Design: Generic Programming and</b>
<b>Design Patterns Applied 1st Edition</b>. 2001 
<ul class="org-ul">
<li>Notes: Provides a comprehensive and broad coverage of C++
generic/template metaprogramming.</li>
<li>Link: <a href="https://www.amazon.com/Modern-Design-Generic-Programming-Patterns/dp/0201704315">Amazon</a></li>
</ul></li>

<li>Scott Meyers. <b>Effective C++ Third Edition, 55 Specific Ways to Improve Your</b>
<b>Programs and Designs</b></li>

<li>Andrew Koenig and Barbara E. Moo. <b>Accelerated C++: Practical Programming by Example</b></li>

<li>Bjarne Stroustrup. <b>Tour of C++ second edition</b></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-10-12 Fri 18:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
